Repository: doc-br/zanata
Catalog: articles/*/bsdl-gpl.po
Languages: es_es

source: A BSD license gives a small company the equivalent of software-in-escrow without any legal complications or costs. If a BSD-licensed program becomes orphaned, a company can simply take over, in a proprietary manner, the program on which they are dependent. An even better situation occurs when a BSD code-base is maintained by a small informal consortium, since the development process is not dependent on the survival of a single company or product line. The survivability of the development team when they are mentally in the zone is much more important than simple physical availability of the source code.
es_es: Una licencia BSD le da a una compañía pequeña el equivalente a un software en custodia sin ninguna complicación legal ni coste. Si un programa con licencia BSD llega a quedar huérfano, una compañía puede simplemente asumir, de un modo propietario, el programa del cual dependen. Una situación incluso mejor se da cuando el código BSD se mantiene por una pequeño consorcio informal, ya que el proceso de desarrollo no depende de la supervivencia de una sola compañía o de una línea de productos. La capacidad de supervivencia del equipo de desarrolladores cuando están motivados es mucho más importante que la disponibilidad del código fuente.

source: What a license cannot do
es_es: Lo que no puede hacer una licencia

source: No license can guarantee future software availability. Although a copyright holder can traditionally change the terms of a copyright at anytime, the presumption in the BSD community is that such an attempt simply causes the source to fork.
es_es: Ninguna licencia puede garantizar la disponibilidad futura de un software. Aunque un poseedor de un copyright normalmente puede cambiar los términos de ese copyright en cualquier momento, la presunción en la comunidad BSD es que tal intento simplemente provoca que se haga un fork del código fuente.

source: The GPL explicitly disallows revoking the license. It has occurred, however, that a company (Mattel) purchased a GPL copyright (cphack), revoked the entire copyright, went to court, and prevailed [2]. That is, they legally revoked the entire distribution and all derivative works based on the copyright. Whether this could happen with a larger and more dispersed distribution is an open question; there is also some confusion regarding whether the software was really under the GPL.
es_es: La licencia GPL rechaza explícitamente la revocación de la licencia. Sin embargo, ocurrió que una compañía, (Mattel) compró un software con copyright GPL (cphack), revocó el copyright completo, fue a los tribunales, y ganó [2]. Es decir, revocaron legalmente toda la distribución y todos los trabajos derivados basados en el copyright. Que esto pudiera ocurrir con una distribución mayor y más dispersa es una cuestión abierta; hay también cierta confusión respecto a si el software estaba realmente bajo la licencia GPL.

source: In another example, Red Hat purchased Cygnus, an engineering company that had taken over development of the FSF compiler tools. Cygnus was able to do so because they had developed a business model in which they sold support for GNU software. This enabled them to employ some 50 engineers and drive the direction of the programs by contributing the preponderance of modifications. As Donald Rosenberg states "projects using licenses like the GPL...live under constant threat of having someone take over the project by producing a better version of the code and doing it faster than the original owners." [3]
es_es: Otro ejemplo, Red Had adquirió Cygnus, una empresa de ingeniería que se había hecho cargo del desarrollo de las herramientas del compilador de la FSF. Cygnus fue capaz de hacerlo porque había desarrollado un modelo de negocio en la cual vendían el soporte para el software de GNU. Esto les permitió contratar a 50 ingenieros y dirigir la orientación de los programas aportando la mayoría de las modificaciones. Como dice Donald Rosenberg "los proyectos que usan licencias como la GPL... viven bajo una amenaza constante de que alguien tome el control del proyecto y produzca una versión mejor del código y que lo haga más rápido que los propietarios originales."[3]

source: GPL Advantages and Disadvantages
es_es: Ventajas y Desventajas de la licencia GPL

source: A common reason to use the GPL is when modifying or extending the gcc compiler. This is particularly apt when working with one-off specialty CPUs in environments where all software costs are likely to be considered overhead, with minimal expectations that others will use the resulting compiler.
es_es: Una razón habitual para usar la licencia GPL es cuando se modifica o se extiende el compilador gcc. Esto es particularmente conveniente cuando se trabaja con CPUs muy especializadas en ambientes donde todos los costes del software son probablemente considerados costes generales, con mínimas expectativas de que otros usen el compilador resultante.

source: The GPL is also attractive to small companies selling CDs in an environment where "buy-low, sell-high" may still give the end-user a very inexpensive product. It is also attractive to companies that expect to survive by providing various forms of technical support, including documentation, for the GPLed intellectual property world.
es_es: La licencia GPL también es atractiva para pequeñas compañías que venden CDs en un entorno donde "compra barato, vende caro" aun puede ofrecer al usuario final un producto muy económico. También es atractivo para las empresas que esperan sobrevivir suministrando diferentes formas de soporte técnico, incluida la documentación, para el mundo de la propiedad intelectual licenciada bajo la licencia GPL.

source: A less publicized and unintended use of the GPL is that it is very favorable to large companies that want to undercut software companies. In other words, the GPL is well suited for use as a marketing weapon, potentially reducing overall economic benefit and contributing to monopolistic behavior.
es_es: Un uso menos frecuente y no previsto por la licencia GPL es que es muy favorable para las grandes compañías que quieren vender a precios más baratos que las empresas de software. En otras palabras, la licencia GPL es muy adecuada para usarse como un arma de marketing, reduciendo potencialmente el beneficio económico global y contribuyendo a un comportamiento monopolístico.

source: The GPL can present a real problem for those wishing to commercialize and profit from software. For example, the GPL adds to the difficulty a graduate student will have in directly forming a company to commercialize his research results, or the difficulty a student will have in joining a company on the assumption that a promising research project will be commercialized.
es_es: La licencia GPL puede presentar un problema serio para aquellos que desean comercializar y sacar beneficio del software. Por ejemplo, a la GPL se suma la dificultad que tendrá un estudiante graduado en formar una empresa para comercializar resultados de su investigación, o la dificultad que tendrá un estudiante para unirse a una empresa en el supuesto de que se comercializará un proyecto de investigación prometedor.

source: For those who must work with statically-linked implementations of multiple software standards, the GPL is often a poor license, because it precludes using proprietary implementations of the standards. The GPL thus minimizes the number of programs that can be built using a GPLed standard. The GPL was intended to not provide a mechanism to develop a standard on which one engineers proprietary products. (This does not apply to Linux applications because they do not statically link, rather they use a trap-based API.)
es_es: Para aquellos que deben trabajar con implementaciones enlazadas estáticamente de múltiples estándares de software, la licencia GPL es a menudo una licencia deficiente, porque impide el uso de implementaciones propietarias de los estándares. De este modo, la GPL minimiza el número de programas que pueden construirse utilizando un estándar GPL. La licencia GPL tenía la intención de no proporcionar un mecanismo para desarrollar un estándar sobre el cual uno pudiera diseñar productos propietarios. (Esto no aplica en las aplicaciones Linux porque no se enlazan estáticamente, sino que utilizan una trap-based API).

source: The GPL attempts to make programmers contribute to an evolving suite of programs, then to compete in the distribution and support of this suite. This situation is unrealistic for many required core system standards, which may be applied in widely varying environments which require commercial customization or integration with legacy standards under existing (non-GPL) licenses. Real-time systems are often statically linked, so the GPL and LGPL are definitely considered potential problems by many embedded systems companies.
es_es: La licencia GPL intenta que los programadores contribuyan a una serie de programas en evolución, para luego competir en la distribución y soporte de esos programas. Esta situación no es realista para muchos estándares básicos del sistema, que pueden aplicarse en entornos muy diversos los cuales requieren de una personalización comercial o integración con estándares heredados bajo licencias (no GPL) existentes . Los sistemas en tiempo real suelen estar enlazados estáticamente, de manera que las licencias GPL y LGPL son consideras potencialmente problematicas por muchos compañias de sistemas encastrados.

source: The GPL is an attempt to keep efforts, regardless of demand, at the research and development stages. This maximizes the benefits to researchers and developers, at an unknown cost to those who would benefit from wider distribution.
es_es: La licencia GPL es un intento de mantener los esfuerzos, independientemente de la demanda, en la etapas de investigación y desarrollo. Esto maximiza los beneficios de los investigadores y desarrolladores, a un coste desconocido para aquellos que se beneficiarían de una distribución más amplia.

source: The GPL was designed to keep research results from transitioning to proprietary products. This step is often assumed to be the last step in the traditional technology transfer pipeline and it is usually difficult enough under the best of circumstances; the GPL was intended to make it impossible.
es_es: La licencia GPL se diseñó para evitar que los resultados de una investigación se conviertan en productos propietarios. A menudo, se supone que este paso es el último en la línea tradicional de transferencia de tecnología y, por lo general, es lo suficientemente difícil en las mejores circunstancias; la GPL pretendía hacerlo imposible.

source: BSD Advantages
es_es: Ventajas de BSD

source: A BSD style license is a good choice for long duration research or other projects that need a development environment that:
es_es: Una licencia de estilo BSD es una buena elección para investigaciones de larga duración o para otros proyectos que necesitan un entorno de desarrollo que:

source: has near zero cost
es_es: Tiene un coste casi nulo

source: will evolve over a long period of time
es_es: Se desarrollará durante un largo periodo de tiempo

source: permits anyone to retain the option of commercializing final results with minimal legal issues.
es_es: Permite a cualquiera mantener la opción de comercializar los resultados finales con mínimos problemas legales.

source: This final consideration may often be the dominant one, as it was when the Apache project decided upon its license:
es_es: Esta consideración final puede ser con frecuencia la dominante, como lo fue cuando el proyecto Apache decidió su licencia:

source: <quote>This type of license is ideal for promoting the use of a reference body of code that implements a protocol for common service. This is another reason why we choose it for the Apache group - many of us wanted to see HTTP survive and become a true multiparty standard, and would not have minded in the slightest if Microsoft or Netscape choose to incorporate our HTTP engine or any other component of our code into their products, if it helped further the goal of keeping HTTP common... All this means that, strategically speaking, the project needs to maintain sufficient momentum, and that participants realize greater value by contributing their code to the project, even code that would have had value if kept proprietary.</quote>
es_es: <quote>Este tipo de licencia es ideal para promover el uso de un código de referencia que implemente un protocolo para un servicio común. Esta es otra razón por la cual la escogimos para el grupo Apache - muchos de nosotros queríamos ver a HTTP sobrevivir y convertirse en un verdadero estándar comunitario, y no nos habría importado en lo más mínimo si Microsoft o Netscape hubieran elegido incorporar nuestro motor HTTP o cualquier otro componente de nuestro código en sus productos, si esto ayudaba además al objetivo de mantener a HTTP comunitario... Todo esto significa que, estratégicamente hablando, el proyecto necesita mantener el impulso suficiente, y que los participantes se den cuenta del valor de contribuir con su código al proyecto, incluso código que hubiera tenido valor si se mantuviera como propietario.</quote>

source: Developers tend to find the BSD license attractive as it keeps legal issues out of the way and lets them do whatever they want with the code. In contrast, those who expect primarily to use a system rather than program it, or expect others to evolve the code, or who do not expect to make a living from their work associated with the system (such as government employees), find the GPL attractive, because it forces code developed by others to be given to them and keeps their employer from retaining copyright and thus potentially "burying" or orphaning the software. If you want to force your competitors to help you, the GPL is attractive.
es_es: Los desarrolladores tienden a encontrar atractiva la licencia BSD ya que quita de en medio los asuntos legales y les permite hacer lo que quieran con el código. Por contra, aquellos que esperan principalmente usar un sistema en lugar de programarlo, o esperan que otros desarrollen el código, o quienes no esperan ganarse la vida con sus trabajos asociados con el sistema (tales como los empleados del gobierno), encuentran atractiva la licencia GPL, porque fuerza a que el código desarrollado por otros les sea devuelto y evita que sus empleadores retengan el copyright y por tanto potencialmente "entierren" o dejen huérfano al software. Si quiere forzar a sus competidores a ayudarle, la licencia GPL es atractiva.

source: A BSD license is not simply a gift. The question <quote>why should we help our competitors or let them steal our work?</quote> comes up often in relation to a BSD license. Under a BSD license, if one company came to dominate a product niche that others considered strategic, the other companies can, with minimal effort, form a mini-consortium aimed at reestablishing parity by contributing to a competitive BSD variant that increases market competition and fairness. This permits each company to believe that it will be able to profit from some advantage it can provide, while also contributing to economic flexibility and efficiency. The more rapidly and easily the cooperating members can do this, the more successful they will be. A BSD license is essentially a minimally complicated license that enables such behavior.
es_es: Una licencia BSD no es simplemente un regalo. La cuestión <quote>¿por qué deberíamos ayudar a nuestros competidores o dejarles que roben nuestro trabajo?</quote> surge frecuentemente en relación con la licencia BSD. Bajo una licencia BSD, si una compañia llega a dominar un nicho de mercado que otras consideran estratégico, las otras compañías pueden, con un mínimo esfuerzo, formar un mini-consorcio destinado a restablecer la igualdad contribuyendo a una variante de BSD competitiva que aumente la competencia y la equidad en el mercado. Esto permite a cada compañía tener confianza en que podrá beneficiarse de algunas ventajas, a la vez que contribuyen a la flexibilidad y eficiencia económica. Cuanto más rápido y fácil puedan hacerlo los miembros que están cooperando, más éxito tendrán. Una licencia BSD es esencialmente una licencia mínimamente complicada que permite tal comportamiento.

source: A key effect of the GPL, making a complete and competitive Open Source system widely available at cost of media, is a reasonable goal. A BSD style license, in conjunction with ad-hoc-consortiums of individuals, can achieve this goal without destroying the economic assumptions built around the deployment-end of the technology transfer pipeline.
es_es: Un efecto clave de la GPL, es hacer que un sistema de Código Abierto se encuentre ampliamente disponible al coste del medio, es un objetivo razonable. Una licencia de estilo BSD, en conjunto con un consorcio ad-hoc de personas, pueden conseguir este objetivo sin destruir los supuestos económicos construidos alrededor del producto final

source: Specific Recommendations for using a BSD license
es_es: Recomendaciones Específicas para usar una licencia BSD

source: The BSD license is preferable for transferring research results in a way that will widely be deployed and most benefit an economy. As such, research funding agencies, such as the NSF, ONR and DARPA, should encourage in the earliest phases of funded research projects, the adoption of BSD style licenses for software, data, results, and open hardware. They should also encourage formation of standards based around implemented Open Source systems and ongoing Open Source projects.
es_es: La licencia BSD es preferible para la transferencia de los resultados de una investigación de forma que sean implementados ampliamente y beneficie a la economía. Por lo tanto, las agencias que financian la investigación, como NSF, ONR y DARPA, deberían incentivar en las primeras fases de los proyectos de investigación que financien, la adopción de licencia de estilo BSD para software, datos, resultados y hardware abierto. También deberían incentivar la formación de estándares basados en sistemas de código abierto ya implementados y en proyectos de código abierto que estén en curso.

source: Government policy should minimize the costs and difficulties in moving from research to deployment. When possible, grants should require results to be available under a commercialization friendly BSD style license.
es_es: La política gubernamental debería reducir al mínimo los costes y las dificultades de pasar de la investigación a la distribución. Cuando sea posible, las subvenciones deberían exigir que los resultados estén disponibles bajo una licencia de estilo BSD compatible con la comercialización.

source: In many cases, the long-term results of a BSD style license more accurately reflect the goals proclaimed in the research charter of universities then what occurs when results are copyrighted or patented and subject to proprietary university licensing. Anecdotal evidence exists that universities are financially better rewarded in the long run by releasing research results and then appealing to donations from commercially successful alumni.
es_es: En muchos casos, los resultados a largo plazo de una licencia de estilo BSD reflejan con más precisión los objetivos establecidos en el estatuto de investigación de las univerdidades que cuando los resultados están protegidos por derechos de autor o están patentados y sujetos a licencias universitarias propias. Hay evidencias de que las universidades tienen una mejor recompensa financiera cuando liberar los resultados de sus investigaciones y luego solicitan donaciones a los ex-alumnos que han tenido éxito comercialmente.

source: Companies have long recognized that the creation of de facto standards is a key marketing technique. The BSD license serves this role well, if a company really has a unique advantage in evolving the system. The license is legally attractive to the widest audience while the company's expertise ensures their control. There are times when the GPL may be the appropriate vehicle for an attempt to create such a standard, especially when attempting to undermine or co-opt others. The GPL, however, penalizes the evolution of that standard, because it promotes a suite rather than a commercially applicable standard. Use of such a suite constantly raises commercialization and legal issues. It may not be possible to mix standards when some are under the GPL and others are not. A true technical standard should not mandate exclusion of other standards for non-technical reasons.
es_es: Hace tiempo que las empresas han reconocido que la creación de estándares de facto es una técnica de marketing clave. La licencia BSD cumple bien esta función, si una compañía realmente tiene una ventaja única en la evolución del sistema. La licencia es atractiva desde el punto de vista legal para la gran mayoría, mientras que la experiencia de la empresa garantiza su control. Hay ocasiones en que la licencia GPL puede ser el medio adecuado para intentar crear un estándar, especialmente cuando se trata de debilitar o apropiarse de otros. La licencia GPL, sin embargo, penaliza la evolución de ese estándar, porque promueve una suiteen lugar de un estándar que se pueda aplicar comercialmente. El uso de dicha suite plantea de manera constante problemas legales y de comercialización. Puede que no sea posible mezclar estándares cuando algunos están bajo la GPL y otros no. Un verdadero estándar no debería obligar a excluir otros estándares por razones no tecnicas.

source: Companies interested in promoting an evolving standard, which can become the core of other companies' commercial products, should be wary of the GPL. Regardless of the license used, the resulting software will usually devolve to whoever actually makes the majority of the engineering changes and most understands the state of the system. The GPL simply adds additional legal friction to the result.
es_es: Las compañías interesadas en promover un estándar en evolución, que podría convertise en el núcleo de los productos comerciales de otras compañías, deben ser cautelosas con la licencia GPL. Independientemente de la licencia utilizada, el software resultante normalmente recaerá a quienquiera que haga la mayoría de los cambios de ingeniería y entienda mejor el estado del sistema. La licencia GPL simplemente añade desacuerdos legales al resultados.

source: Large companies, in which Open Source code is developed, should be aware that programmers appreciate Open Source because it leaves the software available to the employee when they change employers. Some companies encourage this behavior as an employment perk, especially when the software involved is not directly strategic. It is, in effect, a front-loaded retirement benefit with potential lost opportunity costs but no direct costs. Encouraging employees to work for peer acclaim outside the company is a cheap portable benefit a company can sometimes provide with near zero downside.
es_es: Las grandes empresas, en las que se desarrolla Código Abierto, deben ser conscientes de que los programadores aprecian el Código Abierto porque deja el software a disposición de los empleados cuando cambian de empleador. Algunas empresas fomentan este comportamiento como una ventaja laboral, especialmente cuando el software en cuestión no es estratégico. Alentar a los empleados a trabajar para lograr la valoración de sus compañeros fuera de la compañía es una ventaja sencilla que la compañía puede ofrecer sin casi inconvenientes.
