Repository: doc-br/zanata
Catalog: articles/*/bsdl-gpl.po
Languages: es_es

# _
source: translator-credits
es_es: Manuel Megías joramsinkin@hotmail.com, 2018 Sergio Carlavilla carlavilla@mailbox.org, 2019

source: Why you should use a BSD style license for your Open Source Project
es_es: ¿Por qué debería usar una licencia de estilo BSD para su Proyecto de Código Abierto?

source: Introduction
es_es: Introducción

source: This document makes a case for using a BSD style license for software and data; specifically it recommends using a BSD style license in place of the GPL. It can also be read as a BSD versus GPL Open Source License introduction and summary.
es_es: Este documento aboga por emplear la licencia de estilo BSD para software y datos; recomienda específicamente usar una licencia de estilo BSD en lugar de la licencia GPL. Se puede leer también como una introducción o resumen de la licencia de Código Abierto BSD frente a la GPL.

source: Very Brief Open Source History
es_es: Una historia muy breve del Código Abierto

source: Long before the term <quote>Open Source</quote> was used, software was developed by loose associations of programmers and freely exchanged. Starting in the early 1950's, organizations such as <link xlink:href="http://www.share.org">SHARE</link> and <link xlink:href="http://www.decus.org">DECUS</link> developed much of the software that computer hardware companies bundled with their hardware offerings. At that time computer companies were in the hardware business; anything that reduced software cost and made more programs available made the hardware companies more competitive.
es_es: Mucho antes de que el término <quote>Código Abierto</quote> fuera usado, el software estaba desarrollado por vagas asociaciones de programadores que lo intercambiaban libremente. Comenzando a principio de los años 50, organizaciones tales como <link xlink:href="http://www.share.org">SHARE</link> y <link xlink:href="http://www.decus.org">DECUS</link> desarrollaron mucho del software que las compañías de hardware incluían en sus ofertas. En aquel entonces las compañías de ordenadores se dedicaban al negocio del hardware; cualquier cosa que redujera los costos del software e hiciera que más programas estuvieran disponibles hacía a las compañías de hardware más competitivas.

source: This model changed in the 1960's. In 1965 ADR developed the first licensed software product independent of a hardware company. ADR was competing against a free IBM package originally developed by IBM customers. ADR patented their software in 1968. To stop sharing of their program, they provided it under an equipment lease in which payment was spread over the lifetime of the product. ADR thus retained ownership and could control resale and reuse.
es_es: Este modelo cambió en los años 60. En 1965 la ADR desarrolló el primer producto de software con licencia que era independiente de una compañía de hardware. ADR estaba compitiendo con un paquete gratuito de IBM desarrollado originalmente por los clientes de IBM. ADR patentó su software en 1968. Para dejar de compartir programas, los suministraron bajo un contrato de arrendamiento del equipo en el que el pago se extendía durante toda la vida del producto. ADR retenía así la propiedad y podía controlar la reventa y la reutilización.

source: In 1969 the US Department of Justice charged IBM with destroying businesses by bundling free software with IBM hardware. As a result of this suit, IBM unbundled its software; that is, software became independent products separate from hardware.
es_es: En 1969, el Departamento de Justicia de los Estados Unidos acusó a IBM de destruir negocios al combinar software libre con su hardware. Como resultado de este demanda, IBM quitó su software; es decir, el software se convirtió en un producto independiente y separado del hardware.

source: In 1968 Informatics introduced the first commercial killer-app and rapidly established the concept of the software product, the software company, and very high rates of return. Informatics developed the perpetual license which is now standard throughout the computer industry, wherein ownership is never transferred to the customer.
es_es: En 1968 la informática introdujo la primera aplicación comercial revolucionaria y estableció rápidamente el concepto de producto de software, compañía de software, y unas tasas muy altas de retorno. La informática desarrolló la licencia perpetua que es ahora estándar en toda la industria de los ordenadores, donde la propiedad nunca se transfiere al cliente.

source: Unix from a BSD Licensing Perspective
es_es: Unix desde una perspectiva de Licencia de BSD

source: AT&amp;T, who owned the original Unix implementation, was a publicly regulated monopoly tied up in anti-trust court; it was legally unable to sell a product into the software market. It was, however, able to provide it to academic institutions for the price of media.
es_es: AT&amp;T, que era el propietario de la implementación original de Unix, era un monopolio regulado públicamente que estaba atado a un tribunal antimonopolio; legalmente no podía vender un producto en el mercado de software. Sin embargo, pudo proporcionarlo a las instituciones académicas por el precio del soporte.

source: Universities rapidly adopted Unix after an OS conference publicized its availability. It was extremely helpful that Unix ran on the PDP-11, a very affordable 16-bit computer, and was coded in a high-level language that was demonstrably good for systems programming. The DEC PDP-11 had, in effect, an open hardware interface designed to make it easy for customers to write their own OS, which was common. As DEC founder Ken Olsen famously proclaimed, <quote>software comes from heaven when you have good hardware</quote>.
es_es: Las universidades adoptaron rápidamente Unix después de que en una conferencia sobre Sistemas Operativos se publicitara su disponibilidad. Fue extremadamente útil que Unix se ejecutara en el PDP-11, un ordenador de 16-bits muy asequible, y que estuviera escrito un lenguaje de alto nivel que demostró ser muy bueno para la programación de sistemas. El DEC PDP-11 tenía, en efecto, una interfaz de hardware abierta diseñada para facilitar a los clientes escribir su propio sistema operativo, lo cual era común. Como proclamó Ken Olsen, fundador de DEC, <quote>el software viene del cielo cuando tienes un buen hardware</quote>.

source: Unix author Ken Thompson returned to his alma mater, University of California Berkeley (UCB), in 1975 and taught the kernel line-by-line. This ultimately resulted in an evolving system known as BSD (Berkeley Standard Distribution). UCB converted Unix to 32-bits, added virtual memory, and implemented the version of the TCP/IP stack upon which the Internet was essentially built. UCB made BSD available for the cost of media, under what became known as <quote>the BSD license</quote>. A customer purchased Unix from AT&amp;T and then ordered a BSD tape from UCB.
es_es: El autor de Unix Ken Thompson regresó a su alma máter, la Universidad de Berkeley en California (UCB) en 1975 y se dedicó a enseñar el kernel línea a línea. Esto finalmente resultó en un sistema en constante evolución conocido como BSD ("Berkely Standard Distribution" o Distribución Estándar de Berkeley). La UCB convirtió Unix a 32-bits, añadió memoria virtual, e implementó la versión de la pila TCP/IP sobre la que esencialmente se construyó Internet. La UCB hizo accesible a BSD por el precio del soporte, bajo lo que llegó conocerse como <quote>la licencia BSD</quote>. Un cliente compraba Unix a AT&amp;T y después encargaba una cinta con BSD a la UCB.

source: In the mid-1980s a government anti-trust case against ATT ended with the break-up of ATT. ATT still owned Unix and was now able to sell it. ATT embarked on an aggressive licensing effort and most commercial Unixes of the day became ATT-derived.
es_es: A mitad de los 80, un caso gubernamental antimonopolio contra ATT terminó con su desintegración. ATT todavía era dueña de Unix y podía venderlo. ATT se embarcó en un esfuerzo agresivo de licenciamiento y la mayoría de los sistemas Unix comerciales de la época llegaron a ser derivados de los de ATT.

source: In the early 1990's ATT sued UCB over license violations related to BSD. UCB discovered that ATT had incorporated, without acknowledgment or payment, many improvements due to BSD into ATT's products, and a lengthy court case, primarily between ATT and UCB, ensued. During this period some UCB programmers embarked on a project to rewrite any ATT code associated with BSD. This project resulted in a system called BSD 4.4-lite (lite because it was not a complete system; it lacked 6 key ATT files).
es_es: Al principio de los 90 ATT demandó a UCB por violaciones de la licencia relacionada con BSD. La UCB descubrió que ATT había incorporado, sin conocimiento ni retribución, muchas mejoras de BSD en los productos de ATT, y tuvo lugar un largo proceso judicial, principalmente entre ATT y la UCB. Durante este periodo algunos de los programadores de la UCB se embarcaron en un proyecto para reescribir cualquier código de ATT asociado con BSD. Este proyecto resultó en un sistema llamado BSD 4.4-lite ("lite" o ligero, porque no era un sistema completo; carecía de 6 archivos clave de ATT).

source: A lengthy series of articles published slightly later in Dr. Dobbs magazine described a BSD-derived 386 PC version of Unix, with BSD-licensed replacement files for the 6 missing 4.4 lite files. This system, named 386BSD, was due to ex-UCB programmer William Jolitz. It became the original basis of all the PC BSDs in use today.
es_es: Una larga serie de artículos publicados un poco después en la revista Dr. Dobbs describían una versión de Unix para PCs 386 derivada de BSD, con los archivos con licencia BSD para reemplazar a los 6 archivos 4.4 lite que faltaban. Este sistema, llamado 386BSD, se debió al ex-programador de la UCB William Jolitz. Se convirtió en la base de todos los PCs con BSD en uso hoy en día.

source: In the mid 1990s, Novell purchased ATT's Unix rights and a (then secret) agreement was reached to terminate the lawsuit. UCB soon terminated its support for BSD.
es_es: A mitad de los 90, Novell adquirió a ATT los derechos de Unix y se alcanzó un acuerdo (por entonces secreto) para terminar el litigio. UCB pronto puso fin a su soporte a BSD.

source: The Current State of FreeBSD and BSD Licenses
es_es: El Estado Actual de las licencias de FreeBSD y BSD

source: The so-called <link xlink:href="http://www.opensource.org/licenses/bsd-license.php"> new BSD license</link> applied to FreeBSD within the last few years is effectively a statement that you can do anything with the program or its source, but you do not have any warranty and none of the authors has any liability (basically, you cannot sue anybody). This new BSD license is intended to encourage product commercialization. Any BSD code can be sold or included in proprietary products without any restrictions on the availability of your code or your future behavior.
es_es: La llamada <link xlink:href="http://www.opensource.org/licenses/bsd-license.php">nueva licencia BSD</link> aplicada a FreeBSD en los últimos años es realmente una declaración por la cual, se puede hacer cualquier cosa con el programa o su fuente, pero no se tiene ninguna garantía y ninguno de los autores tiene ninguna responsabilidad (básicamente, no se puede demandar a nadie). Esta nueva licencia BSD tiene por objeto alentar la comercialización del producto. Cualquier código de BSD se puede vender o incluir en productos propietarios sin ninguna restricción sobre la disponibilidad del código o su futuro comportamiento.

source: Do not confuse the new BSD license with <quote>public domain</quote>. While an item in the public domain is also free for all to use, it has no owner.
es_es: No confundir la nueva licencia BSD con <quote>dominio público</quote>. Aunque un artículo de dominio público también se puede usar libremente por todos, no tiene dueño.

source: The origins of the GPL
es_es: Los orígenes de la GPL

source: While the future of Unix had been so muddled in the late 1980s and early 1990s, the GPL, another development with important licensing considerations, reached fruition.
es_es: Mientras que el futuro de Unix había sido muy confuso al final de los 80 y principios de los 90, la licencia GPL, otro desarrollo con importantes consideraciones de licencias, llegó a buen puerto.

source: Richard Stallman, the developer of Emacs, was a member of the staff at MIT when his lab switched from home-grown to proprietary systems. Stallman became upset when he found that he could not legally add minor improvements to the system. (Many of Stallman's co-workers had left to form two companies based on software developed at MIT and licensed by MIT; there appears to have been disagreement over access to the source code for this software). Stallman devised an alternative to the commercial software license and called it the GPL, or "GNU Public License". He also started a non-profit foundation, the <link xlink:href="http://www.fsf.org">Free Software Foundation</link> (FSF), which intended to develop an entire operating system, including all associated software, that would not be subject to proprietary licensing. This system was called GNU, for "GNU is Not Unix".
es_es: Richard Stallman, el desarrollador de Emacs, era un miembro del personal del MIT cuando su laboratorio cambió de sistemas propios a propietarios. Stallman se molestó cuando se enteró de que no podía añadir legalmente pequeñas mejoras al sistema. (Muchos de los colaboradores de Stallman se habían ido para formar dos compañías basadas en software desarrollado en el MIT y con licencia del MIT; parece que hubo discrepancias sobre el acceso al código fuente de este software). Stallman ideó una alternativa a las licencias de software comercial y lo llamó GPL ("GNU Public License"), o Licencia Pública GNU. Además, inició una fundación sin ánimo de lucro, la <link xlink:href="http://www.fsf.org">Free Software Foundation</link> (FSF), o Fundación del Software Libre, que pretendía crear un sistema operativo completo, incluyendo todo el software asociado, que no estaría sujeto a licencias propietarias. Este sistema se llamó GNU, por "GNU No es Unix".

source: The GPL was designed to be the antithesis of the standard proprietary license. To this end, any modifications that were made to a GPL program were required to be given back to the GPL community (by requiring that the source of the program be available to the user) and any program that used or linked to GPL code was required to be under the GPL. The GPL was intended to keep software from becoming proprietary. As the last paragraph of the GPL states:
es_es: La GPL se diseñó para ser la antítesis de las licencias propietarias estándar. Para tal fin, cualquier modificación que se hiciera a un programa bajo GPL le debía ser devuelta a la comunidad GPL (requiriendo que el código fuente del programa estuviera disponible para el usuario) y se requería que cualquier programa que usara o estuviese vinculado al código GPL estuviese bajo la licencia GPL. La licencia GPL pretendía evitar que el software llegara a ser propietario. Como declara el último párrafo de la licencia GPL.

source: <quote>This General Public License does not permit incorporating your program into proprietary programs.</quote>[1]
es_es: <quote>Esta Licencia Pública General no permite incorporar su programa a programas propietarios.</quote>[1]

source: The <link xlink:href="http://www.opensource.org/licenses/gpl-license.php">GPL</link> is a complex license so here are some rules of thumb when using the GPL:
es_es: La licencia <link xlink:href="http://www.opensource.org/licenses/gpl-license.php">GPL</link> es una licencia compleja, de modo que aquí van algunas reglas generales para usar la licencia GPL:

source: you can charge as much as you want for distributing, supporting, or documenting the software, but you cannot sell the software itself.
es_es: Se puede cobrar tanto como se desee por distribuir, dar soporte, o documentar el software, pero no se puede vender el propio software.

source: the rule-of-thumb states that if GPL source is required for a program to compile, the program must be under the GPL. Linking statically to a GPL library requires a program to be under the GPL.
es_es: La regla general establece que si se requiere código fuente GPL para que un programa compile, el programa debe estar bajo la licencia GPL. El enlace estático a una biblioteca GPL exige al programa estar bajo la licencia GPL.

source: the GPL requires that any patents associated with GPLed software must be licensed for everyone's free use.
es_es: La GPL requiere que cualquier patente asociada a software GPL debe tener una licencia para que se pueda usar libremente por todos.

source: simply aggregating software together, as when multiple programs are put on one disk, does not count as including GPLed programs in non-GPLed programs.
es_es: Poner software junto simplemente, como cuando se ponen varios programas en un disco, no se considera como incluir programas con licencia GPL en programas sin licencia GPL.

source: output of a program does not count as a derivative work. This enables the gcc compiler to be used in commercial environments without legal problems.
es_es: La salida de un programa no cuenta como un trabajo derivado. Esto permite que el compilador gcc se emplee en ambientes comerciales sin problemas legales.

source: since the Linux kernel is under the GPL, any code statically linked with the Linux kernel must be GPLed. This requirement can be circumvented by dynamically linking loadable kernel modules. This permits companies to distribute binary drivers, but often has the disadvantage that they will only work for particular versions of the Linux kernel.
es_es: Ya que el kernel de Linux está bajo la licencia GPL, cualquier código enlazado estáticamente con el kernel de Linux debe estar licenciado bajo la licencia GPL. Este requerimiento puede ser evitado enlazando dinámicamente los módulos del kernel que se pueden cargar. Esto permite a las compañías distribuir controladores binarios, pero frecuentemente tiene la desventaja de que solo funcionarán para una versión particular del kernel de Linux.

source: Due in part to its complexity, in many parts of the world today the legalities of the GPL are being ignored in regard to Linux and related software. The long-term ramifications of this are unclear.
es_es: Debido en parte a su complejidad, en muchas partes del mundo hoy en día se están ignorando cuestiones legales respecto a Linux y software relacionado.

source: The origins of Linux and the LGPL
es_es: Los orígenes de Linux y de la licencia GPL

source: While the commercial Unix wars raged, the Linux kernel was developed as a PC Unix clone. Linus Torvalds credits the existence of the GNU C compiler and the associated GNU tools for the existence of Linux. He put the Linux kernel under the GPL.
es_es: Mientras que se desataban las guerras comerciales de Unix, el kernel de Linux se desarrolló como un clon de Unix para PC. Linus Torvalds reconoce la existencia del compilador GNU C y las herramientas GNU a la existencia de Linux. Él puso el kernel de Linux bajo la licencia GPL.

source: Remember that the GPL requires anything that statically links to any code under the GPL also be placed under the GPL. The source for this code must thus be made available to the user of the program. Dynamic linking, however, is not considered a violation of the GPL. Pressure to put proprietary applications on Linux became overwhelming. Such applications often must link with system libraries. This resulted in a modified version of the GPL called the <link xlink:href="http://www.opensource.org/licenses/lgpl-license.php">LGPL</link> ("Library", since renamed to "Lesser", GPL). The LGPL allows proprietary code to be linked to the GNU C library, glibc. You do not have to release the source to code which has been dynamically linked to an LGPLed library.
es_es: Recuerde que la licencia GPL requiere que cualquier cosa que se enlace estáticamente a cualquier código bajo la licencia GPL también se pondrá bajo la licencia GPL. El código fuente debe estar disponible para el usuario del programa. El enlace dinámico, sin embargo, no se considera una violación de la licencia GPL. La presión para poner aplicaciones propietarias en Linux llegó a ser abrumadora. Tales aplicaciones deben enlazarse a menudo con las bibliotecas del sistema. Esto resultó en una versión modificada de la GPL denominada <link xlink:href="http://www.opensource.org/licenses/lgpl-license.php">LGPL</link> ("Library", rebautizada como menor ("Lesser"), GPL). La licencia LGPL permite al código propietario estar enlazado a la biblioteca C de GNU, glibc. No hay que liberar el código fuente que ha sido enlazado dinámicamente a la biblioteca bajo una licencia LGPL.

source: If you statically link an application with glibc, such as is often required in embedded systems, you cannot keep your application proprietary, that is, the source must be released. Both the GPL and LGPL require any modifications to the code directly under the license to be released.
es_es: Si se enlaza estáticamente una aplicación con glibc, tal como se requiere frecuentemente en los sistemas encastrados ("embedded systems"), no se puede mantener la aplicación como propietaria, esto es, el código fuente debe ser liberado. Tanto la licencia GPL como la LGPL requieren que cualquier tipo de modificación en el código esté bajo la licencia para ser publicada.

source: Open Source licenses and the Orphaning Problem
es_es: Las licencias de Código Abierto y el Problema de la Orfandad

source: One of the serious problems associated with proprietary software is known as <quote>orphaning</quote>. This occurs when a single business failure or change in a product strategy causes a huge pyramid of dependent systems and companies to fail for reasons beyond their control. Decades of experience have shown that the momentary size or success of a software supplier is no guarantee that their software will remain available, as current market conditions and strategies can change rapidly.
es_es: Uno de los graves problemas asociados con el software privativo se conoce como <quote>orfandad</quote>. Esto ocurre cuando un solo fallo de negocio o un cambio en la estrategia del producto hace que una enorme pirámide de sistemas y empresas dependientes falle por razones que están más allá de su control. Décadas de experiencia han mostrado que el tamaño o éxito momentáneos de un proveedor de software no es garantía de que su software permanecerá disponible, ya que las condiciones y estrategias actuales del mercado pueden cambiar rápidamente.

source: The GPL attempts to prevent orphaning by severing the link to proprietary intellectual property.
es_es: La licencia GPL intenta prevenir la orfandad mediante el corte del vínculo con la propiedad intelectual privativa.
