Repository: doc-br/zanata
Catalog: articles/*/bsdl-gpl.po
Languages: es_es

source: Small companies with software projects vulnerable to orphaning should attempt to use the BSD license when possible. Companies of all sizes should consider forming such Open Source projects when it is to their mutual advantage to maintain the minimal legal and organization overheads associated with a true BSD-style Open Source project.
es_es: Las empresas pequeñas con proyectos de software que sean vulnerables a quedar huérfanos deben intentar usar la licencia BSD cuando sea posible. Las empresas, sean del tamaño que sean, deben considerar la creación de proyectos de Código Abierto cuando les convenga mantener los gastos legales y de organización asociados con un verdadero proyecto de código abierto de estilo BSD.

source: Non-profits should participate in Open Source projects when possible. To minimize software engineering problems, such as mixing code under different licenses, BSD-style licenses should be encouraged. Being leery of the GPL should particularly be the case with non-profits that interact with the developing world. In some locales where application of law becomes a costly exercise, the simplicity of the new BSD license, as compared to the GPL, may be of considerable advantage.
es_es: Las organizaciones sin ánimo de lucro deben participar en proyectos de código abierto cuando sea posible. Para reducir los problemas de ingeniería del software, tales como mezclar código bajo diferentes licencias, se deben fomentar las licencias de estilo BSD. Desconfiar de la licencia GPL debería ser particularmente el caso de las organizaciones sin ánimo de lucro que interactúan con el mundo del desarrollo. En algunos lugares donde la aplicación de la ley se convierte en un ejercicio costoso, la simplicidad de la nueva licencia BSD, en comparación con la GPL, puede ser una ventaja considerable.

source: Conclusion
es_es: Conclusión

source: In contrast to the GPL, which is designed to prevent the proprietary commercialization of Open Source code, the BSD license places minimal restrictions on future behavior. This allows BSD code to remain Open Source or become integrated into commercial solutions, as a project's or company's needs change. In other words, the BSD license does not become a legal time-bomb at any point in the development process.
es_es: A diferencia de la licencia GPL, la cual está diseñada para evitar la comercialización propietaria de Código Abierto, la licencia BSD impone restricciones mínimas sobre el comportamiento futuro. Esto permite que el código BSD permanezca como Código Abierto o se integre en soluciones comerciales, a medida que las necesidades de un proyecto o empresa cambian. En otras palabras, la licencia BSD no se convierte en una bomba de relojería legal en ningún momento del proceso de desarrollo.

source: In addition, since the BSD license does not come with the legal complexity of the GPL or LGPL licenses, it allows developers and companies to spend their time creating and promoting good code rather than worrying if that code violates licensing.
es_es: Además, dado que la licencia BSD no tiene la complejidad legal de las licencias GPL o LGPL, permite a los desarrolladores y compañías emplear su tiempo creando y promoviendo buen código en lugar de preocuparse si ese código viola las licencias.

source: Addenda
es_es: Apéndices

source: [1] http://www.gnu.org/licenses/gpl.html [2] http://archives.cnn.com/2000/TECH/computing/03/28/cyberpatrol.mirrors/ [3] Open Source: the Unauthorized White Papers, Donald K. Rosenberg, IDG Books, 2000. Quotes are from page 114, ``Effects of the GNU GPL''. [4] In the "What License to Use?" section of http://www.oreilly.com/catalog/opensources/book/brian.html This whitepaper is a condensation of an original work available at http://alumni.cse.ucsc.edu/~brucem/open_source_license.htm
es_es: [1] http://www.gnu.org/licenses/gpl.html [2] http://archives.cnn.com/2000/TECH/computing/03/28/cyberpatrol.mirrors/ [3] Open Source: the Unauthorized White Papers, Donald K. Rosenberg, IDG Books, 2000. Quotes are from page 114, ``Effects of the GNU GPL''. [4] En la sección "What License to Use?" http://www.oreilly.com/catalog/opensources/book/brian.html Este texto es un resumen de una obra original disponible en http://alumni.cse.ucsc.edu/~brucem/open_source_license.htm
