Repository: doc-br/zanata
Catalog: articles/*/building-products.po
Languages: es_es

source: As a policy the FreeBSD project <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors">acknowledges</link> all contributions received on its web site.
es_es: Como política, el proyecto FreeBSD <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors">reconoce</link>en su sitio web todas las contribuciones recibidas.

source: Conclusion
es_es: Conclusión

source: The FreeBSD project's goals are to create and give away the source code for a high-quality operating system. By working with the FreeBSD project you can reduce development costs and improve your time to market in a number of product development scenarios.
es_es: Los objetivos del proyecto FreeBSD son crear y obsequiar el código fuente de un sistema operativo de alta calidad. Trabajando con el proyecto FreeBSD puede reducir los costes de desarrollo y mejorar su tiempo de lanzamiento al mercado en una variedad de escenarios de desarrollo del producto.

source: We examined the characteristics of the FreeBSD project that make it an excellent choice for being part of an organization's product strategy. We then looked at the prevailing culture of the project and examined effective ways of interacting with its developers. The article concluded with a list of best-practices that could help organizations collaborating with the project.
es_es: Hemos examinado las características del proyecto FreeBSD que lo convierten en una excelente elección para formar parte de la estrategia de un producto de una organización. A continuación, examinamos la cultura predominante en el proyecto y las formas efectivas de interactuar con sus desarrolladores. El artículo ha concluido con una lista de buenas prácticas que podrían ayudar a las organizaciones que colaboran con el proyecto.

source: <personname><firstname>B.</firstname><surname>Carpenter</surname></personname><affiliation> <orgname>The Internet Architecture Board</orgname> </affiliation>
es_es: <personname><firstname>B.</firstname><surname>Carpenter</surname></personname><affiliation> <orgname>El Consejo Arquitectónico de Internet</orgname> </affiliation>

source: <link xlink:href="http://csdl.computer.org/comp/mags/so/2004/01/s1028.pdf">How is Open-Source Affecting Software Development?</link>
es_es: <link xlink:href="http://csdl.computer.org/comp/mags/so/2004/01/s1028.pdf">¿Cómo está afectando el código abierto al desarrollo de software?</link>

source: <year>Jan/Feb 2004</year>
es_es: <year>Enero/Febrero 2004</year>

source: IEEE Computer Society
es_es: Sociedad de Computación IEEE

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide">Committer's Guide</link>
es_es: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide">Guía de Desarrolladores</link>

source: <orgname>The FreeBSD Project</orgname>
es_es: <orgname>El proyecto FreeBSD</orgname>

source: <link xlink:href="http://www.coverity.com/news/nf_news_06_27_05_story_9.html">Coverity study on kernel security holes in Linux and FreeBSD</link>
es_es: <link xlink:href="http://www.coverity.com/news/nf_news_06_27_05_story_9.html">Estudios de Coverity sobre los agujeros de seguridad del kernel en Linux y FreeBSD</link>

source: <link xlink:href="http://dreamsongs.com/IHE/IHE.html">Innovation Happens Elsewhere: Open Source as Business Strategy</link>
es_es: <link xlink:href="http://dreamsongs.com/IHE/IHE.html">La innovación ocurre en otras partes: El Código Abierto como Estrategia de Negocio</link>

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributing">Contributing to the FreeBSD Project</link>
es_es: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributing">Contribuyendo al proyecto FreeBSD</link>

source: The FreeBSD Project
es_es: El Proyecto FreeBSD

source: USENIX Annual Technical Conference
es_es: Conferencia Técnica Anual USENIX

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/bsdl-gpl/article.html">Why you should use a BSD style license for your Open Source Project</link>
es_es: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/bsdl-gpl/article.html">¿Por qué debería usar una licencia estilo BSD para su Proyecto de Código Abierto</link>

source: <link xlink:href="http://www.norvig.com/luv-slides.ps">Tutorial on Good Lisp Programming Style</link>
es_es: <link xlink:href="http://www.norvig.com/luv-slides.ps">Tutorial sobre el Buen Estilo de Programación de Lisp</link>

source: <link xlink:href="http://www.norvig.com/21-days.html">Teach Yourself Programming in Ten Years</link>
es_es: <link xlink:href="http://www.norvig.com/21-days.html">Enséñese a Programar Usted Mismo en Diez Años</link>

source: <link xlink:href="http://www.catb.org/~esr/faqs/smart-questions.html">How to ask questions the smart way</link>
es_es: <link xlink:href="http://www.catb.org/~esr/faqs/smart-questions.html">¿Cómo hacer preguntas de manera inteligente?</link>

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng">FreeBSD Release Engineering</link>
es_es: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng">Ingeniería de Publicación de versiones de FreeBSD</link>
