Repository: doc-br/zanata
Catalog: articles/*/building-products.po
Languages: es_es

# _
source: translator-credits
es_es: Manuel Megías joramsinkin@hotmail.com, 2018

source: Building Products with FreeBSD
es_es: Construyendo productos con FreeBSD

source: <personname><firstname>Joseph</firstname><surname>Koshy</surname></personname><affiliation> <orgname>The FreeBSD Project</orgname> <_:address-1/> </affiliation>
es_es: <personname><firstname>Joseph</firstname><surname>Koshy</surname></personname><affiliation> <orgname>El proyecto FreeBSD</orgname> <_:address-1/> </affiliation>

source: $FreeBSD: head/en_US.ISO8859-1/articles/building-products/article.xml 51348 2017-12-30 22:56:56Z eadler $
es_es: $FreeBSD$

source: Abstract
es_es: Resumen

source: The FreeBSD project is a worldwide, volunteer based, and collaborative project, which develops a portable and high-quality operating system. The FreeBSD project distributes the source code for its product under a liberal license, with the intention of encouraging the use of its code. Collaborating with the FreeBSD project can help organizations reduce their time to market, reduce engineering costs and improve their product quality.
es_es: El proyecto FreeBSD es un proyecto mundial, basado en el voluntariado y la colaboración, que desarrolla un sistema operativo portable y de alta calidad. El proyecto FreeBSD distribuye el código fuente de su producto bajo una licencia permisiva, con la intención de fomentar el uso de su código. Colaborar con el proyecto FreeBSD puede ayudar a las organizaciones a reducir su tiempo de comercialización, reducir los costes de ingeniería y mejorar la calidad de sus productos.

source: This article examines the issues in using FreeBSD code in appliances and software products. It highlights the characteristics of FreeBSD that make it an excellent substrate for product development. The article concludes by suggesting a few <quote>best practices</quote> for organizations collaborating with the FreeBSD project.
es_es: Este artículo examina los problemas al usar el código de FreeBSD en dispositivos y productos de software. Se destacan las características que convierten a FreeBSD en una excelente base para el desarrollo de productos. El artículo concluye sugiriendo algunas <quote> mejores prácticas </quote> para las organizaciones que colaboran con el proyecto FreeBSD.

source: Introduction
es_es: Introducción

source: FreeBSD today is well-known as a high-performance server operating system. It is deployed on millions of web servers and internet-facing hosts worldwide. FreeBSD code also forms an integral part of many products, ranging from appliances such as network routers, firewalls, and storage devices, to personal computers. Portions of FreeBSD have also been used in commercial shrink-wrapped software (see <xref linkend="freebsd-intro"/>).
es_es: FreeBSD es hoy en día bien conocido como un sistema operativo de servidor de alto rendimiento. Está desplegado en millones de servidores web y hosts de Internet en todo el mundo. El código de FreeBSD también forma una parte integral de muchos productos, desde dispositivos como routers de red, cortafuegos y dispositivos de almacenamiento, hasta ordenadores personales. Partes de FreeBSD también han sido usadas en software comercial (ver <xref linkend="freebsd-intro"/>

source: In this article we look at the <link xlink:href="@@URL_RELPREFIX@@/">FreeBSD project</link> as a software engineering resource—as a collection of building blocks and processes which you can use to build products.
es_es: En este artículo analizamos el <link xlink:href="@@URL_RELPREFIX@@/">Proyecto FreeBSD</link> como un recurso de ingeniería de software y como una colección de bloques de construcción y procesos que usted puede usar para construir productos.

source: While FreeBSD's source is distributed freely to the public, to fully enjoy the benefits of the project's work, organizations need to <emphasis>collaborate</emphasis> with the project. In subsequent sections of this article we discuss effective means of collaboration with the project and the pitfalls that need to be avoided while doing so.
es_es: Mientras que el código fuente de FreeBSD se distribuye libremente al público, para disfrutar plenamente de los beneficios del trabajo del proyecto, las organizaciones necesitan <emphasis>colaborar</emphasis> con el proyecto. En las secciones siguientes de este artículo tratamos de los medios eficaces para colaborar con el proyecto y los escollos que deben evitarse al hacerlo.

source: Caveat Reader
es_es: Advertencia al lector

source: The author believes that the characteristics of the FreeBSD Project listed in this article were substantially true at the time the article was conceived and written (2005). However, the reader should keep in mind that the practices and processes used by open-source communities can change over time, and that the information in this article should therefore be taken as indicative rather than normative.
es_es: El autor cree que las características del proyecto FreeBSD enumeradas en este artículo eran sustancialmente ciertas en el momento en que el artículo fue concebido y escrito (2005). Sin embargo, el lector debe tener en cuenta que las prácticas y procesos utilizados por las comunidades de código abierto pueden cambiar con el tiempo y que, por lo tanto, la información contenida en este artículo debe tomarse como indicativa y no como normativa.

source: Target Audience
es_es: Público al que va dirigido

source: This document would be of interest to the following broad groups of people:
es_es: Este documento puede ser de interés para los siguientes amplios grupos de personas:

source: Decision makers in product companies looking at ways to improve their product quality, reduce their time to market and lower engineering costs in the long term.
es_es: Los responsables de la toma de decisiones en las empresas de productos que buscan formas de mejorar la calidad de sus productos, reducir su tiempo de lanzamiento al mercado y reducir los costes de ingeniería a largo plazo.

source: Technology consultants looking for best-practices in leveraging <quote>open-source</quote>.
es_es: Consultores de tecnología que buscan las mejores prácticas para sacar partido al <quote> código abierto </quote>.

source: Industry observers interested in understanding the dynamics of open-source projects.
es_es: Observadores de la industria interesados en entender la dinámica de los proyectos de código abierto.

source: Software developers seeking to use FreeBSD and looking for ways to contribute back.
es_es: Desarrolladores de software que quieren usar FreeBSD y buscan formas de contribuir a él.

source: Article Goals
es_es: Metas del proyecto

source: After reading this article you should have:
es_es: Después de leer este artículo deberías tener:

source: An understanding of the goals of the FreeBSD Project and its organizational structure.
es_es: Comprensión de los objetivos del proyecto FreeBSD y su estructura organizativa.

source: An understanding of its development model and release engineering processes.
es_es: Comprensión de su modelo de desarrollo y de los procesos de ingeniería de lanzamiento.

source: An understanding of how conventional corporate software development processes differ from that used in the FreeBSD project.
es_es: Una comprensión de cómo los procesos convencionales de desarrollo de software corporativo difieren de los utilizados en el proyecto FreeBSD.

source: Awareness of the communication channels used by the project and the level of transparency you can expect.
es_es: Conocimiento de los canales de comunicación utilizados por el proyecto y del nivel de transparencia que puede esperar.

source: Awareness of optimal ways of working with the project—how best to reduce engineering costs, improve time to market, manage security vulnerabilities, and preserve future compatibility with your product as the FreeBSD project evolves.
es_es: Conocimiento de las formas óptimas de trabajar con el proyecto y de la mejor manera de reducir los costes de ingeniería, mejorar el tiempo de comercialización, gestionar las vulnerabilidades de seguridad y preservar la compatibilidad futura con su producto a medida que evolucione el proyecto FreeBSD.

source: Article Structure
es_es: Estructura del artículo

source: The rest of the article is structured as follows:
es_es: El resto del artículo está estructurado de la siguiente manera:

source: <xref linkend="freebsd-intro"/> introduces the FreeBSD project, explores its organizational structure, key technologies and release engineering processes.
es_es: <xref linkend="freebsd-intro"/> presenta el proyecto FreeBSD, explora su estructura organizativa, tecnologías clave y procesos de ingeniería de lanzamiento.

source: <xref linkend="freebsd-collaboration"/> describes ways to collaborate with the FreeBSD project. It examines common pitfalls encountered by corporates working with voluntary projects like FreeBSD.
es_es: <xref linkend="freebsd-collaboration"/> describe las formas de colaborar con el proyecto FreeBSD. Examina los escollos más comunes a los que se enfrentan las empresas que trabajan con proyectos voluntarios como FreeBSD.

source: <xref linkend="conclusion"/> concludes.
es_es: <xref linkend="conclusion"/> concluye.

source: FreeBSD as a set of building blocks
es_es: FreeBSD como un conjunto de bloques de construcción

source: FreeBSD makes an excellent foundation on which to build products:
es_es: FreeBSD constituye una excelente base sobre la que construir productos:

source: FreeBSD source code is distributed under a liberal BSD license facilitating its adoption in commercial products <citation>Mon2005</citation> with minimum hassle.
es_es: El código fuente de FreeBSD se distribuye bajo una licencia BSD liberal que facilita su adopción en productos comerciales <citation>Mon2005</citation> con las mínimas molestias.

source: The FreeBSD project has excellent engineering practices that can be leveraged.
es_es: El proyecto FreeBSD tiene excelentes prácticas de ingeniería que pueden ser aprovechadas.

source: The project offers exceptional transparency into its workings, allowing organizations using its code to plan effectively for the future.
es_es: El proyecto ofrece una transparencia excepcional en su funcionamiento, permitiendo a las organizaciones que utilizan su código planificar eficazmente para el futuro.

source: The culture of the FreeBSD project, carried over from the Computer Science Research Group at The University of California, Berkeley <citation>McKu1999-1</citation>, fosters high-quality work. Some features in FreeBSD define the state of the art.
es_es: La cultura del proyecto FreeBSD, heredada del Computer Science Research Group de la Universidad de California, Berkeley <citation>McKu1999-1</citation>, fomenta el trabajo de alta calidad. Algunas características de FreeBSD definen el estado actual.

source: <citation>GoldGab2005</citation> examines the business reasons for using open-source in greater detail. For organizations, the benefits of using FreeBSD components in their products include a shorter time to market, lower development costs and lower development risks.
es_es: <citation>GoldGab2005</citation> examina con mayor detalle las razones comerciales para utilizar el código abierto. Para las organizaciones, los beneficios de usar componentes FreeBSD en sus productos incluyen un menor tiempo de lanzamiento al mercado, menores costes de desarrollo y menores riesgos de desarrollo.

source: Building with FreeBSD
es_es: Haciendo productos con FreeBSD

source: Here are a few ways organizations have used FreeBSD:
es_es: Estas son algunas de las formas en que las organizaciones han usado FreeBSD:

source: As an upstream source for tested code for libraries and utilities.
es_es: Como una fuente de código probado para librerías y empresas de servicios públicos.

source: By being <quote>downstream</quote> of the project, organizations leverage the new features, bug fixes and testing that the upstream code receives.
es_es: Al ser <quote>receptoras</quote> del proyecto, las organizaciones aprovechan las nuevas características, las correcciones de errores y las pruebas que recibe el código.

source: As an embedded OS (for example, for an OEM router and firewall device). In this model, organizations use a customized FreeBSD kernel and application program set along with a proprietary management layer for their device. OEMs benefit from new hardware support being added by the FreeBSD project upstream, and from the testing that the base system receives.
es_es: Como un sistema operativo integrado (por ejemplo, para un router OEM y un dispositivo de cortafuegos). En este modelo, las organizaciones emplean un kernel personalizado de FreeBSD y el programa junto con una capa de gestión propia para su dispositivo. Los OEMs se benefician del nuevo soporte de hardware añadido por el proyecto FreeBSD y de las pruebas que recibe el sistema base.

source: FreeBSD ships with a self-hosting development environment that allows easy creation of such configurations.
es_es: FreeBSD viene con un entorno de desarrollo auto alojado que permite crear fácilmente estas configuraciones.

source: As a Unix compatible environment for the management functions of high-end storage and networking devices, running on a separate processor <quote>blade</quote>.
es_es: Como un entorno compatible con Unix para las funciones de gestión de dispositivos de almacenamiento y de red de gama alta, que se ejecutan en un <quote>blade</quote> separado de procesador.

source: FreeBSD provides the tools for creating dedicated OS and application program images. Its implementation of a BSD unix API is mature and tested. FreeBSD can also provide a stable cross-development environment for the other components of the high-end device.
es_es: FreeBSD proporciona las herramientas para crear imágenes dedicadas de sistemas operativos y programas. Su implementación de una API unix BSD es madura y está probada. FreeBSD también puede proporcionar un entorno estable de desarrollo cruzado para los otros componentes del dispositivo de gama alta.

source: As a vehicle to get widespread testing and support from a worldwide team of developers for non-critical <quote>intellectual property</quote>.
es_es: Como vehículo para obtener pruebas y apoyo generalizados por parte de un equipo mundial de desarrolladores para una <quote>propiedad intelectual</quote> no crítica.

source: In this model, organizations contribute useful infrastructural frameworks to the FreeBSD project (for example, see <citerefentry><refentrytitle>netgraph</refentrytitle><manvolnum>3</manvolnum></citerefentry>). The widespread exposure that the code gets helps to quickly identify performance issues and bugs. The involvement of top-notch developers also leads to useful extensions to the infrastructure that the contributing organization also benefits from.
es_es: En este modelo, las organizaciones aportan marcos de inraestructura útiles al proyecto FreeBSD (por ejemplo, ver <citerefentry><refentrytitle>netgraph</refentrytitle><manvolnum>3</manvolnum></citerefentry>). La exposición generalizada que recibe el código ayuda a identificar rápidamente problemas de rendimiento y errores. La participación de desarrolladores de primera categoría también conduce a extensiones útiles de la infraestructura de la que también se beneficia la organización contribuyente.

source: As a development environment supporting cross-development for embedded OSes like <link xlink:href="http://www.rtems.com/">RTEMS</link> and <link xlink:href="http://ecos.sourceware.org/">eCOS</link>.
es_es: Como un entorno de desarrollo que soporta el desarrollo cruzado para sistemas operativos integrados como <link xlink:href="http://www.rtems.com/">RTEMS</link> y <link xlink:href="http://ecos.sourceware.org/">eCOS</link>.

source: There are many full-fledged development environments in the 24,000-strong collection of applications ported and packaged with FreeBSD.
es_es: Hay muchos entornos de desarrollo completos en la sólida colección de 24.000 aplicaciones portadas y empaquetadas con FreeBSD.

source: As a way to support a Unix-like API in an otherwise proprietary OS, increasing its palatability for application developers.
es_es: Como una forma de soportar una API similar a Unix en un sistema operativo que de otro modo sería propietario, aumentando su atractivo para los desarrolladores de aplicaciones.

source: Here parts of FreeBSD's kernel and application programs are <quote>ported</quote> to run alongside other tasks in the proprietary OS. The availability of a stable and well tested <trademark>Unix</trademark> API implementation can reduce the effort needed to port popular applications to the proprietary OS. As FreeBSD ships with high-quality documentation for its internals and has effective vulnerability management and release engineering processes, the costs of keeping upto-date are kept low.
es_es: Aquí partes del kernel de FreeBSD y de los programas son <quote>portadas</quote> para que se ejecuten junto con otras tareas en el sistema operativo propietario. La disponibilidad de una implementación de API de <trademark>Unix</trademark> estable y bien probada puede reducir el esfuerzo necesario para portar aplicaciones populares al sistema operativo propietario. Como FreeBSD incluye documentación de alta calidad para sus sistemas internos y dispone de una gestión eficaz de vulnerabilidades y procesos de ingeniería de versiones, los costes de actualizados se mantienen bajos.

source: Technologies
es_es: Tecnologías

source: There are a large number of technologies supported by the FreeBSD project. A selection of these are listed below:
es_es: Hay un gran número de tecnologías soportadas por el proyecto FreeBSD. A continuación se enumeran una selección de ellos:

source: A complete system that can cross-host itself for <link xlink:href="@@URL_RELPREFIX@@/platforms/">many architectures:</link>
es_es: Un sistema completo que puede alojarse en <link xlink:href="@@URL_RELPREFIX@@/platforms/">muchas arquitecturas:</link>

source: A modular symmetric multiprocessing capable kernel, with loadable kernel modules and a flexible and easy to use configuration system.
es_es: Un núcleo modular con capacidad de multiprocesamiento simétrico, con módulos integrables en el núcleo y un sistema de configuración flexible y fácil de usar.

source: Support for emulation of <trademark>Linux</trademark> and SVR4 binaries at near machine speeds. Support for binary <trademark>Windows</trademark> (<acronym>NDIS</acronym>) network drivers.
es_es: Soporte para emulación de binarios de <trademark>Linux</trademark> y de SVR4 a velocidades cercanas a las de la máquina. Soporte para controladores de red binarios de <trademark>Windows</trademark> (<acronym>NDIS</acronym>).

source: Libraries for many programming tasks: archivers, FTP and HTTP support, thread support, in addition to a full <trademark>POSIX</trademark> like programming environment.
es_es: Bibliotecas para muchas tareas de programación: archivadores, soporte para FTP y HTTP, soporte de hilos, además de un completo entorno de programación <trademark>POSIX</trademark>.

source: Security features: Mandatory Access Control (<citerefentry><refentrytitle>mac</refentrytitle><manvolnum>9</manvolnum></citerefentry>), jails (<citerefentry><refentrytitle>jail</refentrytitle><manvolnum>2</manvolnum></citerefentry>), <acronym>ACL</acronym>s, and in-kernel cryptographic device support.
es_es: Elementos de seguridad: Control de acceso obligatorio (<citerefentry><refentrytitle>mac</refentrytitle><manvolnum>9</manvolnum></citerefentry>), jails (<citerefentry><refentrytitle>jail</refentrytitle><manvolnum>2</manvolnum></citerefentry>), <acronym>ACL</acronym>s, y soporte de dispositivos criptográficos en el kernel

source: Networking features: firewall-ing, QoS management, high-performance TCP/IP networking with support for many extensions.
es_es: Funciones de red: cortafuegos, gestión de la calidad de servicio (QoS), conexiones de red TCP/IP de alto rendimiento con soporte para muchas extensiones

source: FreeBSD's in-kernel Netgraph (<citerefentry><refentrytitle>netgraph</refentrytitle><manvolnum>4</manvolnum></citerefentry>) framework allows kernel networking modules to be connected together in flexible ways.
es_es: El marco de trabajo Netgraph (<citerefentry><refentrytitle>netgraph</refentrytitle><manvolnum>4</manvolnum></citerefentry>) del kernel de FreeBSD permite que los módulos de red del núcleo se conecten entre sí de forma flexible.

source: Support for storage technologies: Fibre Channel, <acronym>SCSI</acronym>, software and hardware RAID, <acronym>ATA</acronym> and <acronym>SATA</acronym>.
es_es: Soporte para tecnologías de almacenamiento: Fibre Channel, <acronym>SCSI</acronym>, software y hardware RAID , <acronym>ATA</acronym> y <acronym>SATA</acronym>.

source: FreeBSD supports a number of filesystems, and its native UFS2 filesystem supports soft updates, snapshots and very large filesystem sizes (16TB per filesystem) <citation>McKu1999</citation>.
es_es: FreeBSD soporta varios sistemas de ficheros, y su sistema de ficheros nativo UFS2 soporta actualizaciones, instantáneas y tamaños de sistema de ficheros muy grandes (16TB por sistema de ficheros) <citation>McKu1999</citation>.

source: FreeBSD's in-kernel <acronym>GEOM</acronym> (<citerefentry><refentrytitle>geom</refentrytitle><manvolnum>4</manvolnum></citerefentry>) framework allows kernel storage modules to be composed in flexible ways.
es_es: El marco de trabajo <acronym>GEOM</acronym> (<citerefentry><refentrytitle>geom</refentrytitle><manvolnum>4</manvolnum></citerefentry>) incluido en el kernel de FreeBSD permite que los módulos de almacenamiento del núcleo se compongan de manera flexible.

source: Over 24,000 ported applications, both commercial and open-source, managed via the FreeBSD ports collection.
es_es: Más de 24.000 aplicaciones portadas, tanto comerciales como de código abierto, gestionadas a través de la colección de puertos de FreeBSD.

source: Organizational Structure
es_es: Estructura de la organización

source: FreeBSD's organizational structure is non-hierarchical.
es_es: La estructura organizativa de FreeBSD no es jerárquica.

source: There are essentially two kinds of contributors to FreeBSD, general users of FreeBSD, and developers with write access (known as <firstterm>committers</firstterm> in the jargon) to the source base.
es_es: Hay esencialmente dos tipos de contribuyentes a FreeBSD, usuarios regulares de FreeBSD, y desarrolladores con acceso de escritura (conocidos como <firstterm>committers</firstterm> en la jerga) a la base de código fuente.

source: There are many thousands of contributors in the first group; the vast majority of contributions to FreeBSD come from individuals in this group. Commit rights (write access) to the repository are granted to individuals who contribute consistently to the project. Commit rights come with additional responsibilities, and new committers are assigned mentors to help them learn the ropes.
es_es: Hay muchos miles de contribuyentes en el primer grupo; la gran mayoría de las contribuciones a FreeBSD provienen de individuos de este grupo. Los derechos de escritura (acceso de escritura) al repositorio se conceden a las personas que contribuyen de forma consistente al proyecto (denominados committers). Los derechos de escritura conllevan responsabilidades adicionales, y se asignan mentores a los nuevos committers para ayudarles a aprender lo que hay que hacer.

source: FreeBSD Organization
es_es: Organización de FreeBSD

# _
source: external ref='freebsd-organization' md5='__failed__'
es_es: referencia externa='freebsd-organization' md5='__failed__'
