Repository: doc-br/zanata
Catalog: articles/*/building-products.po
Languages: es_es

source: Conflict resolution is performed by a nine member <quote>Core Team</quote> that is elected from the group of committers.
es_es: La resolución de conflictos se lleva a cabo por un <quote>Equipo Base</quote> de nueve miembros que es elegido entre el grupo de committers.

source: FreeBSD does not have <quote>corporate</quote> committers. Individual committers are required to take responsibility for the changes they introduce to the code. The <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide">FreeBSD Committer's guide</link> <citation>ComGuide</citation> documents the rules and responsibilities for committers.
es_es: FreeBSD no tiene <quote>corporativos</quote> committers. Se exige a cada committer que asuman la responsabilidad de los cambios que introducen en el código. La <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/articles/committers-guide">Guía para los committers de FreeBSD</link> <citation>ComGuide</citation> documenta las reglas y responsabilidades de los committers.

source: FreeBSD's project model is examined in detail in <citation>Nik2005</citation>.
es_es: El modelo de proyecto de FreeBSD se examina en detalle en <citation>Nik2005</citation>.

source: FreeBSD Release Engineering Processes
es_es: Procesos de ingeniería de lanzamiento de versiones de FreeBSD

source: FreeBSD's release engineering processes play a major role in ensuring that its released versions are of a high quality. At any point of time, FreeBSD's volunteers support multiple code lines (<xref linkend="fig-freebsd-branches"/>):
es_es: Los procesos de ingeniería de los lanzamientos de FreeBSD juegan un papel importante a la hora de asegurar que sus versiones publicadas sean de alta calidad. En todo momento, los voluntarios de FreeBSD mantienen múltiples líneas de código (<xref linkend="fig-freebsd-branches"/>):

source: New features and disruptive code enters on the development branch, also known as the <firstterm>-CURRENT</firstterm> branch.
es_es: Las nuevas características y el código que introduce grandes cambios entran en la rama de desarrollo, también conocida como la rama <firstterm>-CURRENT</firstterm>.

source: <firstterm>-STABLE</firstterm> branches are code lines that are branched from HEAD at regular intervals. Only tested code is allowed onto a -STABLE branch. New features are allowed once they have been tested and stabilized in the -CURRENT branch.
es_es: Las ramas <firstterm>-STABLE</firstterm> son líneas de código que se ramifican desde HEAD a intervalos regulares. Sólo el código probado se permite en una rama -STABLE. Las nuevas características se permiten una vez que han sido probadas y estabilizadas en la rama -CURRENT.

source: <firstterm>-RELEASE</firstterm> branches are maintained by the FreeBSD security team. Only bug fixes for critical issues are permitted onto -RELEASE branches.
es_es: Las ramas <firstterm>-RELEASE</firstterm> son mantenidas por el equipo de seguridad de FreeBSD. Sólo se permiten correcciones de errores de problemas críticos en las ramas -RELEASE.

source: FreeBSD Release Branches
es_es: Ramas RELEASE de FreeBSD

# _
source: external ref='freebsd-branches' md5='__failed__'
es_es: referencia externa ='freebsd-branches' md5='__failed__'

source: Code lines are kept alive for as long as there is user and developer interest in them.
es_es: Las líneas de código se mantienen vivas mientras haya interés en ellas por parte del usuario y del desarrollador.

source: Machine architectures are grouped into <quote>tiers</quote>; <firstterm>Tier 1</firstterm> architectures are fully supported by the project's release engineering and security teams, <firstterm>Tier 2</firstterm> architectures are supported on a best effort basis, and experimental architectures comprise <firstterm>Tier 3</firstterm>. The list of <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide/archs.html">supported architectures</link> is part of the FreeBSD documentation collection.
es_es: Las arquitecturas de las máquinas se agrupan en <quote>niveles</quote>; las arquitecturas de <firstterm>Nivel 1</firstterm> están totalmente soportadas por los equipos de ingenieros de publicación y seguridad del proyecto, las arquitecturas de <firstterm>Nivel 2</firstterm> se soportan con el mejor esfuerzo, y las arquitecturas experimentales comprenden el <firstterm>Nivel 3</firstterm>. La lista de <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide/archs.html">arquitecturas soportadas</link> forma parte de la colección de la documentación de FreeBSD.

source: The release engineering team publishes a <link xlink:href="@@URL_RELPREFIX@@/releng/">road map</link> for future releases of FreeBSD on the project's web site. The dates laid down in the road map are not deadlines; FreeBSD is released when its code and documentation are ready.
es_es: El equipo de ingenieros de lanzamiento de versiones publica un <link xlink:href="@@URL_RELPREFIX@@/releng/">hoja de ruta</link> para futuras versiones de FreeBSD en el sitio web del proyecto. Las fechas establecidas en la hoja de ruta no son fechas límite; FreeBSD se publica cuando su código y documentación están listos.

source: FreeBSD's release engineering processes are described in <citation>RelEngDoc</citation>.
es_es: Los procesos técnicos de lanzamiento de versiones de FreeBSD se describen en <citation>RelEngDoc</citation>.

source: Collaborating with FreeBSD
es_es: Colaborando con FreeBSD

source: Open-source projects like FreeBSD offer finished code of a very high quality <citation>Cov2005</citation>. Previous studies have examined the effect of source code availability on software development <citation>Com2004</citation>.
es_es: Los proyectos de código abierto como FreeBSD ofrecen código definitivo de muy alta calidad <citation>Cov2005</citation>. Estudios anteriores han examinado el efecto de la disponibilidad del código fuente en el desarrollo de software <citation>Com2004</citation>.

source: While access to quality source code can reduce the cost of initial development, in the long-term the costs of managing change begin to dominate. As computing environments change over the years and new security vulnerabilities are discovered, your product too needs to change and adapt. Using open-source code is best viewed not as a one-off activity, but as an <emphasis>ongoing process</emphasis>. The best projects to collaborate with are the ones that are <emphasis>live</emphasis>; i.e., with an active community, clear goals and a transparent working style.
es_es: Mientras que el acceso al código fuente de calidad puede reducir el coste del desarrollo inicial, a largo plazo los costes de gestión del cambio comienzan a dominar. A medida que los entornos informáticos cambian con el paso de los años y se descubren nuevas vulnerabilidades de seguridad, su producto también necesita cambiar y adaptarse. El uso de código abierto no se ve mejor como una actividad aislada, sino como un <emphasis>proceso en curso</emphasis>. Los mejores proyectos con los que se puede colaborar son los que son <emphasis>vivos</emphasis>; es decir, con una comunidad activa, objetivos claros y un estilo de trabajo transparente.

source: FreeBSD has an active developer community around it. At the time of writing there are many thousands of contributors from every populated continent in the world and over 300 individuals with write access to the project's source repositories.
es_es: FreeBSD tiene una comunidad de desarrolladores activa a su alrededor. En el momento de escribir este artículo hay muchos miles de contribuyentes de todos los continentes del mundo y más de 300 personas con acceso de escritura a los repositorios de fuentes del proyecto.

source: The goals of the FreeBSD project are <citation>Hub1994</citation>:
es_es: Los objetivos del proyecto FreeBSD son <citation>Hub1994</citation>:

source: To develop a high-quality operating system for popular computer hardware, and,
es_es: Desarrollar un sistema operativo de alta calidad para los equipos informáticos más utilizados, y,

source: To make our work available to all under a liberal license.
es_es: Poner nuestro trabajo a disposición de todos bajo una licencia liberal.

source: FreeBSD enjoys an open and transparent working culture. Nearly all discussion in the project happens by email, on <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo">public mailing lists</link> that are also archived for posterity. The project's policies are <link xlink:href="@@URL_RELPREFIX@@/internal/policies.html">documented</link> and maintained under revision control. Participation in the project is open to all.
es_es: FreeBSD disfruta de una cultura de trabajo abierta y transparente. Casi toda la discusión en el proyecto ocurre por correo electrónico, en <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo">listas de correo públicas</link> que también se archivan para la posteridad. Las políticas del proyecto son <link xlink:href="@@URL_RELPREFIX@@/internal/policies.html">documentadas</link> y mantenidas bajo control de revisión. La participación en el proyecto está abierta a todos.

source: Understanding FreeBSD culture
es_es: Comprendiendo la cultura de FreeBSD

source: To be able to work effectively with the FreeBSD project, you need to understand the project's culture.
es_es: Para poder trabajar eficazmente con el proyecto FreeBSD necesita entender la cultura del proyecto.

source: Volunteer driven projects operate under different rules than for-profit corporates. A common mistake that companies make when venturing into the open-source world is that of underplaying these differences.
es_es: Los proyectos impulsados por voluntarios operan bajo reglas diferentes a las de las corporaciones con fines de lucro. Un error común que cometen las empresas al aventurarse en el mundo del software libre es subestimar estas diferencias.

source: Motivation
es_es: Motivación

source: Most contributions to FreeBSD are done voluntarily without monetary rewards entering the picture. The factors that motivate individuals are complex, ranging from altruism, to an interest in solving the kinds of problems that FreeBSD attempts to solve. In this environment, <quote>elegance is never optional</quote> <citation>Nor1993</citation>.
es_es: La mayoría de las contribuciones a FreeBSD se hacen voluntariamente sin que las recompensas económicas entren en escena. Los factores que motivan a los individuos son complejos, desde el altruismo hasta el interés por resolver los tipos de problemas que FreeBSD intenta resolver. En este entorno, la <quote>elegancia nunca es opcional </quote> <citation>Nor1993</citation>.

source: The Long Term View
es_es: La Visión a Largo Plazo

source: FreeBSD's <link xlink:href="https://svnweb.freebsd.org/">source repository</link> contains a history of the project since its inception, and there are <link xlink:href="http://www.mckusick.com/csrg/">CDROMs available</link> that contain earlier code from the CSRG.
es_es: El <link xlink:href="https://svnweb.freebsd.org/">repositorio fuente</link> de FreeBSD contiene un historial del proyecto desde su inicio, y hay <link xlink:href="http://www.mckusick.com/csrg/">CDROMs disponibles</link> que contienen código anterior del CSRG.

source: FreeBSD traces its roots back nearly twenty years to the work of the Computer Science Research Group at the University of California Berkeley.<_:footnote-1/> A number of the original CSRG developers remain associated with the project.
es_es: FreeBSD remonta sus inicios hasta hace casi veinte años en el trabajo del Grupo de Investigación en Ciencia Computacional (CSRG) de la Universidad de California en Berkeley.<_:footnote-1/> Algunos de los desarrolladores originales de CSRG siguen asociados al proyecto.

source: The project values long-term perspectives <citation>Nor2001</citation>. A frequent acronym encountered in the project is <acronym>DTRT</acronym>, which stands for <quote>Do The Right Thing</quote>.
es_es: El proyecto valora las perspectivas a largo plazo <citation>Nor2001</citation>. Un acrónimo frecuente en el proyecto es <acronym>DTRT</acronym>, que significa <quote>Hacer lo Correcto</quote> (Do The Right Things).

source: Development Processes
es_es: Proceso de Desarrollo

source: Computer programs are tools for communication: at one level programmers communicate their intentions using a precise notation to a tool (a compiler) that translates their instructions to executable code. At another level, the same notation is used for communication of intent between two programmers.
es_es: Los programas de ordenador son herramientas de comunicación: en un nivel los programadores comunican sus intenciones utilizando una notación precisa a una herramienta (un compilador) que traduce sus instrucciones a código ejecutable. En otro nivel, la misma notación se utiliza para la comunicación de intenciones entre dos programadores.

source: Formal specifications and design documents are seldom used in the project. Clear and well-written code and well-written change logs (<xref linkend="fig-change-log"/>) are used in their place. FreeBSD development happens by <quote>rough consensus and running code</quote> <citation>Carp1996</citation>.
es_es: Las especificaciones formales y los documentos de diseño rara vez se utilizan en el proyecto. En su lugar se utilizan códigos claros y bien escritos y registros de cambios bien escritos (<xref linkend="fig-change-log"/>). El desarrollo de FreeBSD se realiza mediante <quote> consenso aproximado y código en ejecución </quote> <citation>Carp1996</citation>.

source: A sample change log entry
es_es: Un ejemplo de entrada en el registro de cambios

source: Communication between programmers is enhanced by the use of a common coding standard <citerefentry><refentrytitle>style</refentrytitle><manvolnum>9</manvolnum></citerefentry>.
es_es: La comunicación entre programadores se mejora mediante el uso de un <citerefentry><refentrytitle>style</refentrytitle><manvolnum>9</manvolnum></citerefentry> estándar de codificación común.

source: Communication Channels
es_es: Vías de comunicación

source: FreeBSD's contributors are spread across the world. Email (and to a lesser extent, IRC) is the preferred means of communication in the project.
es_es: Los contribuyentes a FreeBSD están repartidos por todo el mundo. El correo electrónico (y en menor medida IRC) es el medio de comunicación preferido en el proyecto.

source: Best Practices for collaborating with the FreeBSD project
es_es: Mejores Prácticas para colaborar con el proyecto FreeBSD

source: We now look at a few best practices for making the best use of FreeBSD in product development.
es_es: A continuación presentamos algunas de las mejores prácticas para hacer el mejor uso de FreeBSD en el desarrollo de productos.

source: Plan for the long term
es_es: Planificar a largo plazo

source: Setup processes that help in tracking the development of FreeBSD. For example:
es_es: Establecer procesos que ayuden a hacer el seguimiento del desarrollo de FreeBSD. Por ejemplo:

source: Track FreeBSD source code
es_es: Seguimiento del código fuente de FreeBSD

source: The project makes it easy to mirror its SVN repository using <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide/article.html#svn-advanced-use-setting-up-svnsync"><application>svnsync</application></link>. Having the complete history of the source is useful when debugging complex problems and offers valuable insight into the intentions of the original developers. Use a capable source control system that allows you to easily merge changes between the upstream FreeBSD code base and your own in-house code.
es_es: El proyecto facilita la duplicación de su repositorio SVN utilizando <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide/article.html#svn-advanced-use-setting-up-svnsync"><application>svnsyncnc</application></link>. Tener el historial completo del código fuente es útil para depurar problemas complejos y ofrece una valiosa perspectiva de las intenciones de los desarrolladores iniciales. Utilice un sistema de control de código fuente capaz que le permita combinar fácilmente los cambios entre la base de código de FreeBSD y su propio código interno.

source: <xref linkend="fig-svn-blame"/> shows a portion of an annotated listing of the file referenced by the change log in <xref linkend="fig-change-log"/>. The ancestry of each line of the source is clearly visible. Annotated listings showing the history of every file that is part of FreeBSD are <link xlink:href="https://svnweb.freebsd.org/">available on the web</link>.
es_es: <xref linkend="fig-svn-blame"/> muestra una parte de un listado anotado del archivo referenciado por el registro de cambios en <xref linkend="fig-change-log"/>. La ascendencia de cada línea de la fuente es claramente visible. Los listados anotados que muestran el historial de cada fichero que forma parte de FreeBSD están <link xlink:href="https://svnweb.freebsd.org/">disponibles en la web</link>.

source: An annotated source listing generated using <command>svn blame</command>
es_es: Un listado de fuentes anotado generado usando <command>svn blame</command>

source: Use a gatekeeper
es_es: Usar un controlador de acceso

source: Appoint a <firstterm>gatekeeper</firstterm> to monitor FreeBSD development, to keep an eye out for changes that could potentially impact your products.
es_es: Designe un <firstterm>controlador de acceso</firstterm> para monitorizar el desarrollo de FreeBSD, para estar al tanto de los cambios que podrían afectar a sus productos.

source: Report bugs upstream
es_es: Informar de errores a los desarrolladores

source: If you notice bug in the FreeBSD code that you are using, file a <link xlink:href="https://www.FreeBSD.org/support/bugreports.html">bug report</link>. This step helps ensure that you do not have to fix the bug the next time you take a code drop from upstream.
es_es: Si nota un error en el código de FreeBSD que está usando, rellene un <link xlink:href="https://www.FreeBSD.org/support/bugreports.html">informe de errores</link>. Este paso ayuda a asegurar que usted no tenga que arreglar el error la próxima vez que coja el código desde el proyecto.

source: Leverage FreeBSD's release engineering efforts
es_es: Aproveche los esfuerzos de ingeniería del lanzamiento de FreeBSD

source: Use code from a -STABLE development branch of FreeBSD. These development branches are formally supported by FreeBSD's release engineering and security teams and comprise of tested code.
es_es: Utilice código de una rama de desarrollo -ESTABLE de FreeBSD. Estas ramas de desarrollo están formalmente soportadas por los equipos de seguridad e ingeniería de lanzamiento de FreeBSD y se componen de código probado.

source: Donate code to reduce costs
es_es: Donar código para reducir costes

source: A major proportion of the costs associated with developing products is that of doing maintenance. By donating non-critical code to the project, you benefit by having your code see much wider exposure than it would otherwise get. This in turn leads to more bugs and security vulnerabilities being flushed out and performance anomalies being identified and fixed.
es_es: Una parte importante de los costes asociados al desarrollo de productos es el mantenimiento. Al donar código no crítico al proyecto, te beneficias de que tu código tenga una exposición mucho más amplia de la que tendría de otro modo. Esto, a su vez, lleva a que se eliminen más errores y vulnerabilidades de seguridad y a que se identifiquen y solucionen las anomalías de rendimiento.

source: Get support effectively
es_es: Obtenga apoyo de manera efectiva

source: For products with tight deadlines, it is recommended that you hire or enter into a consulting agreement with a developer or firm with FreeBSD experience. The <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-jobs">FreeBSD related employment mailing list</link> is a useful communication channel to find talent. The FreeBSD project maintains a <link xlink:href="@@URL_RELPREFIX@@/commercial/consult_bycat.html">gallery of consultants and consulting firms</link> undertaking FreeBSD work. The <link xlink:href="http://www.bsdcertification.org/">BSD Certification Group</link> offers certification for all the major BSD derived OSes.
es_es: Para productos con plazos de entrega ajustados, se recomienda que contrate o haga un acuerdo de consultoría con un desarrollador o empresa con experiencia en FreeBSD. La <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-jobs">lista de correo de empleo relacionada con FreeBSD</link> es un canal de comunicación útil para encontrar talento. El proyecto FreeBSD mantiene una <link xlink:href="@@URL_RELPREFIX@@/commercial/consult_bycat.html">lista de consultores y empresas consultoras</link> que realizan trabajos en FreeBSD. El <link xlink:href="http://www.bsdcertification.org/">Grupo de Certificación BSD</link> ofrece certificación para todos los principales Sistemas Operativos derivados de BSD.

source: For less critical needs, you can ask for help on the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo">project mailing lists</link>. A useful guide to follow when asking for help is given in <citation>Ray2004</citation>.
es_es: Para necesidades menos críticas, puede pedir ayuda en las <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo">listas de correo del proyecto</link>. Una guía útil para pedir ayuda se encuentra en <citation>Ray2004</citation>.

source: Publicize your involvement
es_es: Publicite su participación

source: You are not required to publicize your use of FreeBSD, but doing so helps both your effort as well as that of the project.
es_es: No es necesario que publicite su uso de FreeBSD, pero hacerlo ayuda tanto a su esfuerzo como al del proyecto.

source: Letting the FreeBSD community know that your company uses FreeBSD helps improve your chances of attracting high quality talent. A large roster of support for FreeBSD also means more mind share for it among developers. This in turn yields a healthier foundation for your future.
es_es: Hacer saber a la comunidad FreeBSD que su empresa utiliza FreeBSD ayuda a mejorar sus posibilidades de atraer talento de alta calidad. Una amplia nómina de soporte a FreeBSD también significa más intercambio de ideas para los desarrolladores. Esto a su vez produce una base más saludable para su futuro.

source: Support FreeBSD developers
es_es: Soporte a los desarrolladores de FreeBSD

source: Sometimes the most direct way to get a desired feature into FreeBSD is to support a developer who is already looking at a related problem. Help can range from hardware donations to direct financial assistance. In some countries, donations to the FreeBSD project enjoy tax benefits. The project has a dedicated <link xlink:href="@@URL_RELPREFIX@@/donations/">donations liaison</link> to assist donors. The project also maintains a web page where developers <link xlink:href="@@URL_RELPREFIX@@/donations/wantlist.html">list their needs</link>.
es_es: A veces la forma más directa de obtener una característica deseada en FreeBSD es apoyar a un desarrollador que ya está buscando un problema relacionado. La ayuda puede ir desde donaciones de hardware hasta asistencia financiera directa. En algunos países, las donaciones al proyecto FreeBSD gozan de beneficios fiscales. El proyecto cuenta con un enlace para <link xlink:href="@@URL_RELPREFIX@@/donations/">donaciones</link> para informar a los donantes. El proyecto también mantiene una página web donde los desarrolladores tienen una <link xlink:href="@@URL_RELPREFIX@@/donations/wantlist.html"> lista con sus necesidades </link>.
