Repository: doc-br/zanata
Catalog: articles/*/geom-class.po
Languages: es_es

source: The main benefit of using a thread to handle I/O requests is that it can sleep when needed. Now, this sounds good, but should be carefully thought out. Sleeping is well and very convenient but can very effectively destroy performance of the geom transformation. Extremely performance-sensitive classes probably should do all the work in <function>.start</function>() function call, taking great care to handle out-of-memory and similar errors.
es_es: La principal ventaja de utilizar un thread para manejar las solicitudes de I/O es que pueden dormir (sleep) cuando sea necesario. Ahora, esto suena bien, pero debe ser cuidadosamente pensado. Dormir es bueno y muy conveniente, pero puede ser muy efectivo destruyendo el rendimiento de la transformación de geom. Las clases extremadamente sensibles al rendimiento probablemente deberían de hacer todo el trabajo en la llamada a la función <function>.start</function>(), teniendo mucho cuidado de manejar los errores de falta de memoria y similares.
