Repository: doc-br/zanata
Catalog: articles/*/geom-class.po
Languages: es_es

# _
source: translator-credits
es_es: Sergio Carlavilla carlavilla@mailbox.org, 2019

source: Writing a GEOM Class
es_es: Escribiendo una clase GEOM

source: This text documents some starting points in developing GEOM classes, and kernel modules in general. It is assumed that the reader is familiar with C userland programming.
es_es: Este texto documenta algunos puntos de partida en el desarrollo de clases GEOM y módulos del kernel en general. Se asume que el lector está familiarizado con la programación en C.

source: Introduction
es_es: Introducción

source: Documentation
es_es: Documentación

source: Documentation on kernel programming is scarce — it is one of few areas where there is nearly nothing in the way of friendly tutorials, and the phrase <quote>use the source!</quote> really holds true. However, there are some bits and pieces (some of them seriously outdated) floating around that should be studied before beginning to code:
es_es: La documentación sobre la programación del kernel es escasa — es una de las pocas áreas donde casi no hay tutoriales amigables, y la frase <quote>¡usa el código fuente!</quote> es realmente cierta. Sin embargo, hay algunos trozos (algunos de ellos muy desactualizados) flotando alrededor que deben estudiarse antes de comenzar a programar:

source: The <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/developers-handbook/index.html">FreeBSD Developer's Handbook</link> — part of the documentation project, it does not contain anything specific to kernel programming, but rather some general useful information.
es_es: El <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/developers-handbook/index.html">Manual del desarrollador de FreeBSD</link> — parte del proyecto de documentación, no contiene nada específico sobre la programación del kernel, sino más bien información general de utilidad.

source: The <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/arch-handbook/index.html">FreeBSD Architecture Handbook</link> — also from the documentation project, contains descriptions of several low-level facilities and procedures. The most important chapter is 13, <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/arch-handbook/driverbasics.html">Writing FreeBSD device drivers</link>.
es_es: El <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/arch-handbook/index.html">Manual de arquitectura de FreeBSD</link> — también del proyecto de documentación, contiene descripciones de varios recursos y procedimientos de bajo nivel. El capítulo más importante es el 13, <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/arch-handbook/driverbasics.html">Escribir controladores de dispositivos en FreeBSD</link>.

source: The Blueprints section of <link xlink:href="http://www.freebsddiary.org">FreeBSD Diary</link> web site — contains several interesting articles on kernel facilities.
es_es: La sección Blueprints del sitio web <link xlink:href="http://www.freebsddiary.org">FreeBSD Diary</link> — contiene varios artículos interesantes sobre recursos del kernel.

source: The man pages in section 9 — for important documentation on kernel functions.
es_es: Las páginas man en la sección 9 - para documentación importante sobre las funciones del kernel.

source: The <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>4</manvolnum></citerefentry> man page and <link xlink:href="http://phk.freebsd.dk/pubs/">PHK's GEOM slides</link> — for general introduction of the GEOM subsystem.
es_es: La página man de <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>4</manvolnum></citerefentry> y <link xlink:href="http://phk.freebsd.dk/pubs/">las diapositivas GEOM de PHK</link> — para la introducción general del subsistema GEOM.

source: Man pages <citerefentry><refentrytitle>g_bio</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_event</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_data</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_geom</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_provider</refentrytitle><manvolnum>9</manvolnum></citerefentry> <citerefentry><refentrytitle>g_consumer</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_access</refentrytitle><manvolnum>9</manvolnum></citerefentry> &amp; others linked from those, for documentation on specific functionalities.
es_es: Las páginas man de <citerefentry><refentrytitle>g_bio</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_event</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_data</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_geom</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_provider</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_consumer</refentrytitle><manvolnum>9</manvolnum></citerefentry>, <citerefentry><refentrytitle>g_access</refentrytitle><manvolnum>9</manvolnum></citerefentry> &amp; otras vinculadas a partir de ellas, para documentación sobre funcionalidades específicas.

source: The <citerefentry><refentrytitle>style</refentrytitle><manvolnum>9</manvolnum></citerefentry> man page — for documentation on the coding-style conventions which must be followed for any code which is to be committed to the FreeBSD Subversion tree.
es_es: La página man de <citerefentry><refentrytitle>style</refentrytitle><manvolnum>9</manvolnum></citerefentry> — para la documentación sobre las convenciones de estilo de codificación que se deben seguir para cualquier código con el que se haga commit en el árbol de Subversion de FreeBSD.

source: Preliminaries
es_es: Preliminares

source: The best way to do kernel development is to have (at least) two separate computers. One of these would contain the development environment and sources, and the other would be used to test the newly written code by network-booting and network-mounting filesystems from the first one. This way if the new code contains bugs and crashes the machine, it will not mess up the sources (and other <quote>live</quote> data). The second system does not even require a proper display. Instead, it could be connected with a serial cable or KVM to the first one.
es_es: La mejor forma de hacer el desarrollo del kernel es tener (al menos) dos ordenadores separados. Uno de ellos debería de tener el entorno de desarrollo y el código fuente, y el otro sería usado para probar el código recién escrito, inicializando a través de la red y montando su sistema de archivos desde el primer ordenador. De esta forma, si el nuevo código contiene errores y bloquea el ordenador, esto no dañará el código fuente (ni ningún otro dato que este ejecutandose en <quote>caliente</quote>). El segundo sistema ni siquiera necesita un monitor adecuado. En su lugar, podría estar conectado con un cable serie o KVM al primer ordenador.

source: But, since not everybody has two or more computers handy, there are a few things that can be done to prepare an otherwise <quote>live</quote> system for developing kernel code. This setup is also applicable for developing in a <link xlink:href="http://www.vmware.com/">VMWare</link> or <link xlink:href="http://www.qemu.org/">QEmu</link> virtual machine (the next best thing after a dedicated development machine).
es_es: Pero, dado que no todo el mundo tiene dos o más ordenadores a mano, hay algunas cosas que se pueden hacer para preparar un sistema <quote>live</quote> para desarrollar el código del kernel. Esta configuración también es aplicable para el desarrollo en una máquina virtual <link xlink:href="http://www.vmware.com/">VMWare</link> o <link xlink:href="http://www.qemu.org/">QEMU</link> (la mejor opción después de una máquina de desarrollo dedicada).

source: Modifying a System for Development
es_es: Modificar un sistema para el desarrollo

source: For any kernel programming a kernel with <option>INVARIANTS</option> enabled is a must-have. So enter these in your kernel configuration file:
es_es: Para cualquier programación del kernel, un kernel con la opción <option>INVARIANTS</option> activada es obligatorio. Así que añada estas líneas a su archivo de configuración del kernel:

source: For more debugging you should also include WITNESS support, which will alert you of mistakes in locking:
es_es: Para tener un mayor nivel de depuración, también debe incluir el soporte de WITNESS, que le advertirá sobre errores relacionados con los bloqueos:

source: For debugging crash dumps, a kernel with debug symbols is needed:
es_es: Para depurar los volcados de memoria, se necesita un kernel con símbolos de depuración:

source: With the usual way of installing the kernel (<command>make installkernel</command>) the debug kernel will not be automatically installed. It is called <filename>kernel.debug</filename> and located in <filename>/usr/obj/usr/src/sys/KERNELNAME/</filename>. For convenience it should be copied to <filename>/boot/kernel/</filename>.
es_es: Con la forma habitual de instalar el kernel (<command>make installkernel</command>), el kernel de depuración no se instalará automáticamente. Se llama <filename>kernel.debug</filename> y se encuentra en <filename>/usr/obj/usr/src/sys/KERNELNAME/</filename>. Por convención, se debe copiar a <filename>/boot/kernel/</filename>.

source: Another convenience is enabling the kernel debugger so you can examine a kernel panic when it happens. For this, enter the following lines in your kernel configuration file:
es_es: Otra convención es habilitar la depuración derl kernel para que pueda examinar el kernel panic cuando suceda. Para esto, introduzca las siguientes lineas en su fichero de configuración del kernel:

source: For this to work you might need to set a sysctl (if it is not on by default):
es_es: Para que esto funcione, es posible que necesite establecer un sysctl (si no está activado de forma predeterminada):

source: Kernel panics will happen, so care should be taken with the filesystem cache. In particular, having softupdates might mean the latest file version could be lost if a panic occurs before it is committed to storage. Disabling softupdates yields a great performance hit, and still does not guarantee data consistency. Mounting filesystem with the <quote>sync</quote> option is needed for that. For a compromise, the softupdates cache delays can be shortened. There are three sysctl's that are useful for this (best to be set in <filename>/etc/sysctl.conf</filename>):
es_es: Ocurrirán kernel panics, por lo que se debe tener cuidado con el cache del sistema de archivos. En particular, tener habilitadas las softupdates puede significar que la última versión del archivo podría perderse si se produce un kernel panic antes de que se haya hecho commit al almacenamiento. Deshabilitar las softupdates produce un gran impacto en el rendimiento, y no garantiza la consistencia de los datos. Para eso es necesario montar el sistema de archivos con la opción <quote>sync</quote>. Como propuesta, los delays de la cache de softupdates pueden ser acortados. Hay tres sysctls que son útiles para esto (lo mejor es establecerlas en <filename>/etc/sysctl.conf</filename>):

source: The numbers represent seconds.
es_es: Los números representan segundos.

source: For debugging kernel panics, kernel core dumps are required. Since a kernel panic might make filesystems unusable, this crash dump is first written to a raw partition. Usually, this is the swap partition. This partition must be at least as large as the physical RAM in the machine. On the next boot, the dump is copied to a regular file. This happens after filesystems are checked and mounted, and before swap is enabled. This is controlled with two <filename>/etc/rc.conf</filename> variables:
es_es: Para depurar los kernel panics, los dumps del kernel son necesarios. Dado que un kernel panic podría inutilizar los sistemas de archivos, este volcado de memoria se graba primero en una partición sin formato (raw). Por lo general, esta es la partición swap. Esta partición debe ser al menos tan grande como la RAM física en la máquina. En el siguiente arranque, el volcado se copia en un archivo normal. Esto sucede después de que los sistemas de archivos se verifiquen y monten, y antes de habilitar la swap. Esto se controla con dos variables en <filename>/etc/rc.conf</filename>:

source: The <varname>dumpdev</varname> variable specifies the swap partition and <varname>dumpdir</varname> tells the system where in the filesystem to relocate the core dump on reboot.
es_es: La variable <varname>dumpdev</varname> especifica la partición de swap y <varname>dumpdir</varname> informa al sistema dónde se encuentra en el sistema de archivos para reubicar el dump del kernel al reiniciar.

source: Writing kernel core dumps is slow and takes a long time so if you have lots of memory (&gt;256M) and lots of panics it could be frustrating to sit and wait while it is done (twice — first to write it to swap, then to relocate it to filesystem). It is convenient then to limit the amount of RAM the system will use via a <filename>/boot/loader.conf</filename> tunable:
es_es: Escribir volcados del kernel es lento y lleva mucho tiempo, por lo que si tiene mucha memoria (&gt;256M) y muchos kernel panics, puede ser frustrante sentarse y esperar mientras se hace (dos veces — primero escribirlo en el swap, luego reubicarlo al sistema de archivos). Es conveniente limitar la cantidad de RAM que utilizará el sistema a través de una variable en <filename>/boot/loader.conf</filename>:

source: If the panics are frequent and filesystems large (or you simply do not trust softupdates+background fsck) it is advisable to turn background fsck off via <filename>/etc/rc.conf</filename> variable:
es_es: Si los kernel panics son frecuentes y los sistemas de archivos son grandes (o simplemente no confía en softupdates + background fsck), es aconsejable desactivar fsck en segundo plano mediante la siguiente variable en <filename>/etc/rc.conf</filename>:

source: This way, the filesystems will always get checked when needed. Note that with background fsck, a new panic could happen while it is checking the disks. Again, the safest way is not to have many local filesystems by using another computer as an NFS server.
es_es: De esta forma, los sistemas de archivos siempre serán verificados cuando sea necesario. Tenga en cuenta que con fsck en segundo plano, podría producirse un nuevo kernel panic mientras comprueba los discos. Una vez más, la forma más segura es no tener muchos sistemas de archivos locales utilizando otro ordenador como servidor NFS.

source: Starting the Project
es_es: Empezando el proyecto

source: For the purpose of creating a new GEOM class, an empty subdirectory has to be created under an arbitrary user-accessible directory. You do not have to create the module directory under <filename>/usr/src</filename>.
es_es: Con el fin de crear una nueva clase GEOM, se debe crear un subdirectorio vacío bajo un directorio arbitrario que sea accesible por el usuario. No es necesario crear el directorio del módulo en <filename>/usr/src</filename>.

source: The Makefile
es_es: El Makefile

source: It is good practice to create <filename>Makefile</filename>s for every nontrivial coding project, which of course includes kernel modules.
es_es: Es una buena práctica crear <filename>Makefile</filename>s para cada proyecto de programación que no sea trivial, esto incluye obviamente módulos del kernel.

source: Creating the <filename>Makefile</filename> is simple thanks to an extensive set of helper routines provided by the system. In short, here is how a minimal <filename>Makefile</filename> looks for a kernel module:
es_es: Crear el archivo <filename>Makefile</filename> es sencillo gracias a un extenso conjunto de rutinas de ayuda proporcionadas por el sistema. En resumen, aquí un ejemplo de cómo un archivo <filename>Makefile</filename> con lo mínimo busca un módulo del kernel:

source: This <filename>Makefile</filename> (with changed filenames) will do for any kernel module, and a GEOM class can reside in just one kernel module. If more than one file is required, list it in the <envar>SRCS</envar> variable, separated with whitespace from other filenames.
es_es: Este <filename>Makefile</filename> (con nombres de archivo modificados) funcionará para cualquier módulo del kernel, y una clase GEOM puede residir en un solo módulo del kernel. Si se necesita más de un archivo, enumérelo en la variable <envar>SRCS</envar>, separado con espacios en blanco de otros nombres de archivo.

source: On FreeBSD Kernel Programming
es_es: Programación del kernel de FreeBSD

source: Memory Allocation
es_es: Asignación de memoria

source: See <citerefentry><refentrytitle>malloc</refentrytitle><manvolnum>9</manvolnum></citerefentry>. Basic memory allocation is only slightly different than its userland equivalent. Most notably, <function>malloc</function>() and <function>free</function>() accept additional parameters as is described in the man page.
es_es: Consulte <citerefentry><refentrytitle>malloc</refentrytitle><manvolnum>9</manvolnum></citerefentry>. La asignación básica de memoria es solo ligeramente diferente de su userland equivalente. En particular, <function>malloc</function>() y <function>free</function>() aceptan parámetros adicionales como se describe en la página del manual.

source: A <quote>malloc type</quote> must be declared in the declaration section of a source file, like this:
es_es: Un <quote>malloc type</quote> debe declararse en al sección de declaración del archivo del código fuente, de la siguiente forma:

source: To use this macro, <filename>sys/param.h</filename>, <filename>sys/kernel.h</filename> and <filename>sys/malloc.h</filename> headers must be included.
es_es: Para usar esta macro, los headers <filename>sys/param.h</filename>, <filename>sys/kernel.h</filename> y <filename>sys/malloc.h</filename> deben ser incluidos.

source: There is another mechanism for allocating memory, the UMA (Universal Memory Allocator). See <citerefentry><refentrytitle>uma</refentrytitle><manvolnum>9</manvolnum></citerefentry> for details, but it is a special type of allocator mainly used for speedy allocation of lists comprised of same-sized items (for example, dynamic arrays of structs).
es_es: Hay otro mecanismo para asignar memoria, el UMA (Universal Memory Allocator). Consulte <citerefentry><refentrytitle>uma</refentrytitle><manvolnum>9</manvolnum></citerefentry> para obtener más información, pero es un tipo especial de asignador que se usa principalmente para la asignación rápida de listas que comprenden elementos del mismo tamaño (por ejemplo, arrays dinámicos de structs).

source: Lists and Queues
es_es: Listas y colas

source: See <citerefentry><refentrytitle>queue</refentrytitle><manvolnum>3</manvolnum></citerefentry>. There are a LOT of cases when a list of things needs to be maintained. Fortunately, this data structure is implemented (in several ways) by C macros included in the system. The most used list type is TAILQ because it is the most flexible. It is also the one with largest memory requirements (its elements are doubly-linked) and also the slowest (although the speed variation is on the order of several CPU instructions more, so it should not be taken seriously).
es_es: Consulte <citerefentry><refentrytitle>queue</refentrytitle><manvolnum>3</manvolnum></citerefentry>. Hay MUCHOS casos en los que se debe mantener una lista de cosas. Afortunadamente, esta estructura de datos está implementada (de varias formas) por las macros de C incluidas en el sistema. El tipo de lista más utiliado es TAILQ porque es el más flexible. También es el que tiene mayores requisitos de memoria (sus elementos están doblemente vinculados) y también el más lento (aunque la variación de la velocidad es del orden de varias instrucciones de la CPU, por lo que no debe tomarse en serio).

source: If data retrieval speed is very important, see <citerefentry><refentrytitle>tree</refentrytitle><manvolnum>3</manvolnum></citerefentry> and <citerefentry><refentrytitle>hashinit</refentrytitle><manvolnum>9</manvolnum></citerefentry>.
es_es: Si la velocidad de recuperación de datos es muy importante, consulte <citerefentry><refentrytitle>tree</refentrytitle><manvolnum>3</manvolnum></citerefentry> y <citerefentry><refentrytitle>hashinit</refentrytitle><manvolnum>9</manvolnum></citerefentry>.

source: Structure <varname remap="structname">bio</varname> is used for any and all Input/Output operations concerning GEOM. It basically contains information about what device ('provider') should satisfy the request, request type, offset, length, pointer to a buffer, and a bunch of <quote>user-specific</quote> flags and fields that can help implement various hacks.
es_es: La estructura <varname remap="structname">bio</varname> se utiliza por todas y cada una de las operaciones de Input/Output relacionadas con GEOM. Básicamente contiene información sobre qué dispositivo ('provider') se debe encargar de la solicitud, el tipo de solicitud, offset, longitud, pointer a un buffer y un grupo de indicadores y campos <quote>específicos del usuario</quote> que pueden ayudar a implementar varios hacks.

source: The important thing here is that <varname remap="structname">bio</varname>s are handled asynchronously. That means that, in most parts of the code, there is no analogue to userland's <citerefentry><refentrytitle>read</refentrytitle><manvolnum>2</manvolnum></citerefentry> and <citerefentry><refentrytitle>write</refentrytitle><manvolnum>2</manvolnum></citerefentry> calls that do not return until a request is done. Rather, a developer-supplied function is called as a notification when the request gets completed (or results in error).
es_es: Lo importante aquí es que las estructuras <varname remap="structname">bio</varname>s son tratados de forma asincrónica. Esto significa que, en la mayor parte del código, no hay un término análogo a las llamadas <citerefentry><refentrytitle>read</refentrytitle><manvolnum>2</manvolnum></citerefentry> y <citerefentry><refentrytitle>write</refentrytitle><manvolnum>2</manvolnum></citerefentry> que devuelvan un valor hasta que se realiza una solicitud. En su lugar, se llama a una función proporcionada por el desarrollador que actua como una notificacion cuando la solicitud se completa (o se produce un error).

source: The asynchronous programming model (also called <quote>event-driven</quote>) is somewhat harder than the much more used imperative one used in userland (at least it takes a while to get used to it). In some cases the helper routines <function>g_write_data</function>() and <function>g_read_data</function>() can be used, but <emphasis>not always</emphasis>. In particular, they cannot be used when a mutex is held; for example, the GEOM topology mutex or the internal mutex held during the <function>.start</function>() and <function>.stop</function>() functions.
es_es: El modelo de programación asincrónica (también llamado <quote>orientado a eventos</quote>) es un poco más difícil que el imperativo, mucho más usado en el espacio de usuario (lleva un tiempo acostumbrarse). En algunos casos, se pueden utilizar las rutinas auxiliares <function>g_write_data</function>() y <function>g_read_data</function>(), pero <emphasis>no siempre</emphasis>. En particular, no se pueden utiliar cuando se mantiene un mutex; por ejemplo, el GEOM topology mutex o el mutex interno mantenido durante las funciones <function>.start</function>() y <function>.stop</function>().

source: On GEOM Programming
es_es: Programación GEOM
