Repository: doc-br/zanata
Catalog: articles/*/geom-class.po
Languages: es_es

source: If maximum performance is not needed, a much simpler way of making a data transformation is to implement it in userland via the ggate (GEOM gate) facility. Unfortunately, there is no easy way to convert between, or even share code between the two approaches.
es_es: Si no se necesita el máximo rendimiento, una forma mucho más sencilla de realizar una transformación de datos es implementarla en el espacio de usuario a través de la función ggate (GEOM gate). Desafortunadamente, no hay una manera fácil de convertir o incluso compartir código entre las dos aproximaciones.

source: GEOM Class
es_es: Clase GEOM

source: GEOM classes are transformations on the data. These transformations can be combined in a tree-like fashion. Instances of GEOM classes are called <emphasis>geoms</emphasis>.
es_es: Las clases GEOM son transformaciones en los datos. Estas transformaciones se pueden combinar en forma de árbol. Las instancias de las clases GEOM se denominan <emphasis>geoms</emphasis>.

source: Each GEOM class has several <quote>class methods</quote> that get called when there is no geom instance available (or they are simply not bound to a single instance):
es_es: Cada clase GEOM tiene varios <quote>métodos de clase</quote> a los que se llama cuando no hay una instancia geom disponible (o simplemente no están vinculados a una sola instancia):

source: <function>.init</function> is called when GEOM becomes aware of a GEOM class (when the kernel module gets loaded.)
es_es: Se llama a <function>.init</function> cuando GEOM se da cuenta de una clase GEOM (cuando se carga el módulo del kernel).

source: <function>.fini</function> gets called when GEOM abandons the class (when the module gets unloaded)
es_es: Se llama a <function>.fini</function> cuando GEOM abandona la clase (cuando el módulo se descarga)

source: <function>.taste</function> is called next, once for each provider the system has available. If applicable, this function will usually create and start a geom instance.
es_es: A continuación se llama a <function>.taste</function>, una vez por cada proveedor que el sistema tenga disponible. Si corresponde, esta función generalmente creará e iniciará una instancia geom.

source: <function>.destroy_geom</function> is called when the geom should be disbanded
es_es: Se llama a <function>.destroy_geom</function> cuando geom debe ser destruido

source: <function>.ctlconf</function> is called when user requests reconfiguration of existing geom
es_es: Se llama a <function>.ctlconf</function> cuando el usuario solicita la reconfiguración del geom existente

source: Also defined are the GEOM event functions, which will get copied to the geom instance.
es_es: También se definen las funciones de eventos GEOM, que se copiarán en la instancia de geom.

source: Field <function>.geom</function> in the <varname remap="structname">g_class</varname> structure is a LIST of geoms instantiated from the class.
es_es: El campo <function>.geom</function> en la estructura <varname remap="structname">g_class</varname> es un LIST de geoms instanciados de la clase.

source: These functions are called from the g_event kernel thread.
es_es: Estas funciones son llamadas desde el thread del kernel g_event.

source: The name <quote>softc</quote> is a legacy term for <quote>driver private data</quote>. The name most probably comes from the archaic term <quote>software control block</quote>. In GEOM, it is a structure (more precise: pointer to a structure) that can be attached to a geom instance to hold whatever data is private to the geom instance. Most GEOM classes have the following members:
es_es: El nombre <quote>softc</quote> es un término legado para <quote>driver private data</quote>. El nombre probablemente proviene del término arcaico <quote>software control block</quote>. En GEOM, es una estructura (para ser más precisos: un pointer a una estructura) que se puede adjuntar a una instancia de geom para mantener cualquier información que sea privada para la instancia de geom. La mayoría de las clases de GEOM tienen los siguientes elementos:

source: <varname>struct g_provider *provider</varname> : The <quote>provider</quote> this geom instantiates
es_es: <varname>struct g_provider *provider</varname> : El <quote>provider</quote> de esta instancia GEOM

source: <varname>uint16_t n_disks</varname> : Number of consumer this geom consumes
es_es: <varname>uint16_t n_disks</varname> : Número de consumidores que usa GEOM

source: <varname>struct g_consumer **disks</varname> : Array of <varname>struct g_consumer*</varname>. (It is not possible to use just single indirection because struct g_consumer* are created on our behalf by GEOM).
es_es: <varname>struct g_consumer **disks</varname> : Array de <varname>struct g_consumer*</varname>. (No es posible usar solo direccionamiento indirecto porque struct g_consumer* ha sido creado en nuestro nombre por GEOM).

source: The <varname remap="structname">softc</varname> structure contains all the state of geom instance. Every geom instance has its own softc.
es_es: La estructura <varname remap="structname">softc</varname> contiene todo el estado de la instancia geom. Cada instancia de geom tiene su propio softc.

source: Format of metadata is more-or-less class-dependent, but MUST start with:
es_es: El formato de los metadatos es más o menos dependiente de la clase, pero DEBE comenzar por:

source: 16 byte buffer for null-terminated signature (usually the class name)
es_es: Un buffer de 16 bytes para la firma terminada en null (normalmente el nombre de la clase)

source: uint32 version ID
es_es: ID de la versión del tipo uint32

source: It is assumed that geom classes know how to handle metadata with version ID's lower than theirs.
es_es: Se supone que las clases de geom saben cómo manejar los metadatos con ID de versión menores que los los suyos.

source: Metadata is located in the last sector of the provider (and thus must fit in it).
es_es: Los metadatos se encuentran en el último sector del provider (y, por lo tanto, deben encajar en él).

source: (All this is implementation-dependent but all existing code works like that, and it is supported by libraries.)
es_es: Todo depende de la implementación, pero todo el código existente funciona así, y es compatible con las bibliotecas.

source: Labeling/creating a GEOM
es_es: Etiquetar/crear un GEOM

source: The sequence of events is:
es_es: La secuencia de eventos es:

source: user calls <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>8</manvolnum></citerefentry> utility (or one of its hardlinked friends)
es_es: el usuario llama a la utilidad <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>8</manvolnum></citerefentry> (o uno de sus equivalentes hardlinked)

source: the utility figures out which geom class it is supposed to handle and searches for <filename>geom_<replaceable>CLASSNAME</replaceable>.so</filename> library (usually in <filename>/lib/geom</filename>).
es_es: la utilidad determina qué clase geom se supone que debe manejar y busca la biblioteca <filename>geom_<replaceable>CLASSNAME</replaceable>.so</filename> (normalmente en <filename>/lib/geom</filename>).

source: it <citerefentry><refentrytitle>dlopen</refentrytitle><manvolnum>3</manvolnum></citerefentry>-s the library, extracts the definitions of command-line parameters and helper functions.
es_es: <citerefentry><refentrytitle>dlopen</refentrytitle><manvolnum>3</manvolnum></citerefentry>-s abre la biblioteca, extrae la definición de los parámetros de la línea de comandos y funciones auxiliares.

source: In the case of creating/labeling a new geom, this is what happens:
es_es: En el caso de crear/etiquetar un nuevo geom, esto es lo que sucede:

source: <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>8</manvolnum></citerefentry> looks in the command-line argument for the command (usually <option>label</option>), and calls a helper function.
es_es: <citerefentry><refentrytitle>geom</refentrytitle><manvolnum>8</manvolnum></citerefentry> busca en el argumento de la línea de comandos el comando (generalmente <option>label</option>), y llama a una función auxiliar.

source: The helper function checks parameters and gathers metadata, which it proceeds to write to all concerned providers.
es_es: La función auxiliar comprueba los parámetros y recopila los metadatos, que procede a escribir a todos los providers interesados.

source: This <quote>spoils</quote> existing geoms (if any) and initializes a new round of <quote>tasting</quote> of the providers. The intended geom class recognizes the metadata and brings the geom up.
es_es: Esto <quote>estropea</quote> los geoms existentes (si existen) e inicia una nueva ronda de <quote>cata</quote> de los providers. La clase geom deseada reconoce los metadatos y carga la clase geom.

source: (The above sequence of events is implementation-dependent but all existing code works like that, and it is supported by libraries.)
es_es: (La secuencia de eventos anterior depende de la implementación, pero todo el código existente funciona así, y es compatible con las bibliotecas).

source: GEOM Command Structure
es_es: Estructura del comando GEOM

source: The helper <filename>geom_CLASSNAME.so</filename> library exports <varname remap="structname">class_commands</varname> structure, which is an array of <varname remap="structname">struct g_command</varname> elements. Commands are of uniform format and look like:
es_es: La biblioteca auxiliar <filename>geom_CLASSNAME.so</filename> exporta la estructura <varname remap="structname">class_commands</varname>, que es un array de elementos <varname remap="structname">struct g_command</varname>. Los comandos son de formato uniforme y se muestran de la siguiente forma:

source: Common verbs are:
es_es: Los verbos comunes son:

source: label — to write metadata to devices so they can be recognized at tasting and brought up in geoms
es_es: label — para escribir metadatos en los dispositivos para que puedan ser reconocidos en la cata y creados en geoms

source: destroy — to destroy metadata, so the geoms get destroyed
es_es: destroy — para destruir los metadatos, así se destruyen los geoms.

source: Common options are:
es_es: Las opciones comunes son:

source: Many actions, such as labeling and destroying metadata can be performed in userland. For this, <varname remap="structname">struct g_command</varname> provides field <varname>gc_func</varname> that can be set to a function (in the same <filename>.so</filename>) that will be called to process a verb. If <varname>gc_func</varname> is NULL, the command will be passed to kernel module, to <function>.ctlreq</function> function of the geom class.
es_es: Muchas acciones, como etiquetar y destruir metadatos, se pueden ejecutar en el espacio de usuario, Para ello, <varname remap="structname">struct g_command</varname> proporciona el campo <varname>gc_func</varname> que se puede establecer en una función (en el mismo <filename>.so</filename>) que se llamará para procesar un verbo. Si <varname>gc_func</varname> es NULL, el comando se pasará al módulo del kernel, a la función <function>.ctlreq</function> de la clase geom.

source: Geoms are instances of GEOM classes. They have internal data (a softc structure) and some functions with which they respond to external events.
es_es: Los Geoms son instancias de clases GEOM. Tienen datos internos (una estructura softc) y algunas funciones con las que responden a eventos externos.

source: The event functions are:
es_es: Las funciones del evento son:

source: <function>.access</function> : calculates permissions (read/write/exclusive)
es_es: <function>.access</function> : calcula permisos (lectura/escritura/exclusivo)

source: <function>.dumpconf</function> : returns XML-formatted information about the geom
es_es: <function>.dumpconf</function> : devuelve información en formato XML sobre el geom

source: <function>.orphan</function> : called when some underlying provider gets disconnected
es_es: <function>.orphan</function> : se llama cuando algún provider subyacente se desconecta

source: <function>.spoiled</function> : called when some underlying provider gets written to
es_es: <function>.spoiled</function> : se llama cuando se registra algún provider subyacente

source: <function>.start</function> : handles I/O
es_es: <function>.start</function> : maneja el I/O

source: These functions are called from the <function>g_down</function> kernel thread and there can be no sleeping in this context, (see definition of sleeping elsewhere) which limits what can be done quite a bit, but forces the handling to be fast.
es_es: Estas funciones se llaman desde el thread <function>g_down</function> del kernel y no puede haber inactividad en este contexto, (vea la definición de inactividad en otra parte) lo que limita un poco lo que se puede hacer, pero obliga a que el manejo sea rápido.

source: Of these, the most important function for doing actual useful work is the <function>.start</function>() function, which is called when a BIO request arrives for a provider managed by a instance of geom class.
es_es: De estas funciones, la más importante para realizar un trabajo útil real es la función <function>.start</function>(), que se llama cuando llega una solicitud BIO llega a un provider administrado por una instancia de la clase geom.

source: GEOM Threads
es_es: Threads GEOM

source: There are three kernel threads created and run by the GEOM framework:
es_es: Hay tres threads del kernel creados y ejecutados por el framework GEOM:

source: <literal>g_down</literal> : Handles requests coming from high-level entities (such as a userland request) on the way to physical devices
es_es: <literal>g_down</literal> : maneja solicitudes provenientes de entidades de alto nivel (como una solicitud de usuario) en el camino a dispositivos físicos

source: <literal>g_up</literal> : Handles responses from device drivers to requests made by higher-level entities
es_es: <literal>g_up</literal> : maneja las respuestas de los controladores de dispositivos a las solicitudes realizadas por entidades de nivel superior

source: <literal>g_event</literal> : Handles all other cases: creation of geom instances, access counting, <quote>spoil</quote> events, etc.
es_es: <literal>g_event</literal> : maneja el resto de casos: creación de instancias geom, conteo de accesos, eventos <quote>spoil</quote>, etc.

source: When a user process issues <quote>read data X at offset Y of a file</quote> request, this is what happens:
es_es: Cuando un proceso de usuario emite un pedido de <quote> lee los datos X en el offset Y de un archivo</quote>, esto es lo que sucede:

source: The filesystem converts the request into a struct bio instance and passes it to the GEOM subsystem. It knows what geom instance should handle it because filesystems are hosted directly on a geom instance.
es_es: El sistema de archivos convierte la solicitud en una instancia de struct bio y lo transmite al subsistema GEOM. Sabe qué instancia geom debería manejarlo porque los sistemas de archivos se alojan directamente en una instancia geom.

source: The request ends up as a call to the <function>.start</function>() function made on the g_down thread and reaches the top-level geom instance.
es_es: La solicitud termina como una llamada a la función <function>.start</function>() realizada en el thread g_down y llega a la instancia de geom de nivel superior.

source: This top-level geom instance (for example the partition slicer) determines that the request should be routed to a lower-level instance (for example the disk driver). It makes a copy of the bio request (bio requests <emphasis>ALWAYS</emphasis> need to be copied between instances, with <function>g_clone_bio</function>()!), modifies the data offset and target provider fields and executes the copy with <function>g_io_request</function>()
es_es: Esta instancia geom de nivel superior (por ejemplo, el slicer de particiones) determina que la solicitud debe enrutarse a una instancia de nivel inferior (por ejemplo, el controlador de disco). Se realiza una copia de la solicitud bio (¡las solicitudes bio <emphasis>SIEMPRE</emphasis> se deben copiar entre instancias, con la función <function>g_clone_bio</function>()!), modifica los campos de datos offset y los campos del provider de destino y se ejecuta la copia con <function>g_io_request</function>()

source: The disk driver gets the bio request also as a call to <function>.start</function>() on the <literal>g_down</literal> thread. It talks to hardware, gets the data back, and calls <function>g_io_deliver</function>() on the bio.
es_es: El controlador de disco obtiene la solicitud bio también como una llamada a <function>.start</function>() en el thread <literal>g_down</literal>. Habla con el hardware, recupera los datos y llama a <function>g_io_deliver</function>() en la bio.

source: Now, the notification of bio completion <quote>bubbles up</quote> in the <literal>g_up</literal> thread. First the partition slicer gets <function>.done</function>() called in the <literal>g_up</literal> thread, it uses information stored in the bio to free the cloned <varname remap="structname">bio</varname> structure (with <function>g_destroy_bio</function>()) and calls <function>g_io_deliver</function>() on the original request.
es_es: Ahora, la notificación de bio <quote>burbujea</quote> en el thread <literal>g_up</literal>. Primero, el slicer de paticiones obtiene <function>.done</function>() llamando al thread <literal>g_up</literal>, utiliza la información almacenada en la bio para liberar la estructura <varname remap="structname">bio</varname> clonada (con <function>g_destroy_bio</function>()) y llama a <function>g_io_deliver</function>() en la solicitud original.

source: The filesystem gets the data and transfers it to userland.
es_es: El sistema de archivos obtiene los datos y los transfiere al espacio de usuario.

source: See <citerefentry><refentrytitle>g_bio</refentrytitle><manvolnum>9</manvolnum></citerefentry> man page for information how the data is passed back and forth in the <varname remap="structname">bio</varname> structure (note in particular the <varname>bio_parent</varname> and <varname>bio_children</varname> fields and how they are handled).
es_es: Consulte la página del manual <citerefentry><refentrytitle>g_bio</refentrytitle><manvolnum>9</manvolnum></citerefentry> para obtener información sobre cómo se transfieren los datos en la estructura <varname remap="structname">bio</varname> (en particular, tenga en cuenta los campos <varname>bio_parent</varname> y <varname>bio_children</varname> y cómo se manejan)

source: One important feature is: <emphasis>THERE CAN BE NO SLEEPING IN G_UP AND G_DOWN THREADS</emphasis>. This means that none of the following things can be done in those threads (the list is of course not complete, but only informative):
es_es: Una característica importante es: <emphasis>NO SE PUEDE DORMIR (SLEEPING) EN LOS THREADS G_UP Y G_DOWN</emphasis>. Esto significa que no se puede hacer nada de lo siguiente en esos threads (la lista, por supuesto, no está completa, es solo informativa):

source: Calls to <function>msleep</function>() and <function>tsleep</function>(), obviously.
es_es: Las llamadas a <function>msleep</function>() y <function>tsleep</function>(), obviamente.

source: Calls to <function>g_write_data</function>() and <function>g_read_data</function>(), because these sleep between passing the data to consumers and returning.
es_es: Las llamadas a <function>g_write_data</function>() y <function>g_read_data</function>(), porque producen sleep al pasar datos al consumidor y regresar.

source: Waiting for I/O.
es_es: Esperando I/O.

source: Calls to <citerefentry><refentrytitle>malloc</refentrytitle><manvolnum>9</manvolnum></citerefentry> and <function>uma_zalloc</function>() with <varname>M_WAITOK</varname> flag set
es_es: Las llamadas a <citerefentry><refentrytitle>malloc</refentrytitle><manvolnum>9</manvolnum></citerefentry> y <function>uma_zalloc</function>() con el flag <varname>M_WAITOK</varname> activo

source: sx and other sleepable locks
es_es: sx y otros sleepable locks

source: This restriction is here to stop GEOM code clogging the I/O request path, since sleeping is usually not time-bound and there can be no guarantees on how long will it take (there are some other, more technical reasons also). It also means that there is not much that can be done in those threads; for example, almost any complex thing requires memory allocation. Fortunately, there is a way out: creating additional kernel threads.
es_es: Esta restricción está aquí para impedir que el código GEOM obstruya la ruta de las solicitudes de I/O, ya que el sleeping no tiene limite de tiempo y puede no haber garantías sobre cuánto tiempo tardará (también hay algunas otras razones más técnicas). Esto también significa que no hay muchos que se pueda hacer en estos threads; por ejemplo, casi cualquier cosa compleja requiere asignación de memoria. Afortunadamente, hay una salida: crear threads adicionales en el kernel.

source: Kernel Threads for Use in GEOM Code
es_es: Threads del kernel para usar en el código GEOM

source: Kernel threads are created with <citerefentry><refentrytitle>kthread_create</refentrytitle><manvolnum>9</manvolnum></citerefentry> function, and they are sort of similar to userland threads in behavior, only they cannot return to caller to signify termination, but must call <citerefentry><refentrytitle>kthread_exit</refentrytitle><manvolnum>9</manvolnum></citerefentry>.
es_es: Los threads del kernel se crean con la función <citerefentry><refentrytitle>kthread_create</refentrytitle><manvolnum>9</manvolnum></citerefentry>, y son similares en el comportamiento a los threads del espacio de usuario, solo que no pueden regresar a quien los ha llamado para indicar que ha terminado, debe llamar a <citerefentry><refentrytitle>kthread_exit</refentrytitle><manvolnum>9</manvolnum></citerefentry>.

source: In GEOM code, the usual use of threads is to offload processing of requests from <literal>g_down</literal> thread (the <function>.start</function>() function). These threads look like <quote>event handlers</quote>: they have a linked list of event associated with them (on which events can be posted by various functions in various threads so it must be protected by a mutex), take the events from the list one by one and process them in a big <literal>switch</literal>() statement.
es_es: En el código GEOM, el uso habitual de los threads es para descargar el procesamiento de peticiones del thread <literal>g_down</literal> (la función <function>.start</function>()). Estos threads se parecen a un <quote>event handlers</quote>: tienen vinculada una lista de eventos asociados a ellos (en los cuales los eventos pueden publicarse mediante varias funciones en varios threads, por lo que deben estar protegidos por un mutex), toma los eventos de la lista, uno por uno, y los procesa en una gran instrucción <literal>switch</literal>().
