Repository: doc-br/zanata
Catalog: articles/*/hubs.po
Languages: es_es

# _
source: translator-credits
es_es: Sergio Carlavilla carlavilla@FreeBSD.org, 2019

source: Mirroring FreeBSD
es_es: Crear replicas de FreeBSD

source: $FreeBSD: head/en_US.ISO8859-1/articles/hubs/article.xml 52296 2018-09-24 09:34:54Z bcr $
es_es: $FreeBSD$

source: An in-progress article on how to mirror FreeBSD, aimed at hub administrators.
es_es: Un artículo en progreso sobre cómo crear una replica de FreeBSD, destinado a los administradores de hub.

source: We are not accepting new mirrors at this time.
es_es: No aceptamos nuevas replicas en este momento.

source: Contact Information
es_es: Información de contacto

source: The Mirror System Coordinators can be reached through email at <email>mirror-admin@FreeBSD.org</email>. There is also a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hubs">FreeBSD mirror sites mailing lists</link>.
es_es: Puede contactar con los coordinadores del sistema de replicas por correo electrónico en mirror-<email>mirror-admin@FreeBSD.org</email>. También hay una <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hubs">lista de correo de los sitios de replicas de FreeBSD</link>.

source: Requirements for FreeBSD Mirrors
es_es: Requisitos para las replicas de FreeBSD

source: Disk Space
es_es: Espacio en disco

source: Disk space is one of the most important requirements. Depending on the set of releases, architectures, and degree of completeness you want to mirror, a huge amount of disk space may be consumed. Also keep in mind that <emphasis>official</emphasis> mirrors are probably required to be complete. The web pages should always be mirrored completely. Also note that the numbers stated here are reflecting the current state (at 10.4-RELEASE/12.0-RELEASE). Further development and releases will only increase the required amount. Also make sure to keep some (ca. 10-20%) extra space around just to be sure. Here are some approximate figures:
es_es: El espacio en disco es uno de los requisitos más importantes. Dependiendo del conjunto de versiones, arquitecturas y grado de cobertura que desee replicar, se puede consumir una gran cantidad de espacio en disco. También tenga en cuenta que las replicas <emphasis>oficiales</emphasis> probablemente deban estar completas. Las páginas web siempre deben estar completamente replicadas. También debe tener en cuenta que los números indicados aquí reflejan el estado actual (en 10.4-RELEASE / 12.0-RELEASE). Si se hay un aumento del desarrollo y de los lanzamientos, aumentará la cantidad requerida. También asegúrese de disponer de un poco de espacio adicional (aprox. 10-20%), por seguridad. Aquí tiene algunas cifras aproximadas:

source: Full FTP Distribution: 1.4 TB
es_es: Distribución FTP completa: 1.4 TB

source: CTM deltas: 10 GB
es_es: Deltas de CTM: 10GB

source: Web pages: 1GB
es_es: Páginas web: 1GB

source: The current disk usage of FTP Distribution can be found at <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes">ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes</link>.
es_es: El uso de disco actual de la distribución FTP se puede encontrar en <link xlink:href="ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes">ftp://ftp.FreeBSD.org/pub/FreeBSD/dir.sizes</link>.

source: Network Connection/Bandwidth
es_es: Conexión de red/ancho de banda

source: Of course, you need to be connected to the Internet. The required bandwidth depends on your intended use of the mirror. If you just want to mirror some parts of FreeBSD for local use at your site/intranet, the demand may be much smaller than if you want to make the files publicly available. If you intend to become an official mirror, the bandwidth required will be even higher. We can only give rough estimates here:
es_es: Por supuesto, necesita estar conectado a internet. El ancho de banda requerido depende del uso previsto para la replica. Si solo desea replicar algunas partes de FreeBSD para uso local en su sitio/intranet, la demanda puede ser mucho menor que si desea que los archivos estén disponibles públicamente. Si pretende convertirse en una replica oficial, el ancho de banda requerido será aún mayor. Aquí solo podemos dar estimaciones aproximadas:

source: Local site, no public access: basically no minimum, but &lt; 2 Mbps could make syncing too slow.
es_es: Sitio local, sin acceso público: básicamente, no hay un mínimo, pero con &lt; 2 Mbps puede que la sincronización sea muy lenta.

source: Unofficial public site: 34 Mbps is probably a good start.
es_es: Sitio público no oficial: 34 Mbps es probablemente un buen comienzo.

source: Official site: &gt; 100 Mbps is recommended, and your host should be connected as close as possible to your border router.
es_es: Sitio oficial: se recomiendan &gt; 100 Mbps, y su host debe estar conectado lo más cerca posible de su border router.

source: System Requirements, CPU, RAM
es_es: Requisitos del sistema, CPU, RAM

source: One thing this depends on the expected number of clients, which is determined by the server's policy. It is also affected by the types of services you want to offer. Plain FTP or HTTP services may not require a huge amount of resources. Watch out if you provide rsync. This can have a huge impact on CPU and memory requirements as it is considered a memory hog. The following are just examples to give you a very rough hint.
es_es: Esto depende mucho del número de clientes esperado, que está determinado por la política del servidor. El tamaño también se ve afectado por el tipo de servicios que desea ofrecer. Los servicios FTP o HTTP simples pueden no requerir una gran cantidad de recursos. Tenga cuidado si proporciona rsync. Esto puede tener un gran impacto en los requisitos de CPU y memoria, ya que este servicio consume una gran cantidad de memoria. Los ejemplos siguientes tienen como objetivo darle una idea bastante aproximada.

source: For a moderately visited site that offers <application>rsync</application>, you might consider a current CPU with around 800MHz - 1 GHz, and at least 512MB RAM. This is probably the minimum you want for an <emphasis>official</emphasis> site.
es_es: Para un sitio con un número de visitas moderado que ofrezca <application>rsync</application>, debería de considerar una CPU actual con aproximadamente 800MHz - 1 GHz, y, al menos 512MB de RAM. Este es, probablemente, el mínimo que desea para un sitio <emphasis>oficial</emphasis>.

source: For a frequently used site you definitely need more RAM (consider 2GB as a good start) and possibly more CPU, which could also mean that you need to go for a SMP system.
es_es: Si es un sitio con un número de visitas alto, definitivamente, necesita más RAM (2GB es un buen comienzo) y posiblemente más CPU, esto también significa la necesidad de ir hacia un sistema que disponga de SMP.

source: You also want to consider a fast disk subsystem. Operations on the SVN repository require a fast disk subsystem (RAID is highly advised). A SCSI controller that has a cache of its own can also speed up things since most of these services incur a large number of small modifications to the disk.
es_es: También debería de considerar un sistema de discos rápido. Las operaciones en el repositorio SVN requieren de un sistema de discos que sea rápido (se recomienda RAID). Un controlador SCSI que disponga de una caché propia también puede acelerar las cosas, ya que la mayoría de estos servicios realizan una gran cantidad de pequeñas modificaciones en el disco.

source: Services to Offer
es_es: Servicios a ofrecer

source: Every mirror site is required to have a set of core services available. In addition to these required services, there are a number of optional services that server administrators may choose to offer. This section explains which services you can provide and how to go about implementing them.
es_es: Se require que cada replica tenga un conjunto de servicios centrales disponibles. Además de estos servicios que son requeridos, hay una serie de servicios opcionales que los administradores del servidor pueden escoger si ofrecerlos. Esta sección explica qué servicios puede proporcionar y cómo implementarlos.

source: FTP (required for FTP Fileset)
es_es: FTP (requerido para el conjunto de archivos FTP)

source: This is one of the most basic services, and it is required for each mirror offering public FTP distributions. FTP access must be anonymous, and no upload/download ratios are allowed (a ridiculous thing anyway). Upload capability is not required (and <emphasis>must</emphasis> never be allowed for the FreeBSD file space). Also the FreeBSD archive should be available under the path <filename>/pub/FreeBSD</filename>.
es_es: Este es uno de los servicios más básicos, y es requerido en cada réplica que ofrezca distribuciones FTP públicas. El acceso a FTP debe ser anónimo, y no se permite ningún control sobre las tasas de subida/descarga (de todas formas, es ridículo). La subida de archivos no es necesaria (y nunca <emphasis>debe</emphasis> permitirse en el área donde se guardan los archivos de FreeBSD). Además, los archivos de FreeBSD deben estar disponibles en la ruta <filename>/pub/FreeBSD</filename>.

source: There is a lot of software available which can be set up to allow anonymous FTP (in alphabetical order).
es_es: Existe una gran cantidad de software disponible que se puede configurar para permitir FTP anónimo (en orden alfabético).

source: <command>/usr/libexec/ftpd</command>: FreeBSD's own ftpd can be used. Be sure to read <citerefentry><refentrytitle>ftpd</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: <command>/usr/libexec/ftpd</command>: Se puede usar el propio ftpd de FreeBSD. Asegurese de leer <citerefentry><refentrytitle>ftpd</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: <package>ftp/ncftpd</package>: A commercial package, free for educational use.
es_es: <package>ftp/ncftpd</package>: Un paquete comercial, gratis para uso educativo.

source: <package>ftp/oftpd</package>: An ftpd designed with security as a main focus.
es_es: <package>ftp/oftpd</package>: Un ftpd diseñado con la seguridad como principal objetivo.

source: <package>ftp/proftpd</package>: A modular and very flexible ftpd.
es_es: <package>ftp/proftpd</package>: Un ftpd modular y muy flexible.

source: <package>ftp/pure-ftpd</package>: Another ftpd developed with security in mind.
es_es: <package>ftp/pure-ftpd</package>: Otro ftpd desarrollado con la seguridad como principal objetivo.

source: <package>ftp/twoftpd</package>: As above.
es_es: <package>ftp/twoftpd</package>: Lo mismo que el anterior.

source: <package>ftp/vsftpd</package>: The <quote>very secure</quote> ftpd.
es_es: <package>ftp/vsftpd</package>: Un ftpd <quote>muy seguro</quote>.

source: FreeBSD's <application>ftpd</application>, <application>proftpd</application> and maybe <application>ncftpd</application> are among the most commonly used FTPds. The others do not have a large userbase among mirror sites. One thing to consider is that you may need flexibility in limiting how many simultaneous connections are allowed, thus limiting how much network bandwidth and system resources are consumed.
es_es: Entre los FTPs más utilizados en FreeBSD se encuentran <application>ftpd</application>, <application>proftpd</application> y quizá <application>ncftpd</application>. El resto no tienen una gran base de usuarios entre las sitios réplica. Una cosa a considerar es que puede necesitar flexibilidad para limitar la cantidad de conexiones simultáneas que se permiten, lo que limita la cantidad de ancho de banda y los recursos del sistema que se consumen.

source: Rsync (optional for FTP Fileset)
es_es: Rsync (opcional para el conjunto de archivos FTP)

source: <application>Rsync</application> is often offered for access to the contents of the FTP area of FreeBSD, so other mirror sites can use your system as their source. The protocol is different from FTP in many ways. It is much more bandwidth friendly, as only differences between files are transferred instead of whole files when they change. <application>Rsync</application> does require a significant amount of memory for each instance. The size depends on the size of the synced module in terms of the number of directories and files. <application>Rsync</application> can use <command>rsh</command> and <command>ssh</command> (now default) as a transport, or use its own protocol for stand-alone access (this is the preferred method for public rsync servers). Authentication, connection limits, and other restrictions may be applied. There is just one software package available:
es_es: A menudo, se ofrece <application>Rsync</application> para acceder a los contenidos del área FTP de FreeBSD, de esta forma, otras réplicas pueden usar su sistema como su fuente. El protocolo es diferente de FTP es muchos aspectos. Es mucho más amigable con el ancho de banda, ya que solo se transfieren las diferencias entre los archivos en lugar del archivo completo. <application>Rsync</application> requiere una cantidad significativa de memoria para cada instancia. El tamaño depende del tamaño del módulo que se vaya a sincronizar, en términos de cantidad de directorios y archivos. <application>Rsync</application> puede usar <command>rsh</command> y <command>ssh</command> (por defecto) como transporte, o usar su propio protocolo para el acceso independiente (este es el método preferido para los servidores de rsync públicos). Autenticación, límites de conexión y otras restricciones pueden ser aplicadas. Solo hay un paquete de software disponible:

source: HTTP (required for Web Pages, Optional for FTP Fileset)
es_es: HTTP (requerido para las páginas web, opcional para el conjunto de archivos FTP)

source: If you want to offer the FreeBSD web pages, you will need to install a web server. You may optionally offer the FTP fileset via HTTP. The choice of web server software is left up to the mirror administrator. Some of the most popular choices are:
es_es: Si quiere ofrecer las páginas web de FreeBSD, necesitará instalar un servidor web. Opcionalmente, puede ofrecer el conjunto de archivos FTP a través de HTTP. La elección del software del servidor web se deja en manos del administrador de la réplica. Algunas de las opciones más populares son:

source: <package>www/apache24</package>: <application>Apache</application> is still one of the most widely deployed web servers on the Internet. It is used extensively by the FreeBSD Project.
es_es: <package>www/apache24</package>: <application>Apache</application> continua siendo uno de los servidores web más usados en Internet. Es ampliamente utilizado por el proyecto FreeBSD.

source: <package>www/boa</package>: <application>Boa</application> is a single-tasking HTTP server. Unlike traditional web servers, it does not fork for each incoming connection, nor does it fork many copies of itself to handle multiple connections. Although, it should provide considerably great performance for purely static content.
es_es: <package>www/boa</package>: <application>Boa</application> es un servidor HTTP single-task. A diferencia de los servidores web tradicionales, su proceso no se divide por cada conexión entrante, ni crea varias copias de si mismo para manejar múltiples conexiones. Aunque, debería de proporcionar un rendimiento considerablemente grande para contenido puramente estático.

source: <package>www/cherokee</package>: <application>&gt;Cherokee</application> is a very fast, flexible and easy to configure web server. It supports the widespread technologies nowadays: FastCGI, SCGI, PHP, CGI, SSL/TLS encrypted connections, vhosts, users authentication, on the fly encoding and load balancing. It also generates <application>Apache</application> compatible log files.
es_es: <package>www/cherokee</package>: <application>&gt;Cherokee</application> es un servidor web muy rápido, flexible y fácil de configurar. Es compatible con las tecnologías más extendidas en la actualidad: FastCGI, SCGI, PHP, CGI, conexiones cifradas SSL/TLS, vhosts, autenticación de usuarios, codificación on the fly y balanceo de carga. También genera archivos log compatibles con <application>Apache</application>.

source: <package>www/lighttpd</package>: <application>lighttpd</application> is a secure, fast, compliant and very flexible web server which has been optimized for high-performance environments. It has a very low memory footprint compared to other web servers and takes care of cpu-load.
es_es: <package>www/lighttpd</package>: <application>lighttpd</application> es un servidor web seguro, rápido, compatible con los estándares y muy flexible que ha sido optimizado para entornos de alto rendimiento. Tiene un consumo de memoria muy bajo en comparación con otros servidores web, así como un bajo consumo de CPU.

source: <package>www/nginx</package>: <application>nginx</application> is a high performance edge web server with a low memory footprint and key features to build a modern and efficient web infrastructure. Features include a HTTP server, HTTP and mail reverse proxy, caching, load balancing, compression, request throttling, connection multiplexing and reuse, SSL offload and HTTP media streaming.
es_es: <package>www/nginx</package>: <application>nginx</application> es un servidor web de alto rendimiento con bajo consumo de memoria y características clave para crear una infraestructura web moderna y eficiente. Las características incluyen, un servidor HTTP, proxy inverso de HTTP y correo electrónico, almacenamiento en caché, balanceo de carga, compresión, limitación de solicitudes, multiplexación y reutilización de conexiones, descarga de SSL y streaming de medios por HTTP.

source: <package>www/thttpd</package>: If you are going to be serving a large amount of static content you may find that using an application such as <application>thttpd</application> is more efficient than others. It is also optimized for excellent performance on FreeBSD.
es_es: <package>www/thttpd</package>: Si va a ofrecer una gran cantidad de contenido estático, es posible que el uso de una aplicación como <application>thttpd</application> sea más eficiente que otras. También está optimizado para tener un excelente rendimiento en FreeBSD.

source: How to Mirror FreeBSD
es_es: Cómo replicar FreeBSD

source: Ok, now you know the requirements and how to offer the services, but not how to get it. :-) This section explains how to actually mirror the various parts of FreeBSD, what tools to use, and where to mirror from.
es_es: Ok, ahora que ya conoce los requisitos y cómo ofrecer los servicios, pero no cómo obtenerlos. :-) Esta sección explica cómo replicar las distintas partes de FreeBSD, qué herramientas usar y de dónde tiene que replicar.

source: Mirroring the FTP Site
es_es: Replicar el sitio FTP

source: The FTP area is the largest amount of data that needs to be mirrored. It includes the <emphasis>distribution sets</emphasis> required for network installation, the <emphasis>branches</emphasis> which are actually snapshots of checked-out source trees, the <emphasis>ISO Images</emphasis> to write CD-ROMs with the installation distribution, a live file system, and a snapshot of the ports tree. All of course for various FreeBSD versions, and various architectures.
es_es: El área FTP tiene la mayor cantidad de datos que deben ser reflejados. Incluye los <emphasis>conjuntos de la distribución (distribution sets)</emphasis> necesarios para la instalación en red, las <emphasis>ramas (branches)</emphasis> que son snapshots de los árboles del código fuente, las <emphasis>imagenes ISO</emphasis> para grabar CD-ROMs con la distribución de instalación, un sistema de archivos live y un snapshot del árbol de ports. Y claro, todo esto para las diversas versiones y arquitecturas de FreeBSD.

source: The best way to mirror the FTP area is <application>rsync</application>. You can install the port <package>net/rsync</package> and then use rsync to sync with your upstream host. <application>rsync</application> is already mentioned in <xref linkend="mirror-serv-rsync"/>. Since <application>rsync</application> access is not required, your preferred upstream site may not allow it. You may need to hunt around a little bit to find a site that allows <application>rsync</application> access.
es_es: La mejor manera de replicar el área FTP es con <application>rsync</application>. Puede instalar el port <package>net/rsync</package> y después utilizar rsync para sincronizar con el host upstream. <application>rsync</application> se ha mencionado en <xref linkend="mirror-serv-rsync"/>. Como el acceso <application>rsync</application> no es necesario, es posible que su sitio upstream preferido pueda no permitirlo. Es posible que deba buscar un poco para encontrar un sitio que permita el acceso <application>rsync</application>.

source: Since the number of <application>rsync</application> clients will have a significant impact on the server machine, most admins impose limitations on their server. For a mirror, you should ask the site maintainer you are syncing from about their policy, and maybe an exception for your host (since you are a mirror).
es_es: Dado que el número de clientes de <application>rsync</application> tendrá un impacto significativo en el rendimiento del servidor, la mayoría de los administradores imponen limitaciones en sus servidores. Para una réplica, debe preguntar al mantenedor del sitio con el que se está sincronizando sobre su política, y tal vez, pedir una excepción para su host (ya que usted es una réplica).

source: A command line to mirror FreeBSD might look like:
es_es: Un ejemplo en la línea de comandos para réplicar FreeBSD podría ser de la siguiente forma:

source: Consult the documentation for <application>rsync</application>, which is also available at <link xlink:href="http://rsync.samba.org/">http://rsync.samba.org/</link>, about the various options to be used with rsync. If you sync the whole module (unlike subdirectories), be aware that the module-directory (here "FreeBSD") will not be created, so you cannot omit the target directory. Also you might want to set up a script framework that calls such a command via <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es_es: Consulte la documentación de <application>rsync</application>, que está disponible en <link xlink:href="http://rsync.samba.org/">http://rsync.samba.org/</link>, sobre las diversas opciones que se utilizarán con rsync. Si sincroniza todo el módulo (a diferencia de los subdirectorios), tenga en cuenta que el directorio de módulos (aquí "FreeBSD") no se creará, por lo que no puede omitir el directorio de destino. También es posible que desee configurar un script que llame a este comando a través de <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: Mirroring the WWW Pages
es_es: Replicando las páginas WWW

source: The FreeBSD website should only be mirrored via <application>rsync</application>.
es_es: El sitio de FreeBSD debe ser replicado solo a través de <application>rsync</application>.

source: A command line to mirror the FreeBSD web site might look like:
es_es: Un ejemplo en la línea de comandos para réplicar el sitio web de FreeBSD podría ser de la siguiente forma:

source: Mirroring Packages
es_es: Replicando los paquetes
