Repository: doc-br/zanata
Catalog: articles/*/hubs.po
Languages: es_es

source: Due to very high requirements of bandwidth, storage and adminstration the FreeBSD Project has decided not to allow public mirrors of packages. For sites with lots of machines, it might be advantagous to run a caching HTTP proxy for the <citerefentry><refentrytitle>pkg</refentrytitle><manvolnum>8</manvolnum></citerefentry> process. Alternatively specific packages and their dependencies can be fetched by running something like the following:
es_es: Debido a las altas exigencias de ancho de banda, almacenamiento y administración, el proyecto FreeBSD ha decidido no permitir las réplicas públicas de paquetes. Para sitios con una gran cantidad de ordenadores, puede ser adecuado ejecutar un proxy HTTP que haga de caché para <citerefentry><refentrytitle>pkg</refentrytitle><manvolnum>8</manvolnum></citerefentry>. De forma alternativa, los paquetes específicos y sus dependencias se pueden descargar ejecutando el siguiente comando:

source: Once those packages have been fetched, the repository metadata must be generated by running:
es_es: Cuando estos paquetes se descarguen, los metadatos del repositorio se deben generar ejecutando:

source: Once the packages have been fetched and the metadata for the repository has been generated, serve the packages up to the client machines via HTTP. For additional information see the man pages for <citerefentry><refentrytitle>pkg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, specifically the <citerefentry><refentrytitle>pkg-repo</refentrytitle><manvolnum>8</manvolnum></citerefentry> page.
es_es: Una vez que los paquetes se han descargado y se han generado los metadatos del repositorio, envie los paquetes a los equipos cliente a través de HTTP. Para obtener información adicional, vea las páginas del maunal de <citerefentry><refentrytitle>pkg</refentrytitle><manvolnum>8</manvolnum></citerefentry>, en concreto, la página <citerefentry><refentrytitle>pkg-repo</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: How Often Should I Mirror?
es_es: ¿Con qué frecuencia debo actualizar el contenido de mi replica?

source: Every mirror should be updated at a minimum of once per day. Certainly a script with locking to prevent multiple runs happening at the same time will be needed to run from <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Since nearly every admin does this in their own way, specific instructions cannot be provided. It could work something like this:
es_es: Toda réplica debe actualizarse como mínimo una vez al día. Sin duda, un script que bloqueé ejecuciones multiples al mismo tiempo debe ser ejecutado desde <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Dado que casi todos los administradores hacen esto a su manera, no se pueden proporcionar instrucciones específicas. Pero podría ser algo como lo siguiente:

source: Put the command to run your mirroring application in a script. Use of a plain <command>/bin/sh</command> script is recommended.
es_es: Coloque el comando para ejecutar su réplica en un script. Se recomienda el uso de un script simple de <command>/bin/sh</command>.

source: Add some output redirections so diagnostic messages are logged to a file.
es_es: Agregue algunas redirecciones de salida para que los mensajes de diagnóstico se registren en un archivo.

source: Test if your script works. Check the logs.
es_es: Compruebe si el script funciona. Compruebe los logs.

source: Use <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>1</manvolnum></citerefentry> to add the script to the appropriate user's <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>5</manvolnum></citerefentry>. This should be a different user than what your FTP daemon runs as so that if file permissions inside your FTP area are not world-readable those files cannot be accessed by anonymous FTP. This is used to <quote>stage</quote> releases — making sure all of the official mirror sites have all of the necessary release files on release day.
es_es: Use <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>1</manvolnum></citerefentry> para agregar el script al <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>5</manvolnum></citerefentry> del usuario correspondiente. Este debe ser un usuario diferente al que se ejecuta en su demonio FTP, de esta forma, si los permisos de los archivos dentro de su área FTP están configurados de forma que no puedan ser leidos por todo el mundo, no se podrá acceder a esos archivos mediante FTP anónimo. Esto se utiliza para hacer el <quote>stage</quote> de una release — asegurándose de que todas las réplicas oficiales tengan todos los archivos necesarios el día del lanzamiento.

source: Here are some recommended schedules:
es_es: Aquí hay algunas programaciones recomendadas:

source: FTP fileset: daily
es_es: Conjunto de archivos FTP: diario

source: WWW pages: daily
es_es: Páginas WWW: diario

source: Where to Mirror From
es_es: De donde replicar

source: This is an important issue. So this section will spend some effort to explain the backgrounds. We will say this several times: under no circumstances should you mirror from <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem>.
es_es: Este es un tema importante. Así que esta sección hará un esfuerzo en explicar los antecedentes. Lo diremos varias veces: bajo ninguna circunstancia debe hacer una replica desde <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem>.

source: A few Words About the Organization
es_es: Algunas palabras sobre la organización

source: Mirrors are organized by country. All official mirrors have a DNS entry of the form <systemitem class="fqdomainname">ftpN.CC.FreeBSD.org</systemitem>. <emphasis>CC</emphasis> (i.e., country code) is the <emphasis>top level domain</emphasis> (TLD) of the country where this mirror is located. <emphasis>N</emphasis> is a number, telling that the host would be the <emphasis>Nth</emphasis> mirror in that country. (Same applies to <systemitem>wwwN.CC.FreeBSD.org</systemitem>, etc.) There are mirrors with no <emphasis>CC</emphasis> part. These are the mirror sites that are very well connected and allow a large number of concurrent users. <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem> is actually two machines, one currently located in Denmark and the other in the United States. It is <emphasis>NOT</emphasis> a master site and should never be used to mirror from. Lots of online documentation leads <quote>interactive</quote>users to <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem> so automated mirroring systems should find a different machine to mirror from.
es_es: Las replicas se organizan por país. Todas las replicas oficiales tienen una entrada DNS con el formato <systemitem class="fqdomainname">ftpN.CC.FreeBSD.org</systemitem>. <emphasis>CC</emphasis> (es decir, código de país) es el <emphasis>dominio de nivel superior</emphasis> (TLD) del país donde se encuentra esta replica. <emphasis>N</emphasis> es un número, el cual indicaque el host sería la replica <emphasis>Nth</emphasis> en ese país (Se aplica lo mismo a <systemitem>wwwN.CC.FreeBSD.org</systemitem>, etc.). Hay replicas sin la parte <emphasis>CC</emphasis>. Estas replicas están muy bien conectadas y permiten una gran cantidad de usuarios concurrentes. Actualmente, <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem> son en realidad dos ordenadores, uno ubicado actualmente en Dinamarca y el otro en Estados Unidos. <emphasis>NO</emphasis> es un sitio maestro y nunca debe ser replicado. Muchos documentos en línea conducen a los usuarios <quote>interactivos</quote> a <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem>, por lo que los sistemas automatizados de creación de replicas deben utilizar una máquina diferente de la que replicarse.

source: Additionally there exists a hierarchy of mirrors, which is described in terms of <emphasis>tiers</emphasis>. The master sites are not referred to but can be described as <emphasis>Tier-0</emphasis>. Mirrors that mirror from these sites can be considered <emphasis>Tier-1</emphasis>, mirrors of <emphasis>Tier-1</emphasis>-mirrors, are <emphasis>Tier-2</emphasis>, etc. Official sites are encouraged to be of a low <emphasis>tier</emphasis>, but the lower the tier the higher the requirements in terms as described in <xref linkend="mirror-requirements"/>. Also access to low-tier-mirrors may be restricted, and access to master sites is definitely restricted. The <emphasis>tier</emphasis>-hierarchy is not reflected by DNS and generally not documented anywhere except for the master sites. However, official mirrors with low numbers like 1-4, are usually <emphasis>Tier-1</emphasis> (this is just a rough hint, and there is no rule).
es_es: Además, existe una jerarquía de replicas, descrita en términos de <emphasis>capas (tiers)</emphasis>. No se hace referencia a los sitios maestros, pero se pueden describir como <emphasis>Tier-0</emphasis>. Las replicas que replican estos sitios se pueden considerar <emphasis>Tier-1</emphasis>, las replicas <emphasis>Tier-1</emphasis>, son <emphasis>Tier-2</emphasis>, etc. Se recomienda que los sitios oficiales tenga un <emphasis>tier</emphasis> bajo, pero cuanto más bajo el nivel, mayores los requisitos en los términos que se describen en <xref linkend="mirror-requirements"/>. Además, el acceso a las replicas de bajo nivel puede estar restringido, y el acceso a los sitios maestros está completamente restringido. La jerarquía de los <emphasis>tiers</emphasis> no se refleja en el DNS y, por lo general, no está documentado en ninguna parte, excepto en los sitios maestros. Sin embargo, las replicas oficiales con números bajos como 1-4, por lo general son <emphasis>Tier-1</emphasis> (esto es solo una sugerencia, y no una regla).

source: Ok, but Where Should I get the Stuff Now?
es_es: Ok, pero, ¿de dónde debo descargar los archivos?

source: Under no circumstances should you mirror from <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem>. The short answer is: from the site that is closest to you in Internet terms, or gives you the fastest access.
es_es: Bajo ninguna circunstancia debe crear una replica desde <systemitem class="fqdomainname">ftp.FreeBSD.org</systemitem>. La respuesta corta es: del sitio que esté más cerca de usted en términos de Internet o el cual le ofrezca el acceso más rápido.

source: I Just Want to Mirror from Somewhere!
es_es: ¡Solo quiero crear una réplica de algún sitio!

source: If you have no special intentions or requirements, the statement in <xref linkend="mirror-where-where"/> applies. This means:
es_es: Si no tiene intenciones o requisitos especiales, se aplica lo indicado en <xref linkend="mirror-where-where"/>. Esto significa:

source: Check for those which provide fastest access (number of hops, round-trip-times) and offer the services you intend to use (like <application>rsync</application>).
es_es: Busque aquellos que ofrezcan el acceso más rápido (número de saltos, tiempos de ida y vuelta) y ofrezca los servicios que desaa utilizar (como <application>rsync</application>).

source: Contact the administrators of your chosen site stating your request, and asking about their terms and policies.
es_es: Póngase en contacto con los administradores del sitio elegido, indicando su solicitud y preguntando acerca de sus términos y políticas.

source: Set up your mirror as described above.
es_es: Configure su replica como se describe anteriormente.

source: I am an Official Mirror, What is the Right Rite for Me?
es_es: Soy una replica oficial, ¿cuál es el sitio correcto para mí?

source: In general the description in <xref linkend="mirror-where-simple"/> still applies. Of course you may want to put some weight on the fact that your upstream should be of a low tier. There are some other considerations about <emphasis>official</emphasis> mirrors that are described in <xref linkend="mirror-official"/>.
es_es: En general, lo descrito en la <xref linkend="mirror-where-simple"/> todavía es aplicable. Por supuesto, es posible que desee darle algo de importancia al hecho de que su upstream deba ser de un tier bajo. Hay algunas otras consideraciones sobre las replicas <emphasis>oficiales</emphasis> que se describen en la <xref linkend="mirror-official"/>.

source: I Want to Access the Master Sites!
es_es: ¡Quiero acceder a los sitios maestros!

source: If you have good reasons and good prerequisites, you may want and get access to one of the master sites. Access to these sites is generally restricted, and there are special policies for access. If you are already an <emphasis>official</emphasis> mirror, this certainly helps you getting access. In any other case make sure your country really needs another mirror. If it already has three or more, ask the <quote>zone administrator</quote> (<email>hostmaster@CC.FreeBSD.org</email>) or <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hubs">FreeBSD mirror sites mailing lists</link> first.
es_es: Si tiene buenas razones y requisitos previos, puede que desee y quiera obtener acceso a uno de los sitios maestros. El acceso a estos sitios, generalmente, está restringido y existen políticas especiales para el acceso. Si ya es una replica <emphasis>oficial</emphasis>, esto seguramente le ayudará a obtener acceso. En cualquier otro caso, asegúrese de que su país realmente necesita otra replica. Si ya tiene tres o más, pregunte primero al <quote>administrador de la zona</quote> (<email>hostmaster@CC.FreeBSD.org</email>) o en <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hubs">las listas de correo de las replicasa de FreeBSD</link>.

source: Whoever helped you become, an <emphasis>official</emphasis> should have helped you gain access to an appropriate upstream host, either one of the master sites or a suitable Tier-1 site. If not, you can send email to <email>mirror-admin@FreeBSD.org</email> to request help with that.
es_es: Quienquiera que le haya ayudado a convertirse en una replica oficial, un <emphasis>oficial (official)</emphasis> debería de haberle ayudado a obtener acceso a un host upstream adecuado, ya sea uno de los sitios maestros o a un Tier-1 adecuado. De lo contrario, puede envair un correo electrónico solicitando ayuda a <email>mirror-admin@FreeBSD.org</email>.

source: There is one master site for the FTP fileset.
es_es: Hay un sitio maestro para el conjunto de archivos FTP.

source: This is the master site for the FTP fileset.
es_es: Este es el sitio maestro para el conjunto de archivos FTP.

source: <systemitem>ftp-master.FreeBSD.org</systemitem> provides <application>rsync</application> access, in addition to FTP. Refer to <xref linkend="mirror-ftp-rsync"/>.
es_es: <systemitem>ftp-master.FreeBSD.org</systemitem> proporciona acceso <application>rsync</application>, además de FTP. Consulte la <xref linkend="mirror-ftp-rsync"/>.

source: Mirrors are also encouraged to allow <application>rsync</application> access for the FTP contents, since they are <emphasis>Tier-1</emphasis>-mirrors.
es_es: También se recomienda que las replicas permitan el acceso <application>rsync</application> para los contenidos FTP, ya que son replicas <emphasis>Tier-1</emphasis>.

source: Official Mirrors
es_es: Replicas oficiales

source: Official mirrors are mirrors that
es_es: Las replicas oficiales, son replicas que cumplen los siguientes puntos:

source: a) have a <systemitem>FreeBSD.org</systemitem> DNS entry (usually a CNAME).
es_es: a) disponen de una entrada DNS <systemitem>FreeBSD.org</systemitem> (normalmente, un CNAME).

source: b) are listed as an official mirror in the FreeBSD documentation (like handbook).
es_es: b) son listados como una replica oficial en la documentación de FreeBSD (como el handbook).

source: So far to distinguish official mirrors. Official mirrors are not necessarily <emphasis>Tier-1</emphasis>-mirrors. However you probably will not find a <emphasis>Tier-1</emphasis>-mirror, that is not also official.
es_es: Hasta ahora, para distinguir las replicas oficiales. Las replicas oficiales no tienen porque ser necesariamente replicas-<emphasis>Tier-1</emphasis>. Sin embargo, es muy probable que no encuentre una replica-<emphasis>Tier-1</emphasis> que no sea oficial.

source: Special Requirements for Official (tier-1) Mirrors
es_es: Requisitos especificos para las replicas oficiales (tier-1)

source: It is not so easy to state requirements for all official mirrors, since the project is sort of tolerant here. It is more easy to say, what <emphasis>official tier-1 mirrors</emphasis> are required to. All other official mirrors can consider this a big <emphasis>should</emphasis>.
es_es: No es tan sencillo establecer los requisitos para todas las replicas oficiales, ya que el proyecto es bastante tolerante en este punto. Es más sencillo decir qué se requiere de una <emphasis>replica oficial tier-1</emphasis>. El resto de replicas oficiales deberían de considerar esto como un gran <emphasis>debemos de cumplir</emphasis>.

source: Tier-1 mirrors are required to:
es_es: Las replicas tier-1 están obligadas a:

source: carry the complete fileset
es_es: disponer del conjunto de archivos completo

source: allow access to other mirror sites
es_es: permitir el acceso a otras replicas

source: provide <application>FTP</application> and <application>rsync</application> access
es_es: disponer de acceso <application>FTP</application> y <application>rsync</application>

source: Furthermore, admins should be subscribed to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hubs">FreeBSD mirror sites mailing lists</link>. See <link xlink:href="https://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">this link</link> for details, how to subscribe.
es_es: Además, los administradores deben de estar suscritos a la <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-hubs">lista de correo de las replicas de FreeBSD</link>. Consulte <link xlink:href="https://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">este enlace</link> para obtener detalles sobre cómo suscribirse.

source: It is <emphasis>very</emphasis> important for a hub administrator, especially Tier-1 hub admins, to check the <link xlink:href="https://www.FreeBSD.org/releng/">release schedule</link> for the next FreeBSD release. This is important because it will tell you when the next release is scheduled to come out, and thus giving you time to prepare for the big spike of traffic which follows it.
es_es: Es <emphasis>muy</emphasis> importante que el administrador de la replica, especialmente los administradores de replicas Tier-1, verifique el <link xlink:href="https://www.FreeBSD.org/releng/">calendario de lanzamientos</link> para el próximo lanzamiento de FreeBSD. Esto es importante porque le dirá cuándo será el próximo lanzamiento, y así tendrá tiempo para prepararse para el gran pico de tráfico que vendrá.

source: It is also important that hub administrators try to keep their mirrors as up-to-date as possible (again, even more crucial for Tier-1 mirrors). If Mirror1 does not update for a while, lower tier mirrors will begin to mirror old data from Mirror1 and thus begins a downward spiral... Keep your mirrors up to date!
es_es: También es importante que los administradores de las replicas intenten mantenerlas lo más actualizas posible (esto es crucial para las replicas Tier-1). Si el Mirror1 no se actualiza por un tiempo, las replicas de tiers menores comenzarán a replicar los datos antiguos del Mirror1 y, por lo tanto, comenzarán a caer en espiral... ¡Mantenga sus replicas actualizadas!

source: How to Become Official Then?
es_es: ¿Entonces, cómo convertirse en una replica oficial?

source: We are not accepting any new mirrors at this time.
es_es: No estamos aceptando nuevas replicas en este momento.

source: Some Statistics from Mirror Sites
es_es: Algunas estadísticas de las replicas

source: Here are links to the stat pages of your favorite mirrors (aka the only ones who feel like providing stats).
es_es: Aquí dispone de enlaces a las páginas de estadísticas de sus replicas favoritas (también conocidas como las únicas que desean proporcionarlas).

source: FTP Site Statistics
es_es: Estadísticas de los sitios FTP

source: ftp.is.FreeBSD.org - <email>hostmaster@is.FreeBSD.org</email> - <link xlink:href="http://www.rhnet.is/status/draupnir/draupnir.html"> (Bandwidth)</link> <link xlink:href="http://www.rhnet.is/status/ftp/ftp-notendur.html">(FTP processes)</link> <link xlink:href="http://www.rhnet.is/status/ftp/http-notendur.html">(HTTP processes)</link>
es_es: ftp.is.FreeBSD.org - <email>hostmaster@is.FreeBSD.org</email> - <link xlink:href="http://www.rhnet.is/status/draupnir/draupnir.html"> (Ancho de banda)</link> <link xlink:href="http://www.rhnet.is/status/ftp/ftp-notendur.html">(procesos FTP)</link> <link xlink:href="http://www.rhnet.is/status/ftp/http-notendur.html">(procesos HTTP)</link>

source: ftp2.ru.FreeBSD.org - <email>mirror@macomnet.ru</email> - <link xlink:href="http://mirror.macomnet.net/mrtg/mirror.macomnet.net_195.128.64.25.html">(Bandwidth)</link> <link xlink:href="http://mirror.macomnet.net/mrtg/mirror.macomnet.net_proc.html">(HTTP and FTP users)</link>
es_es: ftp2.ru.FreeBSD.org - <email>mirror@macomnet.ru</email> - <link xlink:href="http://mirror.macomnet.net/mrtg/mirror.macomnet.net_195.128.64.25.html">(Ancho de banda)</link> <link xlink:href="http://mirror.macomnet.net/mrtg/mirror.macomnet.net_proc.html">(usuarios HTTP y FTP)</link>
