Repository: doc-br/zanata
Catalog: articles/*/leap-seconds.po
Languages: nb_no

# _
source: translator-credits
nb_no: Lars Skogstad (Norway) - <n3c@n3c.no> - 2019

source: FreeBSD Support for Leap Seconds
nb_no: FreeBSD Support vedrørende Skuddsekund

source: Introduction
nb_no: Introduksjon

source: A <emphasis>leap second</emphasis> is an one second adjustment made at specific times of year to UTC to synchronize atomic time scales with variations in the rotation of the Earth. This article describes how FreeBSD interacts with leap seconds.
nb_no: Et <emphasis>skuddsekund (leap second)</emphasis> er ett ekstra sekund som settes inn i tidsregningen UTC for å sikre at klokkeslettet passer til Jordens rotasjon. Denne artiklen forklarer hvordan FreeBSD behandler implementering av skuddsekund.

source: As of this writing, the next leap second will occur at 2015-Jun-30 23:59:60 UTC. This leap second will occur during a business day for North and South America and the Asia/Pacific region.
nb_no: Det vil ikke bli lagt til skuddsekund i slutten av Juni 2019. Forskjellen mellom Coordinated Universal Time UT og International Atomic Time TAI er: Fra 2017 Januar 1, 0t UTC, inntil videre beskjed : UTC-TAI = -37 s

source: Leap seconds are announced by <link xlink:href="http://datacenter.iers.org/"><acronym>IERS</acronym></link> on <link xlink:href="http://datacenter.iers.org/web/guest/bulletins/-/somos/5Rgv/product/16">Bulletin C</link>.
nb_no: Skuddsekund blir annonsert via <link xlink:href="http://datacenter.iers.org/"><acronym>IERS</acronym></link> på <link xlink:href="https://www.iers.org/SharedDocs/News/EN/BulletinC.html">Bulletin C</link>.

source: Standard leap second behavior is described in <link xlink:href="https://tools.ietf.org/html/rfc7164#section-3">RFC 7164</link>. Also see <citerefentry><refentrytitle>time2posix</refentrytitle><manvolnum>3</manvolnum></citerefentry>.
nb_no: Standard skuddsekund virkemåte er beskrevet i <link xlink:href="https://tools.ietf.org/html/rfc7164#section-3">RFC 7164</link>. Sjekk ut <citerefentry><refentrytitle>time2posix</refentrytitle><manvolnum>3</manvolnum></citerefentry> for mer informasjon.

source: Default Leap Second Handling on FreeBSD
nb_no: Standard Skuddsekund og dens virkemåte i FreeBSD

source: The easiest way to handle leap seconds is with the <acronym>POSIX</acronym> time rules FreeBSD uses by default, combined with <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-ntp.html"><acronym>NTP</acronym></link>. When <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> is running and the time is synchronized with upstream <acronym>NTP</acronym> servers that handle leap seconds correctly, the leap second will cause the system time to automatically repeat the last second of the day. No other adjustments are necessary.
nb_no: Den enkleste måten å behandle skuddsekund på er med <acronym>POSIX</acronym> tids regler. FreeBSD bruker det sammen med <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-ntp.html"><acronym>NTP</acronym></link> som en standard. Når <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> kjører og tiden er sykronisert med motstrøms<acronym>NTP</acronym> som behandler skuddsekund korrekt så vil systemet automatisk repetere det siste sekundet på slutten av dagen. Ingen andre justeringer er nødvendig.

source: If the upstream <acronym>NTP</acronym> servers do not handle leap seconds correctly, <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> will step the time by one second after the errant upstream server has noticed and stepped itself.
nb_no: Hvis motstrøms NTP servere ikke behandler skuddsekund korrekt, så vil <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> justere tiden ett sekund etter den feilende serveren har lagt merke til dette og justerer selv.

source: If <acronym>NTP</acronym> is not being used, manual adjustment of the system clock will be required after the leap second has passed.
nb_no: Hvis <acronym>NTP</acronym> ikke er i bruk så er det behov for manuell justering etter at skuddsekundet har passert.

source: Cautions
nb_no: Advarsel

source: Leap seconds are inserted at the same instant all over the world: <acronym>UTC</acronym> midnight. In Japan that is mid-morning, in the Pacific mid-day, in the Americas late afternoon, and in Europe at night.
nb_no: Skuddsekund blir implementert på samme tid over hele verden.<acronym>UTC</acronym> midnatt. I Japan så er det litt utpå morgenkvisten, i Stillehavet midt på dagen, Amerika sent på ettermiddagen og i Europa på natters tid.

source: We believe and expect that FreeBSD, if provided correct and stable <acronym>NTP</acronym> service, will work as designed during this leap second, as it did during the previous ones.
nb_no: Vi tror og forventer at dersom FreeBSD leverer en korrekt og stabil <acronym>NTP</acronym> tjeneste, så vil alt fungere som det skal når skuddsekund skjer. Slik som det alltid har gjort tidligere.

source: However, we caution that practically no applications have ever asked the kernel about leap seconds. Our experience is that, as designed, leap seconds are essentially a replay of the second before the leap second, and this is a surprise to most application programmers.
nb_no: Men vi har lagt merke til at det er fryktelig sjeldent eller aldri at programmer spør kernel om skuddsekund. Vår erfaring er at som utviklet så er skuddsekund en reprise av sekundet før skuddsekundet og dette kommer ofte som en overraskelse på programutviklere.

source: Other operating systems and other computers may or may not handle the leap-second the same way as FreeBSD, and systems without correct and stable <acronym>NTP</acronym> service will not know anything about leap seconds at all.
nb_no: Andre operativ system og andre datamaskiner vil eller ikke behandle skuddsekund på samme måte som FreeBSD gjør. Et system uten korrekt og stabil <acronym>NTP</acronym> tjeneste vil ikke kjenne til begrepet skuddsekund i det hele tatt.

source: It is not unheard of for computers to crash because of leap seconds, and experience has shown that a large fraction of all public <acronym>NTP</acronym> servers might handle and announce the leap second incorrectly.
nb_no: Det er ikke uvanlig at datamaskiner kan kræsje eller få nedetid på grunn av skuddsekund, erfaring tilsier at en stor andel av <acronym>NTP</acronym> servere kan behandle skuddsekund feil.

source: Please try to make sure nothing horrible happens because of the leap second.
nb_no: Vær så snill og prøv å se til at ingenting problematisk skjer på grunn av skuddsekund.

source: It is possible to test whether a leap second will be used. Due to the nature of <acronym>NTP</acronym>, the test might work up to 24 hours before the leap second. Some major reference clock sources only announce leap seconds one hour ahead of the event. Query the <acronym>NTP</acronym> daemon:
nb_no: Det er mulig å teste om skuddsekund vill bli brukt. På grunn av hvordan <acronym>NTP</acronym> fungerer så kan en slik test ofte bruke opptil 24 timer før skuddsekund skjer. Noen store klokke kilder annonserer kun skuddsekund en time før det faktisk skjer. Send en forespørsel i output til <acronym>NTP</acronym> daemon:

source: Output that includes <literal>leap_add_sec</literal> indicates proper support of the leap second. Before the 24 hours leading up to the leap second, or after the leap second has passed, <literal>leap_none</literal> will be shown.
nb_no: Output som inkluderer <literal>leap_add_sec</literal> indikerer riktig support for skuddsekund. Før det har gått 24 timer opptil skuddsekund eller etter skuddsekundet har skjedd så vil <literal>leap_none</literal> bli vist.

source: Conclusion
nb_no: Konklusjon

source: In practice, leap seconds are usually not a problem on FreeBSD. We hope that this overview helps clarify what to expect and how to make the leap second event proceed more smoothly.
nb_no: Sånn praktisk sett så er ikke skuddsekund kjent som et problem i FreeBSD. Vi håper at denne oversikten vil gi deg en oversikt på hva du kan forvente og hvordan du kan gjennomføre dette mest mulig smertefritt.
