Repository: doc-br/zanata
Catalog: articles/*/nanobsd.po
Languages: nb_no, zh_cn

source: To install new image onto the running <application>NanoBSD</application> system, it is possible to use either the <filename>updatep1</filename> or <filename>updatep2</filename> script located in the <filename>/root</filename> directory, depending from which partition is running the current system.
nb_no: For å installere nytt bilde på det kjørende <application>NanoBSD</application>-systemet, er det mulig å bruke <filename>updatep1</filename> eller <filename>updatep2</filename>-skriptet som ligger i <filename>/root</filename> katalogen, avhengig av hvilken partisjon som kjører det gjeldende systemet.
zh_cn: 要在正在运行的 <application>NanoBSD</application> 系统中安装新的映像， 可以使用位于 <filename>/root</filename> 目录的 <filename>updatep1</filename> 或 <filename>updatep2</filename> 脚本， 具体使用哪一个脚本， 取决于正在运行的系统位于那个分区。

source: According to which services are available on host serving new <application>NanoBSD</application> image and what type of transfer is preferred, it is possible to examine one of these three ways:
nb_no: I henhold til hvilke tjenester som er tilgjengelige på verten som serverer nytt <application>NanoBSD</application>-bilde og hvilken type overføring som er foretrukket, er det mulig å undersøke en av disse tre måtene:
zh_cn: 随时提供新 <application>NanoBSD</application> 映像所提供的服务， 以及采用的传输方法的不同， 您可以参考并使用下列三种方式之一：

source: Using <citerefentry><refentrytitle>ftp</refentrytitle><manvolnum>1</manvolnum></citerefentry>
nb_no: Bruke <citerefentry><refentrytitle>ftp</refentrytitle><manvolnum>1</manvolnum></citerefentry>
zh_cn: 使用 <citerefentry><refentrytitle>ftp</refentrytitle><manvolnum>1</manvolnum></citerefentry>

source: If the transfer speed is in first place, use this example:
nb_no: Hvis overføringshastigheten er i utgangspunktet, bruk dette eksemplet:
zh_cn: 如果传输速度是第一要务， 采用下面的例子：

source: Using <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>
nb_no: Bruke <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>
zh_cn: 使用 <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>

source: If a secure transfer is preferred, consider using this example:
nb_no: Hvis du foretrekker en sikker overføring, kan du vurdere å bruke dette eksemplet:
zh_cn: 如果更倾向于安全传输， 应参考下面的例子：

source: Using <citerefentry><refentrytitle>nc</refentrytitle><manvolnum>1</manvolnum></citerefentry>
nb_no: Bruke <citerefentry><refentrytitle>nc</refentrytitle><manvolnum>1</manvolnum></citerefentry>
zh_cn: 使用 <citerefentry><refentrytitle>nc</refentrytitle><manvolnum>1</manvolnum></citerefentry>

source: Try this example if the remote host is not running neither <citerefentry><refentrytitle>ftpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> or <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> service:
nb_no: Prøv dette eksemplet hvis den eksterne verten ikke kjører <citerefentry><refentrytitle>ftpd</refentrytitle><manvolnum>8</manvolnum></citerefentry> eller <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> tjeneste:
zh_cn: 如果远程主机既不提供 <citerefentry><refentrytitle>ftp</refentrytitle><manvolnum>1</manvolnum></citerefentry> 服务， 也不提供 <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> 服务：

source: At first, open a TCP listener on host serving the image and make it send the image to client:
nb_no: Først åpner du en TCP-lytter på verten som serverer bildet og får det til å sende bildet til klienten:
zh_cn: 开始时， 在提供映像的主机上开启 TCP 监听， 并令其将映像文件发给客户机：

source: Make sure that the used port is not blocked to receive incoming connections from <application>NanoBSD</application> host by firewall.
nb_no: Forsikre deg om at den brukte porten ikke er blokkert for å motta innkommende tilkoblinger fra <application>NanoBSD</application> vert med brannmur.
zh_cn: 请确认您所使用的端口没有通过防火墙阻止来自 <application>NanoBSD</application> 客户机的联接请求。

source: Connect to the host serving new image and execute <filename>updatep1</filename> script:
nb_no: Koble til verten som serverer nytt bilde og kjør <filename>updatep1</filename> skript:
zh_cn: 连接到提供新映像服务的主机， 并执行 <filename>updatep1</filename> 脚本：

source: NanoBSD Howto
zh_cn: 如何使用 NanoBSD
