Repository: doc-br/zanata
Catalog: articles/*/nanobsd.po
Languages: nb_no, zh_cn

# _
source: translator-credits
nb_no: Lars Skogstad - n3c@n3c.no

source: Introduction to NanoBSD
nb_no: Introduksjon til NanoBSD
zh_cn: NanoBSD 简介

source: FreeBSD is a registered trademark of the FreeBSD Foundation.
nb_no: FreeBSD er et registrert varemerke til the FreeBSD Foundation.
zh_cn: FreeBSD 是 FreeBSD 基金会的注册商标

source: Many of the designations used by manufacturers and sellers to distinguish their products are claimed as trademarks. Where those designations appear in this document, and the FreeBSD Project was aware of the trademark claim, the designations have been followed by the <quote>™</quote> or the <quote>®</quote> symbol.
nb_no: Mange av betegnelsene som brukes av produsenter og selgere for å skille produktene deres, hevdes som varemerker. Der de betegnelsene vises i dette dokumentet, og FreeBSD Project var klar over varemerkekravet, har betegnelsene blitt fulgt av <quote>™</quote> or the <quote>®</quote> symbolet.
zh_cn: 许多制造商和经销商使用一些称为商标的图案或文字设计来彰显自己的产品。 本文档中出现的， 为 FreeBSD Project 所知晓的商标，后面将以 <quote>™</quote> 或 <quote>®</quote> 符号来标注。

source: This document provides information about the <application>NanoBSD</application> tools, which can be used to create FreeBSD system images for embedded applications, suitable for use on a Compact Flash card (or other mass storage medium).
nb_no: Dette dokumentet inneholder informasjon om <application>NanoBSD</application>-verktøyene, som kan brukes til å lage FreeBSD-systembilder for innebygde applikasjoner, egnet for bruk på et Compact Flash-kort (eller annet masselagringsmedium).
zh_cn: 这篇文档提供了关于 <application>NanoBSD</application> 工具的介绍信息， 这一工具可以用来创建用于嵌入式应用的 FreeBSD 系统映像， 以适应存放到袖珍闪存 (Compact Flash) 卡 (或其它大容量存储介质) 上的需要。

source: <application>NanoBSD</application> is a tool currently developed by Poul-Henning Kamp <email>phk@FreeBSD.org</email>. It creates a FreeBSD system image for embedded applications, suitable for use on a Compact Flash card (or other mass storage medium).
nb_no: <application>NanoBSD</application> er et verktøy som for øyeblikket er utviklet av Poul-Henning Kamp <email>phk@FreeBSD.org</email>. Det skaper et FreeBSD-systembilde for innebygde applikasjoner, egnet for bruk på et Compact Flash-kort (eller annet masselagringsmedium).
zh_cn: <application>NanoBSD</application> 是 Poul-Henning Kamp <email>phk@FreeBSD.org</email> 目前正在开发的一项工具。 它可以用来创建用于嵌入式应用的 FreeBSD 系统映像， 以便配合袖珍闪存 (Compact Flash) 卡 (或其他大容量存储介质) 使用。

source: It can be used to build specialized install images, designed for easy installation and maintenance of systems commonly called <quote>computer appliances</quote>. Computer appliances have their hardware and software bundled in the product, which means all applications are pre-installed. The appliance is plugged into an existing network and can begin working (almost) immediately.
nb_no: Den kan brukes til å lage spesialiserte installasjonsbilder, designet for enkel installasjon og vedlikehold av systemer som ofte kalles <quote>datamaskinapparater</quote>. Datamaskiner er utstyrt med maskinvaren og programvaren i produktet, noe som betyr at alle applikasjoner er forhåndsinstallert. Apparatet er koblet til et eksisterende nettverk og kan begynne å fungere (nesten) umiddelbart.
zh_cn: 这一工具也可以用来构建定制的安装映像， 以简化通常称为 <quote>计算设备 (computer appliances)</quote> 的系统的安装和维护工作。 计算设备通常在产品中将捆绑硬件和软件， 或者换言之， 所有的应用程序都是预先装好的。 这些设备可以直接插到暨存的网络中， 并 (几乎是) 立即投入使用。

source: The features of <application>NanoBSD</application> include:
nb_no: Funksjonene til <application>NanoBSD</application> inkluderer:
zh_cn: <application>NanoBSD</application> 提供的功能包括：

source: Ports and packages work as in FreeBSD — Every single application can be installed and used in a <application>NanoBSD</application> image, the same way as in FreeBSD.
nb_no: Porter og pakker fungerer som i FreeBSD - Hvert enkelt program kan installeres og brukes i et <application>NanoBSD</application>-bilde, på samme måte som i FreeBSD.
zh_cn: 可以和 FreeBSD 一样使用 Ports 和预编译包── 所有的应用程序都可以在 <application>NanoBSD</application> 映像中直接使用， 而方式与 FreeBSD 完全一样。

source: No missing functionality — If it is possible to do something with FreeBSD, it is possible to do the same thing with <application>NanoBSD</application>, unless the specific feature or features were explicitly removed from the <application>NanoBSD</application> image when it was created.
nb_no: ngen manglende funksjonalitet - Hvis det er mulig å gjøre noe med FreeBSD, er det mulig å gjøre det samme med <application>NanoBSD</application>, med mindre den spesifikke funksjonen eller funksjonene eksplisitt ble fjernet fra <application>NanoBSD</application> bilde da det ble opprettet.
zh_cn: 不减少功能 ── 能够使用 FreeBSD 做的任何工作， 都可以在 <application>NanoBSD</application> 中使用， 除非您在创建 <application>NanoBSD</application> 映像时， 明确地删去它们。

source: Everything is read-only at run-time — It is safe to pull the power-plug. There is no necessity to run <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> after a non-graceful shutdown of the system.
nb_no: Alt er skrivebeskyttet under kjøretid - Det er trygt å trekke i støpselet. Det er ingen nødvendighet å kjøre <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry> etter en ikke-grasiøs avslutning av systemet.
zh_cn: 所有对象在运行时均是只读的 ── 可以安全地拔掉电源插销。 在系统非正常关闭之后， 无需运行 <citerefentry><refentrytitle>fsck</refentrytitle><manvolnum>8</manvolnum></citerefentry>。

source: Easy to build and customize — Making use of just one shell script and one configuration file it is possible to build reduced and customized images satisfying any arbitrary set of requirements.
nb_no: Lett å bygge og tilpasse - Ved å bruke bare ett skallskript og en konfigurasjonsfil er det mulig å lage reduserte og tilpassede bilder som tilfredsstiller ethvert vilkårlig sett med krav.
zh_cn: 便于联编和定制 ── 只需使用一个 shell 脚本和一个配置文件， 您可以很容易地裁减和定制适于任意需求的映像。

source: The Design of NanoBSD
nb_no: Designet til NanoBSD
zh_cn: NanoBSD 的设计

source: Once the image is present on the medium, it is possible to boot <application>NanoBSD</application>. The mass storage medium is divided into three parts by default:
nb_no: Når bildet er tilstede på mediet, er det mulig å starte <application>NanoBSD</application>. Masselagringsmediet er delt inn i tre deler som standard:
zh_cn: 一旦将映像存入介质， 就可以用它来引导 <application>NanoBSD</application> 了。 默认情况下， 大容量存储器会划分为三个区：

source: Two image partitions: <literal>code#1</literal> and <literal>code#2</literal>.
nb_no: To bilde partisjoner: <literal>code#1</literal> og <literal>code#2</literal>.
zh_cn: 两个映像区： <literal>code#1</literal> 和 <literal>code#2</literal>。

source: The configuration file partition, which can be mounted under the <filename>/cfg</filename> directory at run time.
nb_no: Konfigurasjonsfilpartisjonen, som kan monteres under katalogen <filename>/cfg</filename> på kjøretid.
zh_cn: 一个配置文件区， 运行环境中， 可以将其挂接到 <filename>/cfg</filename> 目录下。

source: These partitions are normally mounted read-only.
nb_no: Disse partisjonene er normalt montert skrivebeskyttet.
zh_cn: 这些分区默认情况下以只读方式挂接。

source: The <filename>/etc</filename> and <filename>/var</filename> directories are <citerefentry><refentrytitle>md</refentrytitle><manvolnum>4</manvolnum></citerefentry> (malloc) disks.
nb_no: <filename>/etc</filename> og <filename>/var</filename> katalogene er<citerefentry><refentrytitle>md</refentrytitle><manvolnum>4</manvolnum></citerefentry> (malloc) disk.
zh_cn: <filename>/etc</filename> 和 <filename>/var</filename> 目录均为 <citerefentry><refentrytitle>md</refentrytitle><manvolnum>4</manvolnum></citerefentry> (malloc) 盘。

source: The configuration file partition persists under the <filename>/cfg</filename> directory. It contains files for <filename>/etc</filename> directory and is briefly mounted read-only right after the system boot, therefore it is required to copy modified files from <filename>/etc</filename> back to the <filename>/cfg</filename> directory if changes are expected to persist after the system restarts.
nb_no: Konfigurasjonsfilpartisjonen vedvarer under katalogen <filename>/cfg</filename>. Den inneholder filer for <filename>/etc</filename> katalogen og er kortmontert skrivebeskyttet rett etter systemstart, derfor er det påkrevd å kopiere endrede filer fra <filename>/etc</filename> tilbake til <filename>/cfg</filename> katalog hvis endringer forventes å vedvare etter at systemet starter på nytt.
zh_cn: 配置文件分区保存在 <filename>/cfg</filename> 目录。 它包含了用于 <filename>/etc</filename> 目录的文件， 在启动之后暂时以只读方式挂接。 因此， 在需要从 <filename>/etc</filename> 向 <filename>/cfg</filename> 目录复制所进行的、 希望在重启时保持不变的配置时， 需要进行一些额外的操作。

source: Making Persistent Changes to <filename>/etc/resolv.conf</filename>
nb_no: Foreta vedvarende endringer til <filename>/etc/resolv.conf</filename>
zh_cn: 在 <filename>/etc/resolv.conf</filename> 中进行需要保持的修改

source: The partition containing <filename>/cfg</filename> should be mounted only at boot time and while overriding the configuration files.
nb_no: Partisjonen som inneholder <filename>/cfg</filename> skal bare monteres ved starttid og samtidig overstyre konfigurasjonsfilene.
zh_cn: 只有在系统启动过程中， 以及需要修改配置文件的场合， 才需要挂接包含 <filename>/cfg</filename> 的那个分区。

source: Keeping <filename>/cfg</filename> mounted at all times is not a good idea, especially if the <application>NanoBSD</application> system runs off a mass storage medium that may be adversely affected by a large number of writes to the partition (like when the filesystem syncer flushes data to the system disks).
nb_no: Å holde <filename>/cfg</filename> montert til enhver tid er ikke en god idé, spesielt hvis <application>NanoBSD</application>-systemet kjører av et masselagringsmedium som kan påvirkes negativt av et stort antall skriver til partisjonen (som når filsystemssynkronen skyller data til systemets disker).
zh_cn: 在任何时候都保持挂接 <filename>/cfg</filename> 不是一个好主意， 特别是当您把 <application>NanoBSD</application> 放在不适合进行大量写操作的分区时 (由于文件系统的同步进程会定期向系统盘写一些数据)。

source: Building a NanoBSD Image
nb_no: Bygge et NanoBSD avbildning
zh_cn: 构建 NanoBSD 映像

source: A <application>NanoBSD</application> image is built using a simple <filename>nanobsd.sh</filename> shell script, which can be found in the <filename><replaceable>/usr</replaceable>/src/tools/tools/nanobsd</filename> directory. This script creates an image, which can be copied on the storage medium using the <citerefentry><refentrytitle>dd</refentrytitle><manvolnum>1</manvolnum></citerefentry> utility.
nb_no: Et <application>NanoBSD</application>-bilde er bygget ved hjelp av et enkelt <filename>nanobsd.sh</filename> shell-skript, som du finner i <filename><replaceable>/usr</replaceable>/src/tools/tools/nanobsd</filename> katalogen. Dette skriptet lager et bilde som kan kopieres på lagringsmediet ved å bruke verktøyet <citerefentry><refentrytitle>dd</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
zh_cn: <application>NanoBSD</application> 映像是通过使用非常简单的 <filename>nanobsd.sh</filename> shell 脚本来构建的， 这个脚本可以在 <filename><replaceable>/usr</replaceable>/src/tools/tools/nanobsd</filename> 目录中找到。 这个脚本建立的映像文件， 可以用 <citerefentry><refentrytitle>dd</refentrytitle><manvolnum>1</manvolnum></citerefentry> 工具复制到存储介质上。

source: The necessary commands to build a <application>NanoBSD</application> image are:
nb_no: De nødvendige kommandoene for å lage et <application>NanoBSD</application>-bilde er:
zh_cn: 构建 <application>NanoBSD</application> 映像所需的命令是：

source: Change the current directory to the base directory of the <application>NanoBSD</application> build script.
nb_no: Endre den gjeldende katalogen til basekatalogen til <application>NanoBSD</application> bygge script..
zh_cn: 进入 <application>NanoBSD</application> 构建脚本的主目录。

source: Start the build process.
nb_no: Start byggeprosessen
zh_cn: 开始构建过程。

source: Change the current directory to the place where the built images are located.
nb_no: Endre gjeldende katalog til stedet der de innebygde bildene befinner seg.
zh_cn: 进入构建好的映像文件所在的目录。

source: Install <application>NanoBSD</application> onto the storage medium.
nb_no: Installer <application>NanoBSD</application> på lagrings mediumet.
zh_cn: 在存储介质上安装 <application>NanoBSD</application>。

source: Customizing a NanoBSD Image
nb_no: Tilpasse en NanoBSD avbildning
zh_cn: 定制 NanoBSD 映像

source: This is probably the most important and most interesting feature of <application>NanoBSD</application>. This is also where you will be spending most of the time when developing with <application>NanoBSD</application>.
nb_no: Dette er sannsynligvis den viktigste og mest interessante egenskapen til <application>NanoBSD</application>. Det er også her du vil tilbringe mesteparten av tiden når du utvikler med <application>NanoBSD</application>.
zh_cn: 这可能是 <application>NanoBSD</application> 最为重要， 同时也是您最感兴趣的功能。 同时， 您在开发 <application>NanoBSD</application> 应用时， 这也是相当耗时的过程。

source: Invocation of the following command will force the <filename>nanobsd.sh</filename> to read its configuration from <filename>myconf.nano</filename> located in the current directory:
nb_no: Påkalling av følgende kommando vil tvinge <filename>nanobsd.sh</filename> til å lese konfigurasjonen fra <filename>myconf.nano</filename> som ligger i den gjeldende katalogen:
zh_cn: 执行下面的命令将使 <filename>nanobsd.sh</filename> 从当前目录中的 <filename>myconf.nano</filename> 文件读取配置：

source: Customization is done in two ways:
nb_no: Tilpasning gjøres på to måter:
zh_cn: 定制过程包含两步：

source: Configuration options
nb_no: Konfigurasjonsalternativer
zh_cn: 配置选项

source: Custom functions
nb_no: Tilpassede funksjoner
zh_cn: 定制函数

source: Configuration Options
nb_no: Konfigurasjonsalternativer
zh_cn: 配置选项

source: With configuration settings, it is possible to configure options passed to both the <_:buildtarget-1/> and <_:buildtarget-2/> stages of the <application>NanoBSD</application> build process, as well as internal options passed to the main build process of <application>NanoBSD</application>. Through these options it is possible to cut the system down, so it will fit on as little as 64MB. You can use the configuration options to trim down FreeBSD even more, until it will consists of just the kernel and two or three files in the userland.
nb_no: Med konfigurasjonsinnstillinger er det mulig å konfigurere alternativer som sendes til <_:buildtarget-1/> og <_:buildtarget-2/> stadiene i <application>NanoBSD</application> build prosessen, så vel som interne alternativer gått til hovedbyggingsprosessen for <application>NanoBSD</application>. Gjennom disse alternativene er det mulig å kutte systemet ned, så det får plass til så lite som 64MB. Du kan bruke konfigurasjonsalternativene til å trimme ned FreeBSD enda mer, til den vil bestå av bare kjernen og to eller tre filer i brukerlandet.
zh_cn: 通过对配置进行设置， 可以配置用以传递给 <application>NanoBSD</application> 构建过程中 <_:buildtarget-1/> 和 <_:buildtarget-2/> 阶段的联编和安装选项， 以及 <application>NanoBSD</application> 的主构建过程中的选项。 通过使用这些选项可以削减系统的尺寸， 使之能够放入 64MB 的存储。 您还可以进一步通过这些选项来削减 FreeBSD， 直到它只包含内核以及两三个用户环境文件为止。

source: The configuration file consists of configuration options, which override the default values. The most important directives are:
nb_no: Konfigurasjonsfilen består av konfigurasjonsalternativer, som overstyrer standardverdiene. De viktigste direktivene er:
zh_cn: 配置文件中包含用以代替默认值的配置选项。 最重要的语句包括：

source: <literal>NANO_NAME</literal> — Name of build (used to construct the workdir names).
nb_no: <literal>NANO_NAME</literal> — Navn på bygget (brukes for å opprette arbeids katalog navn).
zh_cn: <literal>NANO_NAME</literal> ── 本次构建的名称 (用于创建工作目录的名字)。

source: <literal>NANO_SRC</literal> — Path to the source tree used to build the image.
nb_no: <literal>NANO_SRC</literal> — Sti til kildetreet som ble brukt til å bygge bildet.
zh_cn: <literal>NANO_SRC</literal> ── 用以联编和构建映像的源码树的位置。

source: <literal>NANO_KERNEL</literal> — Name of kernel configuration file used to build kernel.
nb_no: <literal>NANO_KERNEL</literal> — Navn på kjernekonfigurasjonsfil som ble brukt til å bygge kjernen.
zh_cn: <literal>NANO_KERNEL</literal> ── 用以联编内核的配置文件的名字。

source: <literal>CONF_BUILD</literal> — Options passed to the <_:buildtarget-1/> stage of the build.
nb_no: <literal>CONF_BUILD</literal> — Alternativer som er gitt til <_:buildtarget-1/> stadiet av bygget.
zh_cn: <literal>CONF_BUILD</literal> ── 用于传递给 <_:buildtarget-1/> 构建阶段的选项。

source: <literal>CONF_INSTALL</literal> — Options passed to the <_:buildtarget-1/> stage of the build.
nb_no: <literal>CONF_INSTALL</literal> — Alternativer som er gitt til <_:buildtarget-1/> stadiet av bygget.
zh_cn: <literal>CONF_INSTALL</literal> ── 用于传递给 <_:buildtarget-1/> 构建阶段的选项。

source: <literal>CONF_WORLD</literal> — Options passed to both the <_:buildtarget-1/> and the <_:buildtarget-2/> stage of the build.
nb_no: <literal>CONF_WORLD</literal> — Alternativene som ble gitt til både <_:buildtarget-1/> og det <_:buildtarget-2/> stadiet av builden.
zh_cn: <literal>CONF_WORLD</literal> ── 用以传递给 <_:buildtarget-1/> 和 <_:buildtarget-2/> 这两个构建阶段的选项。

source: <literal>FlashDevice</literal> — Defines what type of media to use. Check <filename>FlashDevice.sub</filename> for more details.
nb_no: <literal>FlashDevice</literal> — Definerer hvilken type media du vil bruke. Sjekk <filename>FlashDevice.sub</filename> for mer informasjon.
zh_cn: <literal>FlashDevice</literal> ── 定义所用的介质类型。 要了解进一步的细节， 请参考 <filename>FlashDevice.sub</filename> 文件。

source: Custom Functions
nb_no: Tilpassede funksjoner
zh_cn: 功能定制

source: It is possible to fine-tune <application>NanoBSD</application> using shell functions in the configuration file. The following example illustrates the basic model of custom functions:
nb_no: Det er mulig å finjustere <application>NanoBSD</application> ved bruk av shell-funksjoner i konfigurasjonsfilen. Følgende eksempel illustrerer grunnleggende modell for tilpassede funksjoner:
zh_cn: 通过在配置文件中使用 shell 函数可以进一步微调 <application>NanoBSD</application>。 下面的例子展示了定制函数的基本模式：

source: A more useful example of a customization function is the following, which changes the default size of the <filename>/etc</filename> directory from 5MB to 30MB:
nb_no: Et mer nyttig eksempel på en tilpasningsfunksjon er følgende, som endrer standardstørrelse på <filename>/etc</filename> katalogen fra 5MB til 30MB:
zh_cn: 下面是一个更贴近实际的例子， 它将默认的 <filename>/etc</filename> 目录尺寸， 从 5MB 调整为 30MB：

source: There are a few default pre-defined customization functions ready for use:
nb_no: Det er noen få forhåndsdefinerte tilpasningsfunksjoner som er klare til bruk:
zh_cn: 除此之外， 还有几个默认的预定义定制函数：

source: <literal>cust_comconsole</literal> — Disables <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> on the VGA devices (the <filename>/dev/ttyv*</filename> device nodes) and enables the use of the COM1 serial port as the system console.
nb_no: <literal>cust_comconsole</literal> — Deaktiverer <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> på VGA enheter (<filename>/dev/ttyv*</filename> enhetsnoder) og muliggjør bruk av seriell COM1-port som systemkonsoll.
zh_cn: <literal>cust_comconsole</literal> ── 在 VGA 设备上禁止 <citerefentry><refentrytitle>getty</refentrytitle><manvolnum>8</manvolnum></citerefentry> (<filename>/dev/ttyv*</filename> 设备节点) 并启用串口 COM1 作为系统控制台。

source: <literal>cust_allow_ssh_root</literal> — Allow <systemitem class="username">root</systemitem> to login via <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
nb_no: <literal>cust_allow_ssh_root</literal> — Tillater <systemitem class="username">root</systemitem> til å logge inn via <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
zh_cn: <literal>cust_allow_ssh_root</literal> ── 允许 <systemitem class="username">root</systemitem> 通过 <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> 登录。

source: <literal>cust_install_files</literal> — Installs files from the <filename>nanobsd/Files</filename> directory, which contains some useful scripts for system administration.
nb_no: <literal>cust_install_files</literal> — Installerer filer fra <filename>nanobsd/Files</filename> katalogen, som inneholder noen nyttige skript for systemadministrasjon.
zh_cn: <literal>cust_install_files</literal> ── 从 <filename>nanobsd/Files</filename> 目录中安装文件， 这包含一些实用的系统管理脚本。

source: Adding Packages
nb_no: Legge til pakker
zh_cn: 安装预编译软件包

source: Packages can be added to a <application>NanoBSD</application> image using a custom function. The following function will install all the packages located in <filename>/usr/src/tools/tools/nanobsd/packages</filename>:
nb_no: Pakker kan legges til et <application>NanoBSD</application>-bilde ved hjelp av en tilpasset funksjon. Følgende funksjon vil installere alle pakkene som ligger i <filename>/usr/src/tools/tools/nanobsd/packages</filename>:
zh_cn: 通过增加自定义的函数， 可以在 <application>NanoBSD</application> 增加预编译的软件包。 下面的函数会添加位于 <filename>/usr/src/tools/tools/nanobsd/packages</filename> 的全部预编译软件包：

source: Configuration File Example
nb_no: Eksempel på konfigurasjonsfil
zh_cn: 配置文件举例

source: A complete example of a configuration file for building a custom <application>NanoBSD</application> image can be:
nb_no: Et komplett eksempel på en konfigurasjonsfil for å lage et tilpasset <application>NanoBSD</application>-bilde kan være:
zh_cn: 下面是一个用于构建定制的 <application>NanoBSD</application> 映像的完整例子：

source: Updating NanoBSD
nb_no: Oppdatere NanoBSD
zh_cn: 更新 NanoBSD

source: The update process of <application>NanoBSD</application> is relatively simple:
nb_no: Oppdateringsprosessen av <application>NanoBSD</application> er relativt simpelt:
zh_cn: 更新 <application>NanoBSD</application> 相对而言较为简单：

source: Build a new <application>NanoBSD</application> image, as usual.
nb_no: Bygg et nytt <application>NanoBSD</application>-bilde, som vanlig.
zh_cn: 和之前一样构建新的 <application>NanoBSD</application> 映像文件。

source: Upload the new image into an unused partition of a running <application>NanoBSD</application> appliance.
nb_no: Last opp det nye bildet til en ubrukt partisjon av et kjørende <application>NanoBSD</application>-apparat.
zh_cn: 将新的映像放入正运行的 <application>NanoBSD</application> 设备中的一个未用的分区。

source: The most important difference of this step from the initial <application>NanoBSD</application> installation is that now instead of using <filename>_.disk.full</filename> (which contains an image of the entire disk), the <filename>_.disk.image</filename> image is installed (which contains an image of a single system partition).
nb_no: Den viktigste forskjellen på dette trinnet fra den første <application>NanoBSD</application>-installasjonen er at nå i stedet for å bruke <filename>_.disk.full</filename> (som inneholder et bilde av hele disken), <filename>_.disk.image</filename> bilde er installert (som inneholder et bilde av en enkel systempartisjon).
zh_cn: 与之前最初安装 <application>NanoBSD</application> 的步骤相比， 这一步骤最重要的区别在于这次不应使用 <filename>_.disk.full</filename> 文件 (它包含整个盘的映像)， 而应安装 <filename>_.disk.image</filename> 映像 (这个文件中， 只包含一个系统分区)。

source: Reboot, and start the system from the newly installed partition.
nb_no: Start på nytt, og start systemet fra den nylig installerte partisjonen.
zh_cn: 重新启动， 并从新安装的分区中启动系统。

source: If all goes well, the upgrade is finished.
nb_no: Hvis alt går bra, er oppgraderingen ferdig.
zh_cn: 如果一切顺利的话， 升级工作就完成了。

source: If anything goes wrong, reboot back into the previous partition (which contains the old, working image), to restore system functionality as fast as possible. Fix any problems of the new build, and repeat the process.
nb_no: Hvis noe går galt, start du på nytt inn i den forrige partisjonen (som inneholder det gamle, fungerende bildet), for å gjenopprette systemfunksjonaliteten så raskt som mulig. Løs eventuelle problemer med nybygget, og gjenta prosessen.
zh_cn: 如果发生了任何问题， 则可以从先前的分区启动 (其中包含了旧的、 可用的映像)， 来尽可能快地恢复系统功能。 接下来可以修正新联编的版本中存在的问题， 并重复前述步骤。
