Repository: doc-br/zanata
Catalog: articles/*/pam.po
Languages: es_es

source: When a server initiates a PAM transaction, the PAM library tries to load a policy for the service specified in the <citerefentry><refentrytitle>pam_start</refentrytitle><manvolnum>3</manvolnum></citerefentry> call. The policy specifies how authentication requests should be processed, and is defined in a configuration file. This is the other central concept in PAM: the possibility for the admin to tune the system security policy (in the wider sense of the word) simply by editing a text file.
es_es: Cuando un server inicia una transacción PAM, la biblioteca PAM intenta cargar una policy para el service especificado en la llamada <citerefentry><refentrytitle>pam_start</refentrytitle><manvolnum>3</manvolnum></citerefentry>. La policy especifica cómo se deben procesar las solicitudes de autenticación en un archivo de configuración. Este es otro de los conceptos centrales en PAM: la posibilidad de que el administrador ajuste la policy (en el sentido más amplio de la palabra) simplemente editando un archivo de texto.

source: A policy consists of four chains, one for each of the four PAM facilities. Each chain is a sequence of configuration statements, each specifying a module to invoke, some (optional) parameters to pass to the module, and a control flag that describes how to interpret the return code from the module.
es_es: Una policy consta de cuatro chains, una para cada una de las cuatro facilities de PAM. Cada chain es una secuencia de instalaciones de configuración, cada una especifica un módulo a invocar, algunos parámetros (opcionales) para pasar al módulo y una flag de control que describe cómo interpretar el código de retorno del módulo.

source: Understanding the control flags is essential to understanding PAM configuration files. There are four different control flags:
es_es: Comprender las flags de control es esencial para comprender los archivos de configuración de PAM. Hay cuatro flags de control diferentes:

source: If the module succeeds and no earlier module in the chain has failed, the chain is immediately terminated and the request is granted. If the module fails, the rest of the chain is executed, but the request is ultimately denied.
es_es: Si el módulo tiene éxito y ningún módulo anterior en el chain ha fallado, el chain se terminará de inmediato y se otorgará la solicitud. Si el módulo falla, el resto de la chain se ejecuta, pero la solicitud finalmente se deniega.

source: This control flag was introduced by Sun in <trademark>Solaris</trademark> 9 (<trademark>SunOS</trademark> 5.9), and is also supported by OpenPAM.
es_es: Este flag de control fue introducido por Sun en <trademark>Solaris</trademark> 9 (<trademark>SunOS</trademark> 5.9), y también es compatible con OpenPAM.

source: If the module succeeds, the rest of the chain is executed, and the request is granted unless some other module fails. If the module fails, the rest of the chain is also executed, but the request is ultimately denied.
es_es: Si el módulo tiene éxito, el resto del chain se ejecutará, y la solicitud se otorgará a menos que otro módulo falle. Si el módulo falla, el resto del chain también se ejecutará, pero la solicitud será denegada al final.

source: If the module succeeds, the rest of the chain is executed, and the request is granted unless some other module fails. If the module fails, the chain is immediately terminated and the request is denied.
es_es: Si el módulo tiene éxito, el resto del chain se ejecutará y la solicitud se aceptará a menos que falle algún otro módulo. Si el módulo falla, el chain terminará inmediatamente y la solicitud será denegada.

source: If the module succeeds and no earlier module in the chain has failed, the chain is immediately terminated and the request is granted. If the module fails, the module is ignored and the rest of the chain is executed.
es_es: Si el módulo tiene éxito y ningún módulo anterior del chain ha fallado, el chain terminará de inmediato y se aceptará la solicitud. Si el módulo fala, se ignorará y se ejecutará el resto del chain.

source: As the semantics of this flag may be somewhat confusing, especially when it is used for the last module in a chain, it is recommended that the <literal>binding</literal> control flag be used instead if the implementation supports it.
es_es: Como la semántica de este flag puede ser algo confusa, especialmente cuando se usa para el último módulo de un chain, se recomienda usar el flag de control del <literal>binding</literal> si la implementación lo admite.

source: The module is executed, but its result is ignored. If all modules in a chain are marked <literal>optional</literal>, all requests will always be granted.
es_es: El módulo se ejecuta, pero se ignora su resultado. Si todos los módulos de un chain están marcados como <literal>optional</literal>, todas las solicitudes serán aceptadas.

source: When a server invokes one of the six PAM primitives, PAM retrieves the chain for the facility the primitive belongs to, and invokes each of the modules listed in the chain, in the order they are listed, until it reaches the end, or determines that no further processing is necessary (either because a <literal>binding</literal> or <literal>sufficient</literal> module succeeded, or because a <literal>requisite</literal> module failed.) The request is granted if and only if at least one module was invoked, and all non-optional modules succeeded.
es_es: Cuando un server invoca una de las seis primitives de PAM, PAM recupera el chain para la facility a la que pertenece la primitive e invoca cada uno de los módulos enumerados en el chain, en el orden en el que se enumeran, hasta que llega al final, o determina que no es necesario ningún procesamiento adicional (porque un módulo <literal>binding</literal> o <literal>sufficient</literal> tuvo éxito, o porque falló un módulo <literal>requisite</literal>). La solicitud es aceptada si y solo si se invocó al menos un módulo, y todos los módulos que no sean opcionales tuvieron éxito.

source: Note that it is possible, though not very common, to have the same module listed several times in the same chain. For instance, a module that looks up user names and passwords in a directory server could be invoked multiple times with different parameters specifying different directory servers to contact. PAM treat different occurrences of the same module in the same chain as different, unrelated modules.
es_es: Tenga en cuenta que es posible, aunque no muy común, tener el mismo módulo listado varias veces en el mismo chain. Por ejemplo, un módulo que busca nombres de usuario y contraseñas en un servidor de directorio podría invocarse varias veces con diferentes parámetros que especifican diferentes servidores de directorio para contactar. PAM trata diferentes ocurrencias del mismo módulo en el mismo chain como módulos diferentes no relacionados.

source: Transactions
es_es: Transacciones

source: The lifecycle of a typical PAM transaction is described below. Note that if any of these steps fails, the server should report a suitable error message to the client and abort the transaction.
es_es: El ciclo de vida de una transacción PAM típica se describe a continuación. Tenga en cuenta que si alguno de estos pasos falla, el servidor debe informar con un mensaje de error adecuado al cliente y cancelar la transacción.

source: If necessary, the server obtains arbitrator credentials through a mechanism independent of PAM—most commonly by virtue of having been started by <literal>root</literal>, or of being setuid <literal>root</literal>.
es_es: Si es necesario, el servidor obtiene las credenciales del arbitrator a través de un mecanismo independente de PAM—comúnmente en virtud de haber sido iniciado por el usuario <literal>root</literal>, o por setuid <literal>root</literal>.

source: The server calls <citerefentry><refentrytitle>pam_start</refentrytitle><manvolnum>3</manvolnum></citerefentry> to initialize the PAM library and specify its service name and the target account, and register a suitable conversation function.
es_es: El server llama a <citerefentry><refentrytitle>pam_start</refentrytitle><manvolnum>3</manvolnum></citerefentry> para inicializar la biblioteca PAM y especificar su nombre de servicio y la cuenta de destino, y registrar una función de conversación adecuada.

source: The server obtains various information relating to the transaction (such as the applicant's user name and the name of the host the client runs on) and submits it to PAM using <citerefentry><refentrytitle>pam_set_item</refentrytitle><manvolnum>3</manvolnum></citerefentry>.
es_es: El servidor obtiene información relacionada con la transacción (como el nombre de usuario del applicant y el nombre del host en el que se ejecuta el client) y la envía a PAM usando <citerefentry><refentrytitle>pam_set_item</refentrytitle><manvolnum>3</manvolnum></citerefentry>.

source: The server calls <citerefentry><refentrytitle>pam_authenticate</refentrytitle><manvolnum>3</manvolnum></citerefentry> to authenticate the applicant.
es_es: El servidor llama a <citerefentry><refentrytitle>pam_authenticate</refentrytitle><manvolnum>3</manvolnum></citerefentry> para autenticar al applicant.

source: The server calls <citerefentry><refentrytitle>pam_acct_mgmt</refentrytitle><manvolnum>3</manvolnum></citerefentry> to verify that the requested account is available and valid. If the password is correct but has expired, <citerefentry><refentrytitle>pam_acct_mgmt</refentrytitle><manvolnum>3</manvolnum></citerefentry> will return <literal>PAM_NEW_AUTHTOK_REQD</literal> instead of <literal>PAM_SUCCESS</literal>.
es_es: El server llama a <citerefentry><refentrytitle>pam_acct_mgmt</refentrytitle><manvolnum>3</manvolnum></citerefentry> para verificar que la cuenta solicitada esté disponible y sea válida. Si la contraseña es correcta pero ha expirado, <citerefentry><refentrytitle>pam_acct_mgmt</refentrytitle><manvolnum>3</manvolnum></citerefentry> devolverá <literal>PAM_NEW_AUTHTOK_REQD</literal> en lugar de <literal>PAM_SUCCESS</literal>.

source: If the previous step returned <literal>PAM_NEW_AUTHTOK_REQD</literal>, the server now calls <citerefentry><refentrytitle>pam_chauthtok</refentrytitle><manvolnum>3</manvolnum></citerefentry> to force the client to change the authentication token for the requested account.
es_es: Si el paso anterior devolvió <literal>PAM_NEW_AUTHTOK_REQD</literal>, el servidor ahora llamará a <citerefentry><refentrytitle>pam_chauthtok</refentrytitle><manvolnum>3</manvolnum></citerefentry> para obligar al cliente a cambiar el token de autenticación para la cuenta solicitada.

source: Now that the applicant has been properly authenticated, the server calls <citerefentry><refentrytitle>pam_setcred</refentrytitle><manvolnum>3</manvolnum></citerefentry> to establish the credentials of the requested account. It is able to do this because it acts on behalf of the arbitrator, and holds the arbitrator's credentials.
es_es: Ahora que el applicant se ha autenticado correctamente, el server llama a <citerefentry><refentrytitle>pam_setcred</refentrytitle><manvolnum>3</manvolnum></citerefentry> para establecer las credenciales de la cuenta solicitada. Puede hacerlo porque actúa en nombre del arbitrator y tiene las credenciales del arbitrator.

source: Once the correct credentials have been established, the server calls <citerefentry><refentrytitle>pam_open_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> to set up the session.
es_es: Una vez que se han establecido las credenciales correctas, el server llamará a <citerefentry><refentrytitle>pam_open_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> para configurar la sesión.

source: The server now performs whatever service the client requested—for instance, provide the applicant with a shell.
es_es: El server ahora realiza cualquier servicio que solicite el cliente—por ejemplo, proporciona al applicant un shell.

source: Once the server is done serving the client, it calls <citerefentry><refentrytitle>pam_close_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> to tear down the session.
es_es: Una vez que el server termina de servir al cliente, llama a <citerefentry><refentrytitle>pam_close_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> para eliminar la sesión.

source: Finally, the server calls <citerefentry><refentrytitle>pam_end</refentrytitle><manvolnum>3</manvolnum></citerefentry> to notify the PAM library that it is done and that it can release whatever resources it has allocated in the course of the transaction.
es_es: Finalmente, el server llama a <citerefentry><refentrytitle>pam_end</refentrytitle><manvolnum>3</manvolnum></citerefentry> para notificar a la libreria de PAM que está hecho y que puede liberar cualquier recurso que haya sido asignado en el curso de la transacción.

source: PAM Configuration
es_es: Configuración de PAM

source: PAM Policy Files
es_es: Archivos de configuración de PAM

source: The <filename>/etc/pam.conf</filename>
es_es: El archivo <filename>/etc/pam.conf</filename>

source: The traditional PAM policy file is <filename>/etc/pam.conf</filename>. This file contains all the PAM policies for your system. Each line of the file describes one step in a chain, as shown below:
es_es: El archivo de configuración tradicional de PAM es <filename>/etc/pam.conf</filename>. Este archivo contiene todas las configuraciones de PAM para su sistema. Cada línea del archivo describe un paso es un chain, como se muestra a continuación:

source: The fields are, in order: service name, facility name, control flag, module name, and module arguments. Any additional fields are interpreted as additional module arguments.
es_es: Los campos son, en orden de aparición: nombre del servicio, nombre del facility, flag de control, nombre del módulo y argumentos del módulo. Cualquier campo adicional se interpreta como un argumento adicional del módulo.

source: A separate chain is constructed for each service / facility pair, so while the order in which lines for the same service and facility appear is significant, the order in which the individual services and facilities are listed is not. The examples in the original PAM paper grouped configuration lines by facility, and the <trademark>Solaris</trademark> stock <filename>pam.conf</filename> still does that, but FreeBSD's stock configuration groups configuration lines by service. Either way is fine; either way makes equal sense.
es_es: Se contruye un chain separado para cada par service/facility, por lo tanto, si bien el orden en que aparecen las líneas para el mismo service y facility es significativo, el orden en que se enumeran los services y facilities no lo es. Los ejemplos en el documento PAM original agruparon las líneas de configuración por facility, y el <filename>pam.conf</filename> que hay por defecto en <trademark>Solaris</trademark> todavía lo hace, pero la configuración por defecto de FreeBSD agrupa las líneas de configuración por service. De todas formas está bien; de cualquier forma, tiene el mismo sentido.

source: The <filename>/etc/pam.d</filename>
es_es: El archivo <filename>/etc/pam.d</filename>

source: OpenPAM and Linux-PAM support an alternate configuration mechanism, which is the preferred mechanism in FreeBSD. In this scheme, each policy is contained in a separate file bearing the name of the service it applies to. These files are stored in <filename>/etc/pam.d/</filename>.
es_es: OpenPAM y Linux-PAM soportan un mecanismo de configuración alternativo, que es el mecanismo preferido en FreeBSD. En este esquema, cada policy está contenida en un archivo separado con el nombre del service al que se aplica. Estos archivos se almacenan en <filename>/etc/pam.d/</filename>.

source: These per-service policy files have only four fields instead of <filename>pam.conf</filename>'s five: the service name field is omitted. Thus, instead of the sample <filename>pam.conf</filename> line from the previous section, one would have the following line in <filename>/etc/pam.d/login</filename>:
es_es: Estos archivos de policy por servicio tienen solo cuatro campos en lugar de los cinco de <filename>pam.conf</filename>: el campo del nombre del service se omite, Por lo tanto, en lugar de la línea de ejemplo <filename>pam.conf</filename> de la sección anterior, debería tener la siguiente línea en <filename>/etc/pam.d/login</filename>:

source: As a consequence of this simplified syntax, it is possible to use the same policy for multiple services by linking each service name to a same policy file. For instance, to use the same policy for the <literal>su</literal> and <literal>sudo</literal> services, one could do as follows:
es_es: Como resultado de esta sintaxis simplificada, es posible utilizar la misma policy para múltiples services vinculando cada nombre de service al mismo archivo de policy. Por ejemplo, para utilizar la misma policy para <literal>su</literal> y <literal>sudo</literal>, puede hacer lo siguiente:

source: This works because the service name is determined from the file name rather than specified in the policy file, so the same file can be used for multiple differently-named services.
es_es: Esto funciona porque el nombre del service se determina a partir del nombre del archivo en lugar de especificarse en el archivo de policy, por lo que el mismo archivo se puede usar para múltiples services con nombres diferentes.

source: Since each service's policy is stored in a separate file, the <filename>pam.d</filename> mechanism also makes it very easy to install additional policies for third-party software packages.
es_es: Como la policy de cada service se almacena en un archivo separado, el mecanismo <filename>pam.d</filename> también facilita la instalación de policies adicionales para paquetes de software de terceros.

source: The Policy Search Order
es_es: El orden de búsqueda del policy

source: As we have seen above, PAM policies can be found in a number of places. What happens if policies for the same service exist in multiple places?
es_es: Como hemos visto anteriormente, las policies de PAM se pueden encontrar en varios sitios. ¿Qué sucede si existen policies para el mismo service en varios sitios?

source: It is essential to understand that PAM's configuration system is centered on chains.
es_es: Es esencial comprender que el sistema de configuración de PAM se centra en los chains.

source: Breakdown of a Configuration Line
es_es: Desglose de una línea de configuración

source: As explained in <xref linkend="pam-config-file"/>, each line in <filename>/etc/pam.conf</filename> consists of four or more fields: the service name, the facility name, the control flag, the module name, and zero or more module arguments.
es_es: Como se explica en la <xref linkend="pam-config-file"/>, cada línea en el archivo <filename>/etc/pam.conf</filename> consta de cuatro o más campos: el nombre del service, el nombre de la facility, el flag de control, el nombre del módulo y cero o más argumentos del módulo.

source: The service name is generally (though not always) the name of the application the statement applies to. If you are unsure, refer to the individual application's documentation to determine what service name it uses.
es_es: El nombre del service suele ser (aunque no siempre) el nombre de la aplicación a la que se aplica la declaración. Si no está seguro, consulte la documentación de la aplicación para determinar qué nombre de service utiliza.

source: Note that if you use <filename>/etc/pam.d/</filename> instead of <filename>/etc/pam.conf</filename>, the service name is specified by the name of the policy file, and omitted from the actual configuration lines, which then start with the facility name.
es_es: Tenga en cuenta que si usa <filename>/etc/pam.d/</filename> en lugar de <filename>/etc/pam.conf</filename>, el nombre del service se especifica mediante el nombre del archivo de policy y se omite de las líneas de configuración actuales, que luego empiezan con el nombre de la facility.

source: The facility is one of the four facility keywords described in <xref linkend="pam-facilities-primitives"/>.
es_es: La facility es una de las cuatro palabras clave descritas en <xref linkend="pam-facilities-primitives"/>.

source: Likewise, the control flag is one of the four keywords described in <xref linkend="pam-chains-policies"/>, describing how to interpret the return code from the module. Linux-PAM supports an alternate syntax that lets you specify the action to associate with each possible return code, but this should be avoided as it is non-standard and closely tied in with the way Linux-PAM dispatches service calls (which differs greatly from the way <trademark>Solaris</trademark> and OpenPAM do it.) Unsurprisingly, OpenPAM does not support this syntax.
es_es: Del mismo modo, el flag de control es una de las cuatro palabras clave descritas en la <xref linkend="pam-chains-policies"/>, la cual describe cómo interpretar el código de retorno del módulo. Linux-PAM admite una sintaxis alternativa que le permite especificar la acción a asociar con cada posible código de retorno, pero esto debe ser evitado, ya no es estándar y está estrechamente relacionado con la forma en la que Linux-PAM realiza el dispacher de las llamadas del service (que difiere mucho de como lo hacen <trademark>Solaris</trademark> y OpenPAM). Como era de esperar, OpenPAM no admite esta sintaxis.

source: To configure PAM correctly, it is essential to understand how policies are interpreted.
es_es: Para configurar PAM correctamente, es esencial comprender cómo se interpretan las policies.

source: When an application calls <citerefentry><refentrytitle>pam_start</refentrytitle><manvolnum>3</manvolnum></citerefentry>, the PAM library loads the policy for the specified service and constructs four module chains (one for each facility.) If one or more of these chains are empty, the corresponding chains from the policy for the <literal>other</literal> service are substituted.
es_es: Cuando una aplicación llama a <citerefentry><refentrytitle>pam_start</refentrytitle><manvolnum>3</manvolnum></citerefentry>, la biblioteca PAM carga el policy para el service especificado y construye cuatro chains (uno para cada policy). Si una o más de estas chains están vacías, se reemplazan las chains de la policy correspondiente para el service <literal>other</literal>.

source: When the application later calls one of the six PAM primitives, the PAM library retrieves the chain for the corresponding facility and calls the appropriate service function in each module listed in the chain, in the order in which they were listed in the configuration. After each call to a service function, the module type and the error code returned by the service function are used to determine what happens next. With a few exceptions, which we discuss below, the following table applies:
es_es: Cuando la aplicación llama más tarde a una de los seis primitives de PAM, la biblioteca PAM recupera el chain para la facility correspondiente y llama a la función apropiada del service en cada módulo del listado en el chain, en el orden en el que fueron listados en la configuración. Después de cada llamada a una función del service, el tipo de módulo y el código de error devuelto por la función del service se utilizan para determinar qué sucede a continuación. Con algunas excepciones, que se analizaran a continuación, se aplica la siguiente tabla:

source: PAM Chain Execution Summary
es_es: Resumen de la ejecución del chain en PAM

source: <literal>other</literal>
es_es: <literal>Otros</literal>
