Repository: doc-br/zanata
Catalog: articles/*/pam.po
Languages: es_es

source: The conversation function presented below is a greatly simplified version of OpenPAM's <citerefentry><refentrytitle>openpam_ttyconv</refentrytitle><manvolnum>3</manvolnum></citerefentry>. It is fully functional, and should give the reader a good idea of how a conversation function should behave, but it is far too simple for real-world use. Even if you are not using OpenPAM, feel free to download the source code and adapt <citerefentry><refentrytitle>openpam_ttyconv</refentrytitle><manvolnum>3</manvolnum></citerefentry> to your uses; we believe it to be as robust as a tty-oriented conversation function can reasonably get.
es_es: La función de conversación presentada a continuación es una versión muy simplificada de <citerefentry><refentrytitle>openpam_ttyconv</refentrytitle><manvolnum>3</manvolnum></citerefentry> de OpenPAM. Es completamente funcional y debería de dar al lector una buena idea de cómo debería de comportarse una función de conversación, pero es demasiado simple para su uso en el mundo real. Incluso si no está utilizando OpenPAM, no dude en descargar el código fuente y adaptar <citerefentry><refentrytitle>openpam_ttyconv</refentrytitle><manvolnum>3</manvolnum></citerefentry> a sus necesidades; creemos que es tan robusta como lo puede ser una función de conversación orientada a tty.

source: Further Reading
es_es: Lecturas adicionales

source: This is a list of documents relevant to PAM and related issues. It is by no means complete.
es_es: Esto es un listado de documentos relevantes sobre PAM y temas relacionados. El listado no está completo.

source: Papers
es_es: Artículos

source: User Manuals
es_es: Manuales de usuario

source: Related Web Pages
es_es: Páginas web relacionadas
