Repository: doc-br/zanata
Catalog: articles/*/pam.po
Languages: es_es

# _
source: translator-credits
es_es: Sergio Carlavilla carlavilla@FreeBSD.org, 2019

source: This article describes the underlying principles and mechanisms of the Pluggable Authentication Modules (PAM) library, and explains how to configure PAM, how to integrate PAM into applications, and how to write PAM modules.
es_es: Este artículo describe los principios y mecanismos subyacentes de la libreria Pluggable Authentication Modules (PAM), y explica cómo configurar PAM, cómo integrar PAM en aplicaciones y cómo escribir módulos PAM.

source: $FreeBSD: head/en_US.ISO8859-1/articles/pam/article.xml 52137 2018-08-16 14:45:06Z bcr $
es_es: $FreeBSD$

source: Introduction
es_es: Introducción

source: The Pluggable Authentication Modules (PAM) library is a generalized API for authentication-related services which allows a system administrator to add new authentication methods simply by installing new PAM modules, and to modify authentication policies by editing configuration files.
es_es: La libreria Pluggable Authentication Modules (PAM) es una API para servicios relacionados con la autenticación que permite al administrador del sistema añadir nuevos métodos de autenticación simplemente instalando nuevos módulos PAM y modificando las políticas de autenticación editando el archivo de configuración.

source: PAM was defined and developed in 1995 by Vipin Samar and Charlie Lai of Sun Microsystems, and has not changed much since. In 1997, the Open Group published the X/Open Single Sign-on (XSSO) preliminary specification, which standardized the PAM API and added extensions for single (or rather integrated) sign-on. At the time of this writing, this specification has not yet been adopted as a standard.
es_es: PAM fue definido y desarrollado en 1995 por Vipin Samar y Charlie Lai de Sun Microsystems, y no ha cambiado mucho desde entonces. En 1997, el Open Group publicó la especificación preliminar X/Open Single Sign-on (XSSO), que estandarizó la API de PAM y añadió las extensiones para el single sign-on. En el momento de escribir este artículo, esta especificación aún no se ha adoptado como estándar.

source: Although this article focuses primarily on FreeBSD 5.x, which uses OpenPAM, it should be equally applicable to FreeBSD 4.x, which uses Linux-PAM, and other operating systems such as Linux and <trademark>Solaris</trademark>.
es_es: Aunque este artículo se centra principalmente en FreeBSD 5.x, el cual hace uso de OpenPAM, también se debería poder aplicar a FreeBSD 4.x, el cual hace uso de Linux-PAM, y en otros sistemas operativos, como Linux y <trademark>Solaris</trademark>.

source: Terms and Conventions
es_es: Términos y convenciones

source: Definitions
es_es: Definiciones

source: The terminology surrounding PAM is rather confused. Neither Samar and Lai's original paper nor the XSSO specification made any attempt at formally defining terms for the various actors and entities involved in PAM, and the terms that they do use (but do not define) are sometimes misleading and ambiguous. The first attempt at establishing a consistent and unambiguous terminology was a whitepaper written by Andrew G. Morgan (author of Linux-PAM) in 1999. While Morgan's choice of terminology was a huge leap forward, it is in this author's opinion by no means perfect. What follows is an attempt, heavily inspired by Morgan, to define precise and unambiguous terms for all actors and entities involved in PAM.
es_es: La terminología que rodea PAM es bastante confusa. Ni el documento original de Samar y Lai, ni la especificación XSSO hicieron ningún intento de definir formalmente los términos para los diversos actores y entidades involucradas en PAM, y los términos que usan (pero no definen) a veces son engañosos y ambiguos. El primer intento de establecer una terminología coherente e inequívoca fue un documento técnico escrito por Andrew G. Morgan (autor de Linux-PAM) en 1999. Si bien la terminología elegida por parte de Morgan fue un gran avance, en opinión de este autor, no es de ninguna manera perfecta. Las definiciones que se muestran son un intento, fuertemente inspiradas por Morgan, de definir de forma precisa y sin ambigüedades los terminos para todos los actores y entidades involucradas en PAM.

source: The set of credentials the applicant is requesting from the arbitrator.
es_es: El conjunto de credenciales que el applicant solicita al arbitrator.

source: The user or entity requesting authentication.
es_es: El usuario o entidad que solicita la autenticación.

source: The user or entity who has the privileges necessary to verify the applicant's credentials and the authority to grant or deny the request.
es_es: El usuario o entidad que tiene los privilegios necesarios para verificar las credenciales del applicant y la autoridad para otorgar o denegar la solicitud.

source: A sequence of modules that will be invoked in response to a PAM request. The chain includes information about the order in which to invoke the modules, what arguments to pass to them, and how to interpret the results.
es_es: Una secuencia de módulos que se invocarán en respuesta a una solicitud PAM. El chain incluye información sobre el orden en el que invocar los módulos, qué argumentos pasarles y cómo interpretar los resultados.

source: The application responsible for initiating an authentication request on behalf of the applicant and for obtaining the necessary authentication information from him.
es_es: La aplicación responsable de iniciar una solicitud de autenticación en nombre del applicant y de obtener la información de autenticación necesaria de él.

source: One of the four basic groups of functionality provided by PAM: authentication, account management, session management and authentication token update.
es_es: Uno de los cuatro grupos básicos de funcionalidad proporcionados por PAM: authentication, account management, session management y authentication token update.

source: A collection of one or more related functions implementing a particular authentication facility, gathered into a single (normally dynamically loadable) binary file and identified by a single name.
es_es: Una colección de una o más funciones relacionadas que implementan una facility de autenticación particular, recogida en un único archivo binario (normalmente cargable dinámicamente) e identificado por un solo nombre.

source: The complete set of configuration statements describing how to handle PAM requests for a particular service. A policy normally consists of four chains, one for each facility, though some services do not use all four facilities.
es_es: El conjunto completo de instrucciones de configuración que describen cómo manejar las solicitudes PAM para un servicio en particular. Una policy normalmente consta de cuatro chains, una para cada facility, aunque algunos servicios no utilizan las cuatro facilities.

source: The application acting on behalf of the arbitrator to converse with the client, retrieve authentication information, verify the applicant's credentials and grant or deny requests.
es_es: La aplicación que actúa en nombre del arbitrator para conversar con el client, recuperar información de autenticación, verificar las credenciales del applicant y otorgar o rechazar solicitudes.

source: A class of servers providing similar or related functionality and requiring similar authentication. PAM policies are defined on a per-service basis, so all servers that claim the same service name will be subject to the same policy.
es_es: Una clase de servidores que proporcionan una funcionalidad similar o relacionada y que requieren una autenticación similar. Las políticas de PAM se definen por cada service, por lo que todos los servidores que reclaman el mismo nombre de service estarán sujetos a la misma política.

source: The context within which service is rendered to the applicant by the server. One of PAM's four facilities, session management, is concerned exclusively with setting up and tearing down this context.
es_es: El contexto dentro del cual el servidor presta el servicio al applicant. Una de las cuatro facilities de PAM, la gestión de sesiones, se ocupa exclusivamente de establecer y destruir este contexto.

source: A chunk of information associated with the account, such as a password or passphrase, which the applicant must provide to prove his identity.
es_es: Un chunk de información asociado con la cuenta, como una contraseña o frase, que el applicant debe proporcionar para probar su identidad.

source: A sequence of requests from the same applicant to the same instance of the same server, beginning with authentication and session set-up and ending with session tear-down.
es_es: Una secuencia de solicitudes del mismo applicant a la misma instancia del mismo servidor, comenzando con la autenticación y la configuración de la sesión y terminando con el desmantelamiento de la sesión.

source: Usage Examples
es_es: Ejemplos de uso

source: This section aims to illustrate the meanings of some of the terms defined above by way of a handful of simple examples.
es_es: Esta sección tiene como objetivo ilustrar los significados de algunos de los términos definidos anteriormente mediante un puñado de ejemplos simples.

source: Client and Server Are One
es_es: El cliente y el servidor son uno

source: This simple example shows <literal>alice</literal> <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry>'ing to <literal>root</literal>.
es_es: Este ejemplo sencillo muestra a <literal>alice</literal> usando el comando <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> para convertirse en <literal>root</literal>.

source: The applicant is <literal>alice</literal>.
es_es: El applicant es <literal>alice</literal>.

source: The account is <literal>root</literal>.
es_es: El account es <literal>root</literal>.

source: The <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> process is both client and server.
es_es: El proceso de utilizar <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> es tanto cliente como servidor.

source: The authentication token is <literal>xi3kiune</literal>.
es_es: El token de autenticación es <literal>xi3kiune</literal>.

source: The arbitrator is <literal>root</literal>, which is why <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> is setuid <literal>root</literal>.
es_es: El arbitrator es <literal>root</literal>, por lo que el comando <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> es setuid <literal>root</literal>.

source: Client and Server Are Separate
es_es: El cliente y el servidor están separados

source: The example below shows <literal>eve</literal> try to initiate an <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> connection to <literal>login.example.com</literal>, ask to log in as <literal>bob</literal>, and succeed. Bob should have chosen a better password!
es_es: El siguiente ejemplo muestra a <literal>eve</literal> intentando iniciar una conexión por <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> a <literal>login.example.com</literal>, solicita iniciar sesión como <literal>bob</literal>, y tiene éxito. ¡Bob debería de haber elegido una contraseña mejor!

source: The applicant is <literal>eve</literal>.
es_es: El applicant es <literal>eve</literal>.

source: The client is Eve's <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> process.
es_es: El client es el proceso <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> de Eve.

source: The server is the <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> process on <literal>login.example.com</literal>
es_es: El server es el proceso <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> en <literal>login.example.com</literal>

source: The account is <literal>bob</literal>.
es_es: El account es <literal>bob</literal>.

source: The authentication token is <literal>god</literal>.
es_es: El token de autenticación es <literal>god</literal>.

source: Although this is not shown in this example, the arbitrator is <literal>root</literal>.
es_es: Aunque esto no se muestra en este ejemplo, el arbitrator es <literal>root</literal>.

source: Sample Policy
es_es: Política de ejemplo

source: The following is FreeBSD's default policy for <literal>sshd</literal>:
es_es: Lo que se muestra a continuación, es la política predeterminada de FreeBSD para <literal>sshd</literal>:

source: This policy applies to the <literal>sshd</literal> service (which is not necessarily restricted to the <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry> server.)
es_es: Esta política se aplica al servicio <literal>sshd</literal> (que no está restringido necesariamente al servidor <citerefentry><refentrytitle>sshd</refentrytitle><manvolnum>8</manvolnum></citerefentry>).

source: <literal>auth</literal>, <literal>account</literal>, <literal>session</literal> and <literal>password</literal> are facilities.
es_es: <literal>auth</literal>, <literal>account</literal>, <literal>session</literal> y <literal>password</literal> son facilities.

source: <filename>pam_nologin.so</filename>, <filename>pam_unix.so</filename>, <filename>pam_login_access.so</filename>, <filename>pam_lastlog.so</filename> and <filename>pam_permit.so</filename> are modules. It is clear from this example that <filename>pam_unix.so</filename> provides at least two facilities (authentication and account management.)
es_es: <filename>pam_nologin.so</filename>, <filename>pam_unix.so</filename>, <filename>pam_login_access.so</filename>, <filename>pam_lastlog.so</filename> y <filename>pam_permit.so</filename> son modules. Está claro que a partir de este ejemplo, <filename>pam_unix.so</filename> proporciona al menos dos funciones (autenticación y administración de cuentas).

source: Facilities and Primitives
es_es: Facilities y primitives

source: The PAM API offers six different authentication primitives grouped in four facilities, which are described below.
es_es: La API de PAM ofrece seis primitives de autenticación diferentes agrupadas en cuatro facilities, que se describen a continuación.

source: <emphasis>Authentication.</emphasis> This facility concerns itself with authenticating the applicant and establishing the account credentials. It provides two primitives:
es_es: <emphasis>Authentication.</emphasis> Esta facility se ocupa de autenticar al applicant y establecer las credenciales de la cuenta. Proporciona dos primitives:

source: <citerefentry><refentrytitle>pam_authenticate</refentrytitle><manvolnum>3</manvolnum></citerefentry> authenticates the applicant, usually by requesting an authentication token and comparing it with a value stored in a database or obtained from an authentication server.
es_es: <citerefentry><refentrytitle>pam_authenticate</refentrytitle><manvolnum>3</manvolnum></citerefentry> autentica al applicant, normalmente, solicitando un token de autenticación y comparándolo con un valor almacenado en una base de datos u obtenido de un servidor de autenticación.

source: <citerefentry><refentrytitle>pam_setcred</refentrytitle><manvolnum>3</manvolnum></citerefentry> establishes account credentials such as user ID, group membership and resource limits.
es_es: <citerefentry><refentrytitle>pam_setcred</refentrytitle><manvolnum>3</manvolnum></citerefentry> establece credenciales de la cuenta, como el ID del usuario, membresía de grupo y límites de recursos.

source: <emphasis>Account management.</emphasis> This facility handles non-authentication-related issues of account availability, such as access restrictions based on the time of day or the server's work load. It provides a single primitive:
es_es: <emphasis>Account management.</emphasis> Esta función se encarga de los problemas de disponibilidad con las cuentas, que no están relacionados con la autenticación, como restricciones de acceso según la hora del día o la carga del servidor de trabajo. Proporciona una primitive única:

source: <citerefentry><refentrytitle>pam_acct_mgmt</refentrytitle><manvolnum>3</manvolnum></citerefentry> verifies that the requested account is available.
es_es: <citerefentry><refentrytitle>pam_acct_mgmt</refentrytitle><manvolnum>3</manvolnum></citerefentry> verifica que la cuenta solicitada esté disponible.

source: <emphasis>Session management.</emphasis> This facility handles tasks associated with session set-up and tear-down, such as login accounting. It provides two primitives:
es_es: <emphasis>Session management.</emphasis> Está función maneja las tareas asociadas con la configuración de la sesión y el cierre, como la contabilidad de inicio de sesión. Proporciona dos primitives:

source: <citerefentry><refentrytitle>pam_open_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> performs tasks associated with session set-up: add an entry in the <filename>utmp</filename> and <filename>wtmp</filename> databases, start an SSH agent, etc.
es_es: <citerefentry><refentrytitle>pam_open_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> realiza las tareas asociadas con la configuración de la sesión: añade una entrada a las bases de datos de <filename>utmp</filename> y <filename>wtmp</filename>, inicia un agente SSH, etc...

source: <citerefentry><refentrytitle>pam_close_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> performs tasks associated with session tear-down: add an entry in the <filename>utmp</filename> and <filename>wtmp</filename> databases, stop the SSH agent, etc.
es_es: <citerefentry><refentrytitle>pam_close_session</refentrytitle><manvolnum>3</manvolnum></citerefentry> realiza tareas asociadas con el cierre de la sesión: agrega una entrada a las bases de datos <filename>utmp</filename> y <filename>wtmp</filename>, detiene el agent SSH, etc...

source: <emphasis>Password management.</emphasis> This facility is used to change the authentication token associated with an account, either because it has expired or because the user wishes to change it. It provides a single primitive:
es_es: <emphasis>Gestión de contraseñas.</emphasis> Esta función se usa para cambiar el token de autenticación asociado a una cuenta, ya sea porque ha caducado o porque el usuario desea cambiarla. Proporciona una primitive única:

source: <citerefentry><refentrytitle>pam_chauthtok</refentrytitle><manvolnum>3</manvolnum></citerefentry> changes the authentication token, optionally verifying that it is sufficiently hard to guess, has not been used previously, etc.
es_es: <citerefentry><refentrytitle>pam_chauthtok</refentrytitle><manvolnum>3</manvolnum></citerefentry> cambia el token de autenticación, verificando opcionalmente que sea lo suficientemente difícil de adivinar, que no haya sido utilizado anteriormente, etc...

source: Modules
es_es: Módulos

source: Modules are a very central concept in PAM; after all, they are the <quote>M</quote> in <quote>PAM</quote>. A PAM module is a self-contained piece of program code that implements the primitives in one or more facilities for one particular mechanism; possible mechanisms for the authentication facility, for instance, include the <trademark class="registered">UNIX</trademark> password database, NIS, LDAP and Radius.
es_es: Los módulos son la piedra angular de PAM; después de todo, son la <quote>M</quote>, en <quote>PAM</quote>. Un módulo PAM es un código de programación autónomo que implementa los primitives en una o más instalaciones para unas facilities en particular; los posibles mecanismos para la facility de autenticación, por ejemplo, incluyen la base de datos de contraseñas <trademark class="registered">UNIX</trademark>, NIS, LDAP y Radius.

source: Module Naming
es_es: Nomenclatura de módulos

source: FreeBSD implements each mechanism in a single module, named <literal>pam_<replaceable>mechanism</replaceable>.so</literal> (for instance, <literal>pam_unix.so</literal> for the <trademark class="registered">UNIX</trademark> mechanism.) Other implementations sometimes have separate modules for separate facilities, and include the facility name as well as the mechanism name in the module name. To name one example, <trademark>Solaris</trademark> has a <literal>pam_dial_auth.so.1</literal> module which is commonly used to authenticate dialup users.
es_es: FreeBSD implementa cada mecanismo en un solo módulo, llamado <literal>pam_<replaceable>mechanism</replaceable>.so</literal> (por ejemplo, <literal>pam_unix.so</literal> para el motor <trademark class="registered">UNIX</trademark>). Otras implementaciones a veces tienen módulos separados para instalaciones separadas, e incluyen el nombre de la facility y el nombre del mecanismo en el nombre del módulo. Por mencionar un ejemplo, <trademark>Solaris</trademark> tiene un módulo <literal>pam_dial_auth.so.1</literal> que se utiliza comúnmente para autenticar a los usuarios por acceso telefónico.

source: Module Versioning
es_es: Versionado de módulos

source: FreeBSD's original PAM implementation, based on Linux-PAM, did not use version numbers for PAM modules. This would commonly cause problems with legacy applications, which might be linked against older versions of the system libraries, as there was no way to load a matching version of the required modules.
es_es: La implementación original de PAM en FreeBSD, basada en Linux-PAM, no usaba números de versión para los módulos PAM. Esto normalmente causaría problemas con las aplicaciones heredadas (legacy), que podrían estar vinculadas con versiones anteriores de las bibliotecas del sistema, ya que no había forma de cargar una versión correspondiente de los módulos requeridos.

source: OpenPAM, on the other hand, looks for modules that have the same version number as the PAM library (currently 2), and only falls back to an unversioned module if no versioned module could be loaded. Thus legacy modules can be provided for legacy applications, while allowing new (or newly built) applications to take advantage of the most recent modules.
es_es: OpenPAM, por otro lado, busca módulos que tengan el mismo número de versión que la biblioteca PAM (actualmente 2), y solo recurre a un módulo sin versión si no se puede cargar un módulo que tenga versión. Por lo tanto, se pueden proporcionar módulos heredados (legacy) para aplicaciones heredadas (legacy), lo cual permite que las aplicaciones nuevas (o compiladas de nuevo) aprovechen los módulos más recientes.

source: Although <trademark>Solaris</trademark> PAM modules commonly have a version number, they are not truly versioned, because the number is a part of the module name and must be included in the configuration.
es_es: Aunque los módulos PAM de <trademark>Solaris</trademark> generalmente tienen un número de versión, no están versionados realmente, porque el número es parte del nombre del módulo y debe incluirse en la configuración.

source: Chains and Policies
es_es: Chains y policies
