Repository: doc-br/zanata
Catalog: articles/*/pam.po
Languages: es_es

source: If <varname>fail</varname> is true at the end of a chain, or when a <quote>break</quote> is reached, the dispatcher returns the error code returned by the first module that failed. Otherwise, it returns <literal>PAM_SUCCESS</literal>.
es_es: Si <varname>fail</varname> es true al final de un chain, o cuando se alcanza un <quote>break</quote>, el dispatcher devuelve el código de error devuelto el primer módulo que falló. De lo contrario, devuelve <literal>PAM_SUCCESS</literal>.

source: The first exception of note is that the error code <literal>PAM_NEW_AUTHTOK_REQD</literal> is treated like a success, except that if no module failed, and at least one module returned <literal>PAM_NEW_AUTHTOK_REQD</literal>, the dispatcher will return <literal>PAM_NEW_AUTHTOK_REQD</literal>.
es_es: La primera excepción es que el código de error <literal>PAM_NEW_AUTHTOK_REQD</literal> se trata como un éxito, si ningún módulo falla y al menos un módulo devuelve <literal>PAM_NEW_AUTHTOK_REQD</literal>, el dispatcher devolverá <literal>PAM_NEW_AUTHTOK_REQD</literal>.

source: The second exception is that <citerefentry><refentrytitle>pam_setcred</refentrytitle><manvolnum>3</manvolnum></citerefentry> treats <literal>binding</literal> and <literal>sufficient</literal> modules as if they were <literal>required</literal>.
es_es: La segunda excepción es que <citerefentry><refentrytitle>pam_setcred</refentrytitle><manvolnum>3</manvolnum></citerefentry> trata los módulos <literal>binding</literal> y <literal>sufficient</literal> como si fueran <literal>required</literal>.

source: The third and final exception is that <citerefentry><refentrytitle>pam_chauthtok</refentrytitle><manvolnum>3</manvolnum></citerefentry> runs the entire chain twice (once for preliminary checks and once to actually set the password), and in the preliminary phase it treats <literal>binding</literal> and <literal>sufficient</literal> modules as if they were <literal>required</literal>.
es_es: La tercera y última excepción es que <citerefentry><refentrytitle>pam_chauthtok</refentrytitle><manvolnum>3</manvolnum></citerefentry> ejecuta la chain completa dos veces (una para verificaciones preliminares y otra para establecer la contraseña), y en la fase preliminar, trata los módulos <literal>binding</literal> y <literal>sufficient</literal> como si fueran <literal>required</literal>.

source: FreeBSD PAM Modules
es_es: Módulos PAM de FreeBSD

source: The <citerefentry><refentrytitle>pam_deny</refentrytitle><manvolnum>8</manvolnum></citerefentry> module is one of the simplest modules available; it responds to any request with <literal>PAM_AUTH_ERR</literal>. It is useful for quickly disabling a service (add it to the top of every chain), or for terminating chains of <literal>sufficient</literal> modules.
es_es: El módulo <citerefentry><refentrytitle>pam_deny</refentrytitle><manvolnum>8</manvolnum></citerefentry> es uno de los módulos más simples de los módulos que hay disponibles; responde a cualquier solicitud con <literal>PAM_AUTH_ERR</literal>. Es útil para deshabilitar rápidamente un servicio (añadalo al principio de cada chain) o para terminar chains de módulos <literal>sufficient</literal>.

source: The <citerefentry><refentrytitle>pam_echo</refentrytitle><manvolnum>8</manvolnum></citerefentry> module simply passes its arguments to the conversation function as a <literal>PAM_TEXT_INFO</literal> message. It is mostly useful for debugging, but can also serve to display messages such as <quote>Unauthorized access will be prosecuted</quote> before starting the authentication procedure.
es_es: El módulo <citerefentry><refentrytitle>pam_echo</refentrytitle><manvolnum>8</manvolnum></citerefentry> simplemente pasa sus argumentos a la función de conversación como un mensaje <literal>PAM_TEXT_INFO</literal>. Se utiliza principalmente para la depuración, pero también puede servir para mostrar mensajes como <quote>Unauthorized access will be prosecuted</quote> antes de comenzar el procedimiento de autenticación.

source: The <citerefentry><refentrytitle>pam_exec</refentrytitle><manvolnum>8</manvolnum></citerefentry> module takes its first argument to be the name of a program to execute, and the remaining arguments are passed to that program as command-line arguments. One possible application is to use it to run a program at login time which mounts the user's home directory.
es_es: El módulo <citerefentry><refentrytitle>pam_exec</refentrytitle><manvolnum>8</manvolnum></citerefentry> coge su primer argumento del nombre del programa a ejecutar, y el resto de argumentos se pasan a ese programa como argumentos de línea de comandos. Un posible uso sería para ejecutar un programa que al iniciar la sesión monte el directorio home del usuario.

source: The <citerefentry><refentrytitle>pam_ftpusers</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
es_es: El módulo <citerefentry><refentrytitle>pam_ftpusers</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_group</refentrytitle><manvolnum>8</manvolnum></citerefentry> module accepts or rejects applicants on the basis of their membership in a particular file group (normally <literal>wheel</literal> for <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry>). It is primarily intended for maintaining the traditional behavior of BSD <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry>, but has many other uses, such as excluding certain groups of users from a particular service.
es_es: El módulo <citerefentry><refentrytitle>pam_group</refentrytitle><manvolnum>8</manvolnum></citerefentry> acepta o rechaza a los applicants en función de su pertenencia a un grupo de archivos en particular (normalmente <literal>wheel</literal> para <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry>). Su principal objetivo es mantener el comportamiento tradicional de BSD <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry>, pero tiene muchos otros usos, como la exclusión de ciertos grupos de usuarios de un servicio en particular.

source: The <citerefentry><refentrytitle>pam_guest</refentrytitle><manvolnum>8</manvolnum></citerefentry> module allows guest logins using fixed login names. Various requirements can be placed on the password, but the default behavior is to allow any password as long as the login name is that of a guest account. The <citerefentry><refentrytitle>pam_guest</refentrytitle><manvolnum>8</manvolnum></citerefentry> module can easily be used to implement anonymous FTP logins.
es_es: El módulo <citerefentry><refentrytitle>pam_guest</refentrytitle><manvolnum>8</manvolnum></citerefentry> permite el inicio de sesión de invitados utilizando nombres de inicio de sesión fijos. Se pueden introducir varios requisitos en la contraseña, pero el comportamiento predeterminado es permitir cualquier contraseña siempre que el nombre de inicio de sesión sea el de una cuenta de invitado. El módulo <citerefentry><refentrytitle>pam_guest</refentrytitle><manvolnum>8</manvolnum></citerefentry> se puede utilizar fácilmente para implementar inicios de sesión en FTP anónimos.

source: The <citerefentry><refentrytitle>pam_krb5</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
es_es: El módulo <citerefentry><refentrytitle>pam_krb5</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_ksu</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
es_es: El módulo <citerefentry><refentrytitle>pam_ksu</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_lastlog</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
es_es: El módulo <citerefentry><refentrytitle>pam_lastlog</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_login_access</refentrytitle><manvolnum>8</manvolnum></citerefentry> module provides an implementation of the account management primitive which enforces the login restrictions specified in the <citerefentry><refentrytitle>login.access</refentrytitle><manvolnum>5</manvolnum></citerefentry> table.
es_es: El módulo <citerefentry><refentrytitle>pam_login_access</refentrytitle><manvolnum>8</manvolnum></citerefentry> proporciona una implementación de la primitive de administración de cuentas que aplica las restricciones en el inicio de sesión especificadas en la tabla <citerefentry><refentrytitle>login.access</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: The <citerefentry><refentrytitle>pam_nologin</refentrytitle><manvolnum>8</manvolnum></citerefentry> module refuses non-root logins when <filename>/var/run/nologin</filename> exists. This file is normally created by <citerefentry><refentrytitle>shutdown</refentrytitle><manvolnum>8</manvolnum></citerefentry> when less than five minutes remain until the scheduled shutdown time.
es_es: El módulo <citerefentry><refentrytitle>pam_nologin</refentrytitle><manvolnum>8</manvolnum></citerefentry> rechaza los inicios de sesión que no sean del usuario root cuando existe el archivo <filename>/var/run/nologin</filename>. Generalmente, este archivo se crea mediante el uso del comando <citerefentry><refentrytitle>shutdown</refentrytitle><manvolnum>8</manvolnum></citerefentry> cuando quedan menos de cinco minutos hasta el tiempo de apagado programado.

source: The <citerefentry><refentrytitle>pam_opie</refentrytitle><manvolnum>8</manvolnum></citerefentry> module implements the <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> authentication method. The <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> system is a challenge-response mechanism where the response to each challenge is a direct function of the challenge and a passphrase, so the response can be easily computed <quote>just in time</quote> by anyone possessing the passphrase, eliminating the need for password lists. Moreover, since <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> never reuses a challenge that has been correctly answered, it is not vulnerable to replay attacks.
es_es: El módulo <citerefentry><refentrytitle>pam_opie</refentrytitle><manvolnum>8</manvolnum></citerefentry> implementa el método de autenticación <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry>. El sistema <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> es un mecanismo de desafío-respuesta en el que la respuesta a cada desafío es una función directa del desafio y una contraseña, por lo que la respuesta puede ser calculada <quote>just in time</quote> por cualquier persona que posea la contraseña, eliminando la necesidad de listados de contraseñas. Además, dado que <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> nunca reutiliza un desafío que ya ha sido respondido correctamente, no es vulnerable a los ataques por repetición.

source: The <citerefentry><refentrytitle>pam_opieaccess</refentrytitle><manvolnum>8</manvolnum></citerefentry> module is a companion module to <citerefentry><refentrytitle>pam_opie</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Its purpose is to enforce the restrictions codified in <citerefentry><refentrytitle>opieaccess</refentrytitle><manvolnum>5</manvolnum></citerefentry>, which regulate the conditions under which a user who would normally authenticate herself using <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> is allowed to use alternate methods. This is most often used to prohibit the use of password authentication from untrusted hosts.
es_es: El módulo <citerefentry><refentrytitle>pam_opieaccess</refentrytitle><manvolnum>8</manvolnum></citerefentry> es un módulo complementario para <citerefentry><refentrytitle>pam_opie</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Su propósito es hacer cumplir las restricciones codificadas en <citerefentry><refentrytitle>opieaccess</refentrytitle><manvolnum>5</manvolnum></citerefentry>, que regulan las condiciones bajo las cuales un usuario que normalmente se autenticaría usando <citerefentry><refentrytitle>opie</refentrytitle><manvolnum>4</manvolnum></citerefentry> puede usar métodos alternativos. Esto se utiliza a menudo para prohibir el uso de autenticación por contraseña de host de los cuales no se tiene confianza.

source: In order to be effective, the <citerefentry><refentrytitle>pam_opieaccess</refentrytitle><manvolnum>8</manvolnum></citerefentry> module must be listed as <literal>requisite</literal> immediately after a <literal>sufficient</literal> entry for <citerefentry><refentrytitle>pam_opie</refentrytitle><manvolnum>8</manvolnum></citerefentry>, and before any other modules, in the <literal>auth</literal> chain.
es_es: Para que sea efectivo, el módulo <citerefentry><refentrytitle>pam_opieaccess</refentrytitle><manvolnum>8</manvolnum></citerefentry> debe aparecer como <literal>requisite</literal> inmediatamente después de una entrada <literal>sufficient</literal> para <citerefentry><refentrytitle>pam_opie</refentrytitle><manvolnum>8</manvolnum></citerefentry>, y antes que cualquier otro módulo, en el chain <literal>auth</literal>.

source: The <citerefentry><refentrytitle>pam_passwdqc</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
es_es: El módulo <citerefentry><refentrytitle>pam_passwdqc</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_permit</refentrytitle><manvolnum>8</manvolnum></citerefentry> module is one of the simplest modules available; it responds to any request with <literal>PAM_SUCCESS</literal>. It is useful as a placeholder for services where one or more chains would otherwise be empty.
es_es: El módulo <citerefentry><refentrytitle>pam_permit</refentrytitle><manvolnum>8</manvolnum></citerefentry> es uno de los módulos más simples de los que hay disponibles; responde a cualquier solicitud con <literal>PAM_SUCCESS</literal>. Es útil para marcar la posición en los servicios donde una o más chains estarían vacías.

source: The <citerefentry><refentrytitle>pam_radius</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
es_es: El módulo <citerefentry><refentrytitle>pam_radius</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_rhosts</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
es_es: El módulo <citerefentry><refentrytitle>pam_rhosts</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_rootok</refentrytitle><manvolnum>8</manvolnum></citerefentry> module reports success if and only if the real user id of the process calling it (which is assumed to be run by the applicant) is 0. This is useful for non-networked services such as <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> or <citerefentry><refentrytitle>passwd</refentrytitle><manvolnum>1</manvolnum></citerefentry>, to which the <literal>root</literal> should have automatic access.
es_es: El módulo <citerefentry><refentrytitle>pam_rootok</refentrytitle><manvolnum>8</manvolnum></citerefentry> informa de éxito si, y solo si, si el identificador del usuario real en el proceso que lo llama (se supone que lo ejecuta el applicant) es 0. Esto es útil para servicios no contectados en red, como <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> o <citerefentry><refentrytitle>passwd</refentrytitle><manvolnum>1</manvolnum></citerefentry>, a los que <literal>root</literal> debe tener acceso automático.

source: The <citerefentry><refentrytitle>pam_securetty</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
es_es: El módulo <citerefentry><refentrytitle>pam_securetty</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_self</refentrytitle><manvolnum>8</manvolnum></citerefentry> module reports success if and only if the names of the applicant matches that of the target account. It is most useful for non-networked services such as <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry>, where the identity of the applicant can be easily verified.
es_es: El módulo <citerefentry><refentrytitle>pam_self</refentrytitle><manvolnum>8</manvolnum></citerefentry> informa de éxito si y solo si, los nombres del applicant coinciden con los de la cuenta de destino. Es más útil para servicios no conectados en red como <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry>, donde la identidad del solicitante se puede verificar fácilmente.

source: The <citerefentry><refentrytitle>pam_ssh</refentrytitle><manvolnum>8</manvolnum></citerefentry> module provides both authentication and session services. The authentication service allows users who have passphrase-protected SSH secret keys in their <filename>~/.ssh</filename> directory to authenticate themselves by typing their passphrase. The session service starts <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry> and preloads it with the keys that were decrypted in the authentication phase. This feature is particularly useful for local logins, whether in X (using <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry> or another PAM-aware X login manager) or at the console.
es_es: El módulo <citerefentry><refentrytitle>pam_ssh</refentrytitle><manvolnum>8</manvolnum></citerefentry> proporciona servicios de autenticación y sesión. El servicio de autenticación permit a los usuarios que tienen claves secretas SSH protegidas con contraseña en su directorio <filename>~/.ssh</filename> para autenticarse escribiendo su contraseña. El servicio de sesión inicia <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry> y lo precarga con las claves que se descifraron en la fase de autenticación. Esta característica es particularmente útil para inicios de sesión locales, ya sea en X (usando <citerefentry vendor="xfree86"><refentrytitle>xdm</refentrytitle><manvolnum>1</manvolnum></citerefentry> u otro administrador de inicio de sesión en el entorno X compatible con PAM) o en la consola.

source: The <citerefentry><refentrytitle>pam_tacplus</refentrytitle><manvolnum>8</manvolnum></citerefentry> module
es_es: El módulo <citerefentry><refentrytitle>pam_tacplus</refentrytitle><manvolnum>8</manvolnum></citerefentry>

source: The <citerefentry><refentrytitle>pam_unix</refentrytitle><manvolnum>8</manvolnum></citerefentry> module implements traditional <trademark class="registered">UNIX</trademark> password authentication, using <citerefentry><refentrytitle>getpwnam</refentrytitle><manvolnum>3</manvolnum></citerefentry> to obtain the target account's password and compare it with the one provided by the applicant. It also provides account management services (enforcing account and password expiration times) and password-changing services. This is probably the single most useful module, as the great majority of admins will want to maintain historical behavior for at least some services.
es_es: El módulo <citerefentry><refentrytitle>pam_unix</refentrytitle><manvolnum>8</manvolnum></citerefentry> implementa la autenticación con contraseña tradicional <trademark class="registered">UNIX</trademark>, usando <citerefentry><refentrytitle>getpwnam</refentrytitle><manvolnum>3</manvolnum></citerefentry> para obtener la contraseña de la cuenta de destino y compararla con la proporciona por el applicant. También proporciona servicios de administración de cuentas (cumplimiento con los tiempos de expiración de cuentas y contraseñas) y servicios de cambio de contraseñas. Este es probablemente el módulo más útil, ya que la gran mayoría de los administradores querrán mantener el comportamiento de siempre en al menos algunos servicios.

source: PAM Application Programming
es_es: Programación de aplicaciones PAM

source: This section has not yet been written.
es_es: Esta sección aún no se ha escrito.

source: PAM Module Programming
es_es: Programación del módulo PAM

source: Sample PAM Application
es_es: Ejemplo de aplicación PAM

source: The following is a minimal implementation of <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> using PAM. Note that it uses the OpenPAM-specific <citerefentry><refentrytitle>openpam_ttyconv</refentrytitle><manvolnum>3</manvolnum></citerefentry> conversation function, which is prototyped in <filename>security/openpam.h</filename>. If you wish build this application on a system with a different PAM library, you will have to provide your own conversation function. A robust conversation function is surprisingly difficult to implement; the one presented in <xref linkend="pam-sample-conv"/> is a good starting point, but should not be used in real-world applications.
es_es: El siguiente ejemplo es una implementación mínima del comando <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> usando PAM. Tenga en cuenta que utiliza la función de conversación <citerefentry><refentrytitle>openpam_ttyconv</refentrytitle><manvolnum>3</manvolnum></citerefentry> específica de OpenPAM, que tiene su prototipo en <filename>security/openpam.h</filename>. Si desea compilar esta aplicación en un sistema con una libreria de PAM diferente, tendrá que proporcionar su propia función de conversación. Una función de conversación robusta es sorprendentemente difícil de implementar; el ejemplo del <xref linkend="pam-sample-conv"/> es un buen punto de partida, pero no debe utilizarse en aplicaciones del mundo real.

source: Sample PAM Module
es_es: Ejemplo de módulo PAM

source: The following is a minimal implementation of <citerefentry><refentrytitle>pam_unix</refentrytitle><manvolnum>8</manvolnum></citerefentry>, offering only authentication services. It should build and run with most PAM implementations, but takes advantage of OpenPAM extensions if available: note the use of <citerefentry><refentrytitle>pam_get_authtok</refentrytitle><manvolnum>3</manvolnum></citerefentry>, which enormously simplifies prompting the user for a password.
es_es: El siguiente ejemplo es una implementación mínima de <citerefentry><refentrytitle>pam_unix</refentrytitle><manvolnum>8</manvolnum></citerefentry>, ofrece solo servicios de autenticación. Debería de compilarse y ejecutarse con la mayoría de las implementaciones de PAM, pero aprovecha las extensiones de OpenPAM si están disponibles: tenga en cuenta el uso de <citerefentry><refentrytitle>pam_get_authtok</refentrytitle><manvolnum>3</manvolnum></citerefentry>, que simplifica enormemente la solicitud de una contraseña al usuario.

source: Sample PAM Conversation Function
es_es: Ejemplo de función de conversación PAM
