Repository: doc-br/zanata
Catalog: articles/*/port-mentor-guidelines.po
Languages: nb_no

# _
source: translator-credits
nb_no: Lars Skogstad (Norway) - <n3c@n3c.no> - 2019

source: Port Mentor Guidelines
nb_no: Port Mentor Retningslinjer

source: Guideline for Mentor/Mentee Relationships
nb_no: Retningslinje for Mentor / Mentee Relasjoner

source: This section is intended to help demystify the mentoring process, as well as a way to openly promote a constructive discussion to adapt and grow the guidelines. In our lives we have too many rules; we are not a government organization that inflicts regulation, but rather a collective of like minded individuals working toward a common goal, maintaining the quality assurance of the product we call the Ports Tree.
nb_no: Denne delen skal hjelpe demystifisere veiledningsprosessen, samt en måte å åpenlyst fremme en konstruktiv diskusjon for å tilpasse og utvide retningslinjene. I våres liv har vi for mange regler; Vi er ikke en regjeringsorganisasjon som påvirker regelverk, men heller et kollektiv av likesinnede personer som arbeider mot et felles mål, og opprettholder kvalitetssikringen av produktet vi kaller Ports Tree.

source: Why Mentor?
nb_no: Hvorfor akkurat Mentor?

source: For most of us, we were mentored into the Project, so return the favor by offering to mentor somebody else in.
nb_no: For de fleste av oss ble vi mentorisert inn i FreeBSD prosjektet, så returner tjenesten ved å tilby å veilede noen andre inn.

source: You have an irresistible urge to inflict knowledge on others.
nb_no: Du har en uimotståelig trang til å dele kunnskap med andre.

source: The usual punishment applies because you are sick and tired of committing somebody else's good work!
nb_no: Den vanlige straffen gjelder fordi du er syk og lei av å begå andres gode arbeid!

source: Reasons for a co-mentorship:
nb_no: Grunn for et samarbeids mentorskap:

source: Significant timezone differential. Accessible, interactive mentor(s) available via IM is extremely helpful!
nb_no: Signifikante tidssone forskjeller. Tilgjengelige, interaktive mentor(er) tilgjengelig via IM er ekstremt nyttig!

source: Potential language barrier. Yes, FreeBSD is very English oriented, as is most software development, however, having a mentor who can speak a native language can be very useful.
nb_no: Potensiell språkbarriere. Ja, FreeBSD er veldig engelsk orientert, også programvareutvikling, men å ha en mentor som kan snakke et morsmål kan være svært nyttig.

source: ENOTIME! Until there is a 30 hour day, and an 8 day week, some of us only have so much time to give. Sharing the load with somebody else will make it easier.
nb_no: Inntil det er en 30-timers dag og en 8-dagers uke, har noen av oss bare så mye tid til å gi. Å dele denne belastningen med noen andre vil gjøre det enklere for alle.

source: A rookie mentor can benefit from the experience of a senior committer/mentor.
nb_no: En nybegynner mentor kan dra nytte av opplevelser/erfaringer av en senior committer/mentor.

source: Two heads are better than one.
nb_no: To hoder tenker bedre enn et.

source: Reasons for sole mentorship:
nb_no: Grunner for solo mentorskap:

source: You do not play nicely with others.
nb_no: Du klarer ikke oppføre deg bra mot andre eller samarbeide med andre.

source: You prefer to have a one-on-one relationship.
nb_no: Du foretrekker å ha et en-mot-en forhold/relasjon.

source: The reasons for co-mentorship do not apply to you.
nb_no: Årsakene til co-mentorskap gjelder ikke for deg.

source: Expectations
nb_no: Forventninger

source: We expect mentors to review and test-build all proposed patches, at least for an initial period lasting more than a week or two.
nb_no: Vi forventer at veiledere vurderer og testbygger alle foreslåtte oppdateringer, i hvert fall for en innledende periode som varer mer enn en uke eller to.

source: We expect that mentors should take responsibility for the actions of their mentee. A mentor should follow up with all commits the mentee makes, both approved and implicit.
nb_no: Vi forventer at mentorer skal ta ansvar for handlinger fra deres mentee. En mentor bør følge opp med alle forpliktelser som menteer gjør, både godkjent og implisitt.

source: We expect mentors to make sure their mentees read the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook">Porter's Handbook</link>, the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/pr-guidelines">PR handling guide</link>, and the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide">Committer's Guide</link>. While it is not necessary to memorize all the details, every committer needs to have an overview of these things to be an effective part of the community (and avoid as many rookie mistakes as possible).
nb_no: Vi forventer mentorer for å sikre at deres mentees leser <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook">Porter's Handbook</link>, <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/pr-guidelines">PR handling guide</link>, og <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/committers-guide">Committer's Guide</link>. Selv om det ikke er nødvendig å huske alle detaljer, må alle kommittere ha en oversikt over disse tingene som en effektiv del av samfunnet (og unngå så mange rookie feil som overhode mulig).

source: Selecting a Mentee
nb_no: Velge en Mentee

source: There is no defined rule for what makes a candidate ready; it can be a combination of number of PRs they have submitted, the number of ports maintained, frequency of ports updates and/or level of participation in a particular area of interest like <application>GNOME</application>, <application>KDE</application>, <application>Gecko</application> or others.
nb_no: Det er ingen definert regel for hva som gjør en kandidat klar; det kan være en kombinasjon av antall PR som de har sendt inn, antall porter opprettholdt, oppdatering av porter, og/eller deltakelse i et bestemt område som <application>GNOME</application>, <application>KDE</application>,<application>Gecko</application> eller andre.

source: A candidate should have almost no timeouts, be responsive to requests, and generally helpful in supporting their ports.
nb_no: En kandidat bør ha nesten ikke ha timeouts, bør være responsiv på forespørsler og generelt nyttig for å støtte sine port utgivelser.

source: There must be a history of commitment, as it is widely understood that training a committer requires time and effort. If somebody has been around longer, and spent the time observing how things are done, there is some anticipation of accumulated knowledge. All too often we have seen a maintainer submit a few PRs, show up in IRC and ask when they will be given a commit bit.
nb_no: Det må være en historie med engasjement, da det er allment forstått at det å lære opp en kommitter krever tid og krefter. Hvis noen har holdt på lenger, og brukt tiden på å observere hvordan ting er gjort, er det en viss forventning om akkumulert kunnskap. Altfor ofte har vi sett en maintainer sende inn noen PR, for å så derette dukke opp i IRC og spør når de skal få en forpliktelsebit.

source: Being subscribed to, and following the mailing lists is very beneficial. There is no real expectation that submitting posts on the lists will make somebody a committer, but it demonstrates a commitment. Some mails offer insights into the knowledge of a candidate as well how they interact with others. Similarly participating in IRC can give somebody a higher profile.
nb_no: Å abonnere på, og følge adresselister er veldig gunstig. Det er ingen reell forventning om at innlevering av innlegg på listene vil gjøre noen til en kommitter, men det viser en viss forpliktelse. Noen eposter gir innsikt i kunnskapen en kandidat innehaver i tillegg til hvordan de samhandler med andre. Tilsvarende deltagelse i IRC kan gi noen en høyere profil og kan gjøre at man lettere blir lagt merke til.

source: Ask six different committers how many PRs a maintainer should submit prior to being nominated, and you will get six different answers. Ask those same individuals how long somebody should have been participating, same dilemma. How many ports should they have at a minimum? Now we have a bikeshed! Some things are just hard to quantify, a mentor will just have to use their best judgement, and hope that portmgr agrees.
nb_no: Spør seks forskjellige kommitterer hvor mange PR som en vedlikeholder skal sende før de blir nominert, og du vil garantert få seks forskjellige svar. Spør de samme personene hvor lenge noen burde ha deltatt, og du vil få samme dilemma. Hvor mange porter skal de ha på et minimum? samme dilemma der og. Noen ting er bare vanskelig å kvantifisere, en mentor må bare bruke sin beste dømmekraft, og håpe at portmgr er enig.

source: Mentorship Duration
nb_no: Mentorskapets varighet

source: As the trust level develops and grows, the mentee may be granted <quote>implicit</quote> commit rights. This can include trivial changes to a <filename>Makefile</filename>, <filename>pkg-descr</filename> etc. Similarly, it may include <varname>PORTVERSION</varname> updates that do not include <varname>plist</varname> changes. Other circumstances may be formulated at the discretion of the Mentor. However, during the period of mentorship, a port version bump that affects dependent ports should be checked by a mentor.
nb_no: Etter hvert som tillitsnivået utvikler seg og vokser, kan en mentee bli gitt <quote>implisitt</quote> commit rettigheter. Dette kan inneholde trivielle endringer i et <filename>Makefile</filename>, <filename>pkg-descr</filename> etc. På samme måte kan det inneholde <varname>PORTVERSION</varname> oppdateringer som ikke inkluderer <varname>plist</varname> endringer. Andre omstendigheter kan formuleres etter Mentorens oppførsel og vurdering. I løpet av perioden med mentorskap, bør en portversjons bump som påvirker avhengige porter, kontrolleres av en mentor.

source: Just as we are all varied individuals, each mentee has different learning curves, time commitments, and other influencing factors that will contribute to the time required before they can <quote>fly solo</quote>. Empirically, a mentee should be observed for at least 3 months. 90-100 commits is another target that a mentor could use before releasing a mentee. Other factors to consider prior releasing a mentee are the number of mistakes they may have made, QATs received etc. If they are still making rookie mistakes, they still require mentor guidance.
nb_no: Akkurat som vi er alle forskjellige individer, har hver mentee forskjellige læringskurver, tidsforpliktelser og andre påvirkningsfaktorer som vil bidra til tiden som kreves før de kan <quote>jobbe solo</quote>. Empirisk bør en mentee observeres i minst 3 måneder. 90-100 commits er et annet mål som en mentor kan bruke før du frigjør en mentee. Andre faktorer for å vurdere tidligere utgivelse av en mentee er antall feil de måtte ha gjort, QATs mottatt etc. Hvis de fortsatt gjør nybegynnerfeil, krever de fortsatt mentorveiledning.

source: Mentor/Co-Mentor Debate
nb_no: Mentor/Co-Mentor Debatt

source: When a request gets to portmgr, it usually reads as, <quote>I propose 'foo' for a ports commit bit, I will co-mentor with 'bar'</quote>. Proposal received, voted, and carried.
nb_no: Når en forespørsel kommer til portmgr, leses den vanligvis som, <quote> Jeg foreslår 'foo' for en portforbindelse, jeg vil være co-mentor med 'bar' </quote>. Forslag mottatt, stemt og tatt videre.

source: The mentor is the primary point of contact or the <quote>first among equals</quote>, the co-mentor is the backup.
nb_no: Mentoren er det primære kontaktpunktet eller <quote>først blant likeverdige</quote>, co-mentoren er backupen.

source: Some reprobate, whose name shall be withheld, made the <link xlink:href="https://lists.freebsd.org/pipermail/cvs-ports/2007-September/134614.html"> first recorded co-mentor commit</link>. Similar co-mentor commits have also been spotted in the src tree. Does this make it right? Does this make it wrong? It seems to be part of the evolution of how things are done.
nb_no: Noen klandrede, hvis navn skal holdes tilbake, gjorde <link xlink:href="https://lists.freebsd.org/pipermail/cvs-ports/2007-September/134614.html">første registrerte co-mentor commit</link>. Lignende co-mentorforbindelser har også blitt oppdaget i src-treet. Gjøres dette det riktig? Gjøres dette feil? Det ser ut til å være en del av utviklingen av hvordan ting gjøres.

source: We expect mentees to be prepared for constructive criticism from the community. There's still a lot of <quote>lore</quote> that is not written down. Responding well to constructive criticism is what we hope we are selecting for by first reviewing their existing contributions on IRC and mailing lists.
nb_no: Vi forventer at mentees skal være forberedt på konstruktiv kritikk fra samfunnet. Det er fortsatt mye <quote>kjennskap</quote> som ikke er direkteskrevet ned. Å svare godt på konstruktiv kritikk er det vi håper vi velger etter ved å først gjennomgå deres eksisterende bidrag på IRC og postlister.

source: We warn mentees that some of the criticism they receive may be less <quote>constructive</quote> than others, (whether through language communication problems, or excessive nit-picking), and that dealing with this gracefully is just part of being in a large community. In case of specific problems with specific people, or any questions, we hope that they will approach a portmgr member on IRC or by email.
nb_no: Vi advarer mentees om at noe av kritikken de mottar, kan være mindre <quote>konstruktiv</quote> enn andre (enten gjennom språkkommunikasjonsproblemer eller overdreven flisespikking), og at det å håndtere dette grasiøst bare er en del av å være i et stort samfunn. I tilfelle det er konkrete problemer med bestemte personer eller spørsmål, håper vi at de vil nærme seg et portmgr-medlem på IRC eller via e-post.
